[
    {
        "name": "Stone Works",
        "category": "Production",
        "requires": [
            {
                "type": "technology",
                "name": "Pit Mining"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 30
            },
            {
                "name": "Production",
                "value": 2
            }
        ],
        "description": "Stone works were sites and workshops where stone was quarried, dressed, and assembled for construction and tools. In the Neolithic and Bronze Age, workers extracted sarsen and bluestone for megaliths and used mauls, antler picks, wedge‑and‑groove, and fire‑setting. Ramps, sledges, and log rollers moved blocks from quarry to site. Finishing relied on pecking and polishing. Examples include Stonehenge quarrying at Carn Goedog and Craig Rhos‑y‑felin, Egyptian limestone and granite quarries at Tura and Aswan for pyramids and temples, and Mycenaean and Hittite fortification blocks. Stone works also produced querns, axes, and grinding stones for daily use. Their logistics required surveyors, overseers, and ration systems, often documented on early administrative records."
    },
    {
        "name": "Smith",
        "category": "Production",
        "requires": [
            {
                "type": "technology",
                "name": "Iron Working"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Stone Works"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 90
            },
            {
                "name": "Production",
                "value": 3
            }
        ],
        "description": "Iron Age and Classical smiths ran small workshops that forged bloom iron into tools and weapons. Hearths, bellows, anvils, tongs, and hammers supported refining by repeated heating and hammering. Carburization, quenching, and tempering improved edges. Hittite and Anatolian centers spread ironworking across the Near East. Greek and Roman blacksmiths supplied nails, hinges, ploughshares, spearheads, and armor fittings for armies and farms. Village forges in Europe, India, and Africa used local ore and charcoal to meet daily needs. In sub‑Saharan Africa, bloomery iron and skilled smithing supported agriculture and trade networks. The craft depended on apprenticeship, tool maintenance, and reliable fuel supplies, and smiths often held distinct social status."
    },
    {
        "name": "Forge",
        "category": "Production",
        "requires": [
            {
                "type": "technology",
                "name": "Steel Smithing"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Smith"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 160
            },
            {
                "name": "Production",
                "value": 4
            }
        ],
        "description": "Medieval and Renaissance forges achieved higher temperatures and tighter control of metallurgy. Water‑powered bellows and hammers increased throughput, while bloom refining and early steelmaking produced stronger edges and springs. In Europe, blast furnaces fed finery and chafery forges, supplying bars for armorers and toolmakers. Pattern welding and case hardening enhanced blades and tools. In Japan, tatara furnaces smelted satetsu into tamahagane; swordsmiths forged, quenched, and tempered laminated blades. In South and West Asia, crucible steels such as wootz travelled to Damascus and Isfahan, shaping a renowned bladesmithing tradition. Forges equipped mining, carpentry, and agriculture with chisels, saws, and scythes, and guilds and courts regulated quality and charcoal use."
    },
    {
        "name": "Factory",
        "category": "Production",
        "requires": [
            {
                "type": "technology",
                "name": "Industrialization"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Forge"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 360
            },
            {
                "name": "Production",
                "value": 6
            }
        ],
        "description": "Factories centralized labor and machinery under one roof to raise output. Early mills used water frames and spinning mules to mechanize textiles, then added steam to free production from rivers. Arkwright’s Cromford and other British mills set models for supervision, shift work, and cost accounting. The approach spread to ironworks, glasshouses, and armories. In the United States, the Lowell Mills combined power looms, boardinghouses, and regimented schedules. Russian and Indian mills followed as imperial and colonial markets grew. Factory discipline reshaped urban life and drew women and children into wage labor. Laws on hours, safety, and unions emerged in response to accidents, crowding, and pollution. By the late nineteenth century, integrated mills linked raw input, machine lines, and rail transport."
    },
    {
        "name": "Assembly Line",
        "category": "Production",
        "requires": [
            {
                "type": "technology",
                "name": "Replaceable Parts"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Factory"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 640
            },
            {
                "name": "Production",
                "value": 8
            }
        ],
        "description": "The assembly line divides production into ordered, repeatable steps. Work moves past stations where each team performs a small task. Chicago meatpacking pioneered moving disassembly lines. In 1913 Ford introduced a moving line for the Model T, sharply cutting assembly time and price. The method spread to appliances, radios, tractors, and aircraft. Shipyards adapted modular lines for Liberty ships in the Second World War. Continuous‑flow lines required standardized parts, timed logistics, and quality checks. The approach raised output but constrained worker autonomy, prompting later revisions and teamwork systems."
    },
    {
        "name": "Automated Factory",
        "category": "Production",
        "requires": [
            {
                "type": "technology",
                "name": "Robotics"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Assembly Line"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 1000
            },
            {
                "name": "Production",
                "value": 10
            }
        ],
        "description": "Automated factories integrate sensors, programmable controllers, and industrial robots with material handling systems. Numerical control and later CNC machines enabled precise, repeatable machining. From the 1970s, automotive plants installed robot arms for welding and painting. Semiconductor fabrication introduced cleanrooms, photolithography, and automated wafer transport. Japan, Germany, and South Korea became leaders in mechatronics and robot density. Computer networks coordinated scheduling, maintenance, and real‑time quality data. Automated fulfillment centers used conveyors, scanners, and mobile robots to route goods. These systems reduce variability and enable flexible batches but require skilled technicians and robust software. Safety standards, redundancy, and cybersecurity became central features of design and operation."
    },
    {
        "name": "Tax Collector",
        "category": "Gold",
        "requires": [
            {
                "type": "technology",
                "name": "Commerce"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 30
            },
            {
                "name": "Gold",
                "value": 2
            }
        ],
        "description": "Tax collectors in early states gathered staple goods, labor, and precious items for rulers and temples. In Mesopotamia, officials recorded grain, wool, and livestock on clay tablets with cylinder seals. Egyptian scribes assessed fields after the Nile flood and managed storehouses for corvée and levies. Hittite and Mycenaean palaces organized contributions through local authorities. In Shang China, bronzes and oracle bones attest to tribute and mobilized work. Collection supported irrigation, fortifications, and ritual. The role required literacy, measurement, and enforcement, and abuses led to audits and periodic reforms."
    },
    {
        "name": "Mint",
        "category": "Gold",
        "requires": [
            {
                "type": "technology",
                "name": "Currency"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Tax Collector"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 90
            },
            {
                "name": "Gold",
                "value": 3
            }
        ],
        "description": "A mint is a state or city facility that fabricates standardized coins. Coinage began in Lydia in the seventh to sixth centuries BCE with electrum staters. Greek poleis and the Achaemenid Empire adopted struck coinage using engraved dies and hammers. Roman mints produced vast issues of silver denarii and later base‑metal coins, marked by officina and mint signatures. In China, imperial mints cast round cash with square holes in bronze molds, maintaining weight standards across regions. Techniques included alloy control, die engraving, and edge treatments to deter clipping. Mints acted as fiscal tools, channeling bullion into a uniform medium for pay, taxation, and trade. Suspensions, reforms, and debasements tracked changing state finances."
    },
    {
        "name": "Guild Hall",
        "category": "Gold",
        "requires": [
            {
                "type": "technology",
                "name": "Feudalism"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Mint"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 160
            },
            {
                "name": "Gold",
                "value": 4
            }
        ],
        "description": "A guild hall housed the governing body of a craft or merchant association and served as its legal address. In medieval Europe, halls hosted assemblies, set apprenticeship rules, inspected wares, and stored records, banners, and chests. Examples include London’s livery company halls, the Cloth Hall of Ypres, and Lübeck’s merchant buildings tied to Hanseatic trade. Such halls arbitrated disputes and coordinated charity and funerary funds. Beyond Europe, urban guilds met in comparable venues, such as huiguan halls in Qing China that supported regional merchants. Architecture ranged from timber complexes to brick civic monuments on market squares, and ceremonies reinforced corporate standing within urban government."
    },
    {
        "name": "Bank",
        "category": "Gold",
        "requires": [
            {
                "type": "technology",
                "name": "Banking"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Guild Hall"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 360
            },
            {
                "name": "Gold",
                "value": 6
            }
        ],
        "description": "A bank is a regulated institution that accepts deposits, extends credit, and transfers payments. Renaissance Italian houses advanced bookkeeping and bills of exchange. Central banking emerged with the Bank of England in 1694, managing public debt and note issue. In the eighteenth and nineteenth centuries, joint‑stock and savings banks financed industry and infrastructure. Continental examples include Banque de France and the Rothschild network. Outside Europe, the Bank of Japan (1882) and the Imperial Bank of India (1895) anchored monetary systems. Banking crises prompted supervision, reserve requirements, and lender‑of‑last‑resort roles."
    },
    {
        "name": "Stock Exchange",
        "category": "Gold",
        "requires": [
            {
                "type": "technology",
                "name": "Economics"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Bank"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 640
            },
            {
                "name": "Gold",
                "value": 8
            }
        ],
        "description": "A stock exchange is a centralized marketplace where shares, bonds, and other securities are listed and traded. In the late 19th and 20th centuries, exchanges consolidated capital markets and standardized disclosure. The New York Stock Exchange grew into a global center. The London Stock Exchange modernized listing practices. The Paris Bourse coordinated continental finance. Outside Europe and North America, the Bombay Stock Exchange (1875), Tokyo Stock Exchange (1878), Shanghai exchange (1891), and Johannesburg exchange (1887) linked regional savings to industry and mining. Open outcry gave way to ticker systems and later to fully electronic platforms. Regulatory regimes followed crises, such as the 1929 crash and mid‑20th‑century reforms. Exchanges enabled price discovery, corporate governance, and international investment flows."
    },
    {
        "name": "Startup Hub",
        "category": "Gold",
        "requires": [
            {
                "type": "technology",
                "name": "Online Economy"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Stock Exchange"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 1000
            },
            {
                "name": "Gold",
                "value": 10
            }
        ],
        "description": "A startup hub is a shared workspace and incubator that offers early-stage firms mentoring, networking, small grants or seed investment, and access to technical talent. The model grew with late 20th‑century venture capital and the internet economy. Silicon Valley accelerators and coworking spaces formed dense founder and investor networks. Y Combinator and similar programs systematized short, cohort-based funding and guidance. Global nodes emerged: Shenzhen hardware accelerators, Bangalore and Hyderabad incubators, Tel Aviv’s innovation centers, Berlin’s Factory and Rocket ecosystem, Nairobi’s iHub, and Paris’s Station F. Hubs host pitch events, prototyping labs, and legal or accounting clinics. They shorten product cycles, encourage iterative testing, and channel capital toward scalable technology ventures."
    },
    {
        "name": "Scribery",
        "category": "Science",
        "requires": [
            {
                "type": "technology",
                "name": "Writing"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 30
            },
            {
                "name": "Science",
                "value": 2
            }
        ],
        "description": "A scribery is a workshop where trained scribes produce and manage written records. In the late Neolithic and Bronze Age, such facilities underpinned early administration. Sumerian schools in Uruk taught cuneiform on clay tablets for accounts, contracts, and temple inventories. Egyptian temple scribes used papyrus, inks, and reed pens to record taxation and royal decrees. Edubba training produced standardized hands and formulae. Media included clay, papyrus, and ostraca. Tools ranged from styluses to brush pens. Comparable record centers appeared in Shang China, where scribes inscribed divinations on oracle bones. Scriberies preserved knowledge, enabled long-distance trade documentation, and anchored legal memory. Their output forms a major archaeological source for the emergence of bureaucracy and urban economies."
    },
    {
        "name": "Library",
        "category": "Science",
        "requires": [
            {
                "type": "technology",
                "name": "Alphabet"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Scribery"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 90
            },
            {
                "name": "Science",
                "value": 3
            }
        ],
        "description": "A library is an organized collection of texts preserved for retrieval and study. Early institutions stored tablets and papyri within palaces and temples. The Library of Ashurbanipal at Nineveh assembled cuneiform works on history, ritual, and science. In the Hellenistic period, the Library of Alexandria pursued large-scale collection, cataloging, and translation of Greek and Near Eastern texts; Pergamon maintained a competing center. Across the ancient Mediterranean and Near East, rulers and priests curated archives for law, diplomacy, and scholarship. Catalogs, copyists, and acquisition policies formalized preservation. Early imperial China maintained court libraries and archives. Libraries sustained philology, geography, and medicine, and transmitted canonical works that shaped later education and legal systems."
    },
    {
        "name": "Printing Press",
        "category": "Science",
        "requires": [
            {
                "type": "technology",
                "name": "Machinery"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Library"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 160
            },
            {
                "name": "Science",
                "value": 4
            }
        ],
        "description": "The printing press is a mechanical device that uses movable type and a press mechanism to produce uniform pages at scale. In mid‑15th‑century Mainz, Johannes Gutenberg combined metal type, oil-based inks, and a screw press, lowering costs and enabling rapid reproduction. The Gutenberg Bible demonstrated typographic quality and commercial feasibility. Venetian and Rhine presses spread the craft across Europe, supplying legal texts, almanacs, and vernacular literature. Print accelerated the Reformation, scientific correspondence, and standardized scholarship through editions and errata. Earlier movable metal type had been used in Goryeo Korea in the 13th century, while woodblock printing had long histories in China and Japan. European presses reached Mexico City by 1539 and Goa by 1556, extending print to the Americas and South Asia. Privileges, censorship, and printer guilds shaped markets. The press transformed literacy, state administration, and knowledge circulation."
    },
    {
        "name": "University",
        "category": "Science",
        "requires": [
            {
                "type": "technology",
                "name": "Education"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Printing Press"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 360
            },
            {
                "name": "Science",
                "value": 6
            }
        ],
        "description": "A university is an institution that confers degrees, organizes advanced teaching, and conducts research. Medieval foundations such as Bologna, Paris, and Oxford formalized faculties and corporate governance. Earlier centers of higher learning included Al‑Qarawiyyin in Fez, Al‑Azhar in Cairo, and the Buddhist university at Nalanda. In the 18th–19th centuries, the Humboldtian model in Germany integrated research laboratories, seminars, and academic freedom. European reforms influenced technical institutes and modern curricula. Universities expanded globally through colonial and national projects: the Universities of Calcutta and Bombay (1857), the University of Tokyo (1877), and later Cairo and São Paulo. They credentialed professions, trained civil services, and advanced science through specialized chairs, journals, and peer-reviewed standards."
    },
    {
        "name": "Research Lab",
        "category": "Science",
        "requires": [
            {
                "type": "technology",
                "name": "Atomic Theory"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "University"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 640
            },
            {
                "name": "Science",
                "value": 8
            }
        ],
        "description": "A research lab is a facility designed for systematic experimentation with controlled instruments, protocols, and staff specialization. In the late 19th century, physics and chemistry laboratories such as the Cavendish and the Kaiser Wilhelm Institutes set the model for team-based inquiry. Industrial research emerged with General Electric and Bell Laboratories, which produced the vacuum tube, transistor, and information theory. Government laboratories scaled wartime and national projects, from Los Alamos to the Kurchatov Institute. Labs established shared apparatus, reproducible methods, and apprenticeship systems for technicians and graduate students. Their outputs included radar, nuclear fission control, X‑ray crystallography advances, and early molecular biology, linking fundamental discovery to applied technology."
    },
    {
        "name": "Nanotech Lab",
        "category": "Science",
        "requires": [
            {
                "type": "technology",
                "name": "Composites"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Research Lab"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 1000
            },
            {
                "name": "Science",
                "value": 10
            }
        ],
        "description": "A nanotech lab focuses on fabrication and measurement at molecular and atomic scales. Core tools include cleanrooms, electron microscopes, scanning tunneling and atomic force microscopes, and lithography systems. The field advanced with IBM demonstrations of atomic manipulation in the 1980s, followed by fullerene discovery, carbon nanotubes, and graphene isolation. National centers and university facilities coordinate large instrumentation: the US NNCI network, Europe’s nanoscience hubs, China’s NCNST in Beijing, Japan’s RIKEN, India’s CeNSE, and KAUST in Saudi Arabia. Research spans nanoelectronics, catalysts, drug delivery, membranes, and coatings. Labs also develop metrology, toxicity studies, and standards to manage risks and ensure repeatability in devices and materials."
    },
    {
        "name": "Potter",
        "category": "Growth",
        "requires": [
            {
                "type": "technology",
                "name": "Pottery"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 30
            },
            {
                "name": "Citizen Slot",
                "value": 1,
                "for": [
                    {
                        "type": "concept",
                        "name": "Building"
                    }
                ]
            }
        ],
        "description": "A potter’s workshop produces ceramic vessels for cooking, storage, and exchange. Early Neolithic centers such as Çatalhöyük used coiling and open firing. Jomon communities in Japan created cord-marked wares over millennia. The potter’s wheel, adopted in ancient Mesopotamia, increased speed and uniformity by the late 4th millennium BCE. Materials included local clays, tempers, and slips; firing ranged from bonfires to updraft kilns. Forms served domestic and commercial needs, from storage jars to transport amphorae. Decorative styles signaled community traditions and trade contacts, as with Yangshao painted wares or Lapita dentate-stamped pottery across the Pacific. Workshops ranged from household production to specialized urban quarters supplying regional markets."
    },
    {
        "name": "Granary",
        "category": "Growth",
        "requires": [
            {
                "type": "technology",
                "name": "Construction"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Potter"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 90
            },
            {
                "name": "Citizen Slot",
                "value": 2,
                "for": [
                    {
                        "type": "concept",
                        "name": "Building"
                    }
                ]
            }
        ],
        "description": "A granary is a purpose-built structure for storing harvested grain to stabilize food supplies. Designs used raised floors, ventilated bins, sealed silos, and thick walls to deter pests and moisture. State systems in ancient Egypt collected and redistributed grain through temple and palace granaries. Roman horrea supported urban provisioning and military logistics. In South Asia, large brick granaries at Harappa and Mohenjo‑daro indicate planned storage in the Indus cities. In the ancient Near East, storage complexes managed tax in kind and emergency reserves. Administrative records tracked inflows, rations, and loans. Granaries buffered seasonal cycles, underpinned taxation, and enabled urban growth by separating production from consumption in space and time."
    },
    {
        "name": "Windmill",
        "category": "Growth",
        "requires": [
            {
                "type": "technology",
                "name": "Machinery"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Granary"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 160
            },
            {
                "name": "Citizen Slot",
                "value": 3,
                "for": [
                    {
                        "type": "concept",
                        "name": "Building"
                    }
                ]
            }
        ],
        "description": "Windmills harness wind to drive mechanical work, most commonly grinding grain and pumping water. Early panemone windmills appeared in eastern Iran and Afghanistan by the 9th century, using horizontal shafts and vertical sails. Post mills and later tower mills spread across medieval Europe, improving efficiency and durability. The Netherlands adapted large tower mills to drainage tasks, reclaiming polder lands at Kinderdijk and along the Zuiderzee. Iberian and Mediterranean regions used small stone tower mills for village milling. In England and northern Germany, multi-stage gearing enabled flour production at urban scales. By the 19th century, American multivaned wind engines supplied water to farms and railroads on the Great Plains. While electric motors displaced many mills, heritage sites and modern windpumps persist, and traditional mills survive in Spain’s La Mancha and Greek islands."
    },
    {
        "name": "Dispensary",
        "category": "Growth",
        "requires": [
            {
                "type": "technology",
                "name": "Medicine"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Windmill"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 360
            },
            {
                "name": "Citizen Slot",
                "value": 5,
                "for": [
                    {
                        "type": "concept",
                        "name": "Building"
                    }
                ]
            }
        ],
        "description": "A dispensary is a facility that distributes medicines and provides basic clinical services outside full hospitals. In the 18th and 19th centuries, charitable dispensaries appeared in European and American cities to treat the urban poor and offer vaccinations. British imperial administrations established civil and military dispensaries across India and Africa to support colonial staff and local populations. Missionary stations often combined pharmacies with small wards. In France and Russia, municipal dispensaries formed part of public health campaigns against smallpox and later tuberculosis. Latin American port cities developed quarantine dispensaries to manage epidemics. Training for compounders and apothecaries grew alongside these networks. By the early 20th century, dispensaries were integrated into national health systems, evolving into polyclinics and primary health centers, while hospital outpatient departments assumed many dispensing functions."
    },
    {
        "name": "Metro System",
        "category": "Growth",
        "requires": [
            {
                "type": "technology",
                "name": "Combustion"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Dispensary"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 640
            },
            {
                "name": "Citizen Slot",
                "value": 7,
                "for": [
                    {
                        "type": "concept",
                        "name": "Building"
                    }
                ]
            }
        ],
        "description": "Metro systems are grade-separated urban railways designed for rapid, high-capacity transport. The first section opened in London in 1863 with steam traction, later electrified and expanded into the Underground. Paris launched an electric network in 1900, setting design standards in station architecture and signage. New York’s subway opened in 1904 and grew into a vast multi-operator system. Moscow’s metro, begun in the 1930s, introduced deep-level stations with robust civil defense features. Tokyo built interconnected subways after 1927, later integrating with suburban rail. Postwar decades saw extensive builds in Mexico City, São Paulo, Seoul, and Delhi to manage explosive urban growth. Modern systems employ automated signaling, platform screen doors, and contactless fares, while legacy networks continue phased upgrades to ventilation, fire safety, and accessibility."
    },
    {
        "name": "Fullfillment Center",
        "category": "Growth",
        "requires": [
            {
                "type": "technology",
                "name": "Delivery Services"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Metro System"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 1000
            },
            {
                "name": "Citizen Slot",
                "value": 9,
                "for": [
                    {
                        "type": "concept",
                        "name": "Building"
                    }
                ]
            }
        ],
        "description": "Fulfillment centers are large distribution warehouses that store inventory, pick orders, pack goods, and dispatch parcels for rapid delivery. Their roots lie in postwar catalog houses and regional logistics depots. From the late 20th century, e-commerce scaled the model with conveyorized sortation, barcode tracking, and real-time inventory control. Amazon pioneered high-throughput designs using zone picking and robotics such as Kiva-style mobile units. In China, Alibaba’s Cainiao and JD.com operate automated hubs linking vendors to nationwide courier networks. Europe’s Ocado developed grid robots for grocery fulfillment. India and Southeast Asia host multi-tenant sites serving marketplace sellers. Proximity to airports and highways reduces cycle times. Continuous optimization in slotting, packaging, and last-mile routing underpins same-day and next-day delivery promises."
    },
    {
        "name": "Obelisk",
        "category": "Culture",
        "requires": [
            {
                "type": "technology",
                "name": "Tradition"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 30
            },
            {
                "name": "Culture",
                "value": 2
            }
        ],
        "description": "An obelisk is a monolithic or segmented stone shaft with a square plan, tapering sides, and a pyramidal top. In ancient Egypt, pairs flanked temple entrances at sites such as Karnak and Luxor, inscribed with royal names and dedications. Roman emperors transported several to Rome, where they were re-erected in circuses and later on papal piazzas. The form inspired related monumental traditions, including the stelae field at Aksum in Ethiopia. Modern commemorative obelisks adapt stone to masonry and iron frameworks, the largest being the Washington Monument in the United States. Surviving ancient examples include the Lateran Obelisk in Rome and the unfinished obelisk at Aswan, which preserves quarrying techniques. Their relocations document long histories of imperial collection and urban redesign."
    },
    {
        "name": "Amphitheater",
        "category": "Culture",
        "requires": [
            {
                "type": "technology",
                "name": "Drama"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Obelisk"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 90
            },
            {
                "name": "Culture",
                "value": 3
            }
        ],
        "description": "An amphitheater is a tiered, open-air structure for large audiences. In Roman usage it is an elliptical arena encircled by seating for spectacles such as games and hunts. The Colosseum in Rome and the amphitheaters at Verona and El Djem illustrate the type’s engineering with vaulted corridors and radial stairways. Greek sites like Epidaurus are semi-circular theaters built into hillsides for drama and music, often grouped with sanctuaries; they share acoustical and seating principles but differ in plan and purpose. Excavated amphitheaters at Pompeii and Capua show early stone construction replacing timber. Late antiquity and medieval periods reused many for housing or fortification. Modern amphitheaters, from Red Rocks in Colorado to Epidaurus in continued use, host concerts and festivals."
    },
    {
        "name": "Theater",
        "category": "Culture",
        "requires": [
            {
                "type": "technology",
                "name": "Theater"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Amphitheater"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 160
            },
            {
                "name": "Culture",
                "value": 4
            }
        ],
        "description": "Theater buildings are specialized venues for staged drama with a defined auditorium, stage, and backstage. Permanent indoor theaters appeared in Renaissance Italy, with Palladio’s Teatro Olimpico (1585) and the early proscenium at Teatro Farnese (1618). Elizabethan London built open-roofed playhouses such as The Globe, using thrust stages and standing yards. Continental Europe developed opera and spoken-drama houses with horseshoe auditoria and stage machinery. In Japan, Edo-period Kabuki playhouses featured revolving stages and hanamichi walkways, while China’s teahouse theaters supported regional opera. Fire-safe construction, gas and later electric lighting, and iron-framed roofs transformed 19th-century designs. The 20th century introduced flexible black-box stages and civic repertory complexes. Historic theaters survive from Paris’s Comédie-Française to Hanoi’s colonial opera house adapted for drama."
    },
    {
        "name": "Opera",
        "category": "Culture",
        "requires": [
            {
                "type": "technology",
                "name": "Opera"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Theater"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 360
            },
            {
                "name": "Culture",
                "value": 6
            }
        ],
        "description": "Opera is a staged drama set to music for voices and orchestra. It emerged in late Renaissance Italy, with Monteverdi’s works bridging court spectacle and public theater. The genre spread to France and the German states, developing national styles and forms such as bel canto and music drama. Major houses, including La Scala, the Vienna State Opera, and the Metropolitan Opera, institutionalized seasonal production. Outside Europe, Buenos Aires’s Teatro Colón and Shanghai’s early opera circuits hosted international companies. New works and revivals continue worldwide, with contemporary composers expanding subject matter and staging techniques."
    },
    {
        "name": "Cinema",
        "category": "Culture",
        "requires": [
            {
                "type": "technology",
                "name": "Radio"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Opera"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 640
            },
            {
                "name": "Culture",
                "value": 8
            }
        ],
        "description": "A cinema is a building equipped to project motion pictures to paying audiences. Public screenings began in the 1890s, followed by nickelodeons in North American and European cities. Purpose-built picture houses emerged in the 1910s, expanding into ornate movie palaces during the silent era. Sound adoption after 1927 reshaped auditorium acoustics and projection booths. The mid-20th century saw suburban single screens and, later, multiplex complexes with shared lobbies and staggered programming. Distinct national landscapes include India’s single-screen halls, Japan’s studio-linked theaters, and Nigeria’s modern urban cinemas. Art houses fostered noncommercial and festival circuits. Digital projection in the 2000s reduced film handling costs and enabled 3D, while heritage cinemas preserve classic interiors."
    },
    {
        "name": "Internet Provider",
        "category": "Culture",
        "requires": [
            {
                "type": "technology",
                "name": "Internet"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Cinema"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 1000
            },
            {
                "name": "Culture",
                "value": 10
            }
        ],
        "description": "An internet provider supplies end users with connectivity to packet-switched networks and the global internet. Early commercial ISPs in the late 1980s and 1990s offered dial-up access, email, and Usenet. Large telecom firms later delivered broadband via DSL, cable, and fiber, while mobile operators expanded access through 3G, 4G, and 5G. Peering at internet exchange points and content delivery networks improved performance. Notable providers include AOL in the United States, NTT in Japan, Orange in France, and MTN across Africa. Present services bundle home Wi‑Fi, IPv6, cloud peering, and security filtering."
    },
    {
        "name": "Shrine",
        "category": "Faith",
        "requires": [
            {
                "type": "technology",
                "name": "Mysticism"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 30
            },
            {
                "name": "Faith",
                "value": 2
            }
        ],
        "description": "A shrine is a compact sacred locus used for offerings, petition, and remembrance from the Neolithic onward. Early enclosures such as Göbekli Tepe gathered communities for seasonal rites and feasting. Many shrines were simple stone circles, hearths, or post-marked spaces within villages. Others stood along roads or near springs to invite travelers’ devotion. Materials varied by region: earth and timber in forests, dry stone on plains, carved rock in deserts. Votive deposits, figurines, and libations attest to sustained use. Shinto hokora in Japan, Yoruba shrines to Ogun in West Africa, and Andean huacas show wide geographic range. The shrine anchored calendars, oath taking, and ancestor veneration. It often persisted beside later temples, serving local needs even as formal priesthoods grew."
    },
    {
        "name": "Temple",
        "category": "Faith",
        "requires": [
            {
                "type": "technology",
                "name": "Organized Religion"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Shrine"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 90
            },
            {
                "name": "Faith",
                "value": 3
            }
        ],
        "description": "Temples are permanent structures for organized worship, ritual storage, and priestly administration that matured by the Iron Age. Plans commonly feature axial approaches, a sacred cella, and controlled thresholds. Egyptian complexes at Karnak and Luxor integrated ceremonial avenues, storerooms, and workshops. Mesopotamian temple platforms and ziggurats combined cult with accounting and land management. Greek and Roman temples standardized peripteral forms and stone orders. In South Asia, Hindu temples such as Brihadisvara and South Indian gopuram gateways coordinated daily puja with royal patronage. Southeast Asian sites like Angkor Wat fused cosmology and state power through vast enclosures and relief programs. Chinese Buddhist monasteries and Japanese temple compounds organized halls, pagodas, and cloisters around courtyards. The temple bound ritual, economy, and urban identity."
    },
    {
        "name": "Cathedral",
        "category": "Faith",
        "requires": [
            {
                "type": "technology",
                "name": "Buttress"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Temple"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 160
            },
            {
                "name": "Faith",
                "value": 4
            }
        ],
        "description": "A cathedral is the principal church of a bishop and a major work of medieval and early modern engineering. Builders refined rib vaults, pointed arches, and flying buttresses to span wide naves and admit light through stained glass. Notre-Dame de Paris, Chartres, and Salisbury illustrate structural ambition and stone craftsmanship. The Byzantine legacy of domed volumes reached a summit in Hagia Sophia at Constantinople, later adapted as a mosque. Comparable monumental sacred buildings outside Europe, such as the Great Mosque of Djenné, pursued similar scale with different materials, including mud brick and timber. Cathedrals housed shrines, choirs, and chapter facilities. They organized processions, education, and charity. Their towers and façades shaped skylines, and their building campaigns fostered guild labor, quarrying, and long-distance trade."
    },
    {
        "name": "Congregation",
        "category": "Faith",
        "requires": [
            {
                "type": "technology",
                "name": "Royal Charter"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Cathedral"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 360
            },
            {
                "name": "Faith",
                "value": 6
            }
        ],
        "description": "A congregation is a legally constituted religious community with rights to meet, govern, and own property under civil authority. In early modern Europe many congregations operated as parish corporations with vestry governance and tithe finance. Royal charters endorsed churches in colonial settlements across the Atlantic and Indian Oceans. New England Congregationalists elected ministers and managed meetinghouses through town votes. Jewish kehilla boards coordinated worship and charity within municipal law. Sikh gurdwara committees oversaw langar kitchens and funds. By the nineteenth century denominational registries, trust deeds, and marriage registers fixed congregational status in Britain, the United States, and beyond. Legal form enabled discipline, education, and missions, and framed disputes over dissent and church–state boundaries."
    },
    {
        "name": "Televangelist",
        "category": "Faith",
        "requires": [
            {
                "type": "technology",
                "name": "Mass Media"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Congregation"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 640
            },
            {
                "name": "Faith",
                "value": 8
            }
        ],
        "description": "A televangelist is a religious preacher who uses broadcast media to reach mass audiences. The role grew from 1920s radio revivals led by figures such as Aimee Semple McPherson. Television expanded scale after 1945, with Billy Graham’s crusades syndicated across continents. Ministries adopted studios, choirs, and counseling hotlines, and funded operations through donations and sales. Latin American and African Pentecostal broadcasters built large followings via state and satellite networks. Programs addressed salvation, healing, and social issues, often engaging electoral politics. Regulators and journalists scrutinized claims, finances, and consumer protection. By the 1990s, cable and global satellites created transnational ministries, later extended by livestreaming and social media."
    },
    {
        "name": "Megachurch",
        "category": "Faith",
        "requires": [
            {
                "type": "technology",
                "name": "Vertical Flight"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Televangelist"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 1000
            },
            {
                "name": "Faith",
                "value": 10
            }
        ],
        "description": "A megachurch is a modern congregation with very large weekly attendance, often exceeding 2,000, meeting in purpose-built auditoriums. Campuses integrate worship halls, classrooms, cafés, bookstores, and children’s facilities. Many operate multi-service schedules, small-group networks, and extensive volunteer systems. Media production, live music, and digital streaming extend reach beyond the site. Notable examples include Lakewood Church in Houston, Saddleback Church in California, and Yoido Full Gospel Church in Seoul. In Africa, the Redeemed Christian Church of God developed vast worship grounds near Lagos. Singapore’s City Harvest and Australia’s Hillsong illustrate regional variants. Some Muslim contexts built large modern mosques with comparable programmatic scale. Megachurches influence urban planning, traffic, and local economies, while drawing debate over governance, transparency, and civic roles."
    },
    {
        "name": "Town Healer",
        "category": "Health",
        "requires": [
            {
                "type": "technology",
                "name": "Herbal Remedies"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 30
            },
            {
                "name": "Health",
                "value": 2
            }
        ],
        "description": "The town healer provided everyday care before regulated medicine. Practitioners combined herb lore, diet, massage, and prayer or divination. European wise women and bonesetters treated fevers, fractures, and childbirth. In West Africa, babalawo and other specialists used plant pharmacology and ritual practice. Indigenous curanderos in the Americas blended precolonial and Christian elements. Hakims in the Islamic world applied Greco-Arabic humoral theory, while Chinese sinseh relied on pulse diagnosis and materia medica. Healers mixed local harvesting with trade in spices, resins, and minerals. Authorities alternated between licensing, toleration, and persecution, especially during epidemics. Despite competition from physicians, many households relied on the healer’s proximity, low cost, and embedded knowledge of community ailments."
    },
    {
        "name": "Aqueduct",
        "category": "Health",
        "requires": [
            {
                "type": "technology",
                "name": "Construction"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Town Healer"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 90
            },
            {
                "name": "Health",
                "value": 3
            }
        ],
        "description": "An aqueduct is an engineered system that conveys water by gravity from source to settlement. Designers balanced gradients using cut channels, covered conduits, bridges, and inverted siphons. Roman works such as Pont du Gard, Aqua Claudia, and the Valens Aqueduct supplied baths, fountains, and industries. Persian qanats tapped aquifers through gently sloped tunnels and vertical shafts, enabling irrigation and urban supply in arid zones. In the Andes, Inca canals at Tipón delivered water across terraces with precise stonework. Sri Lankan hydraulic landscapes linked reservoirs to cities through long embankments and spillways. Materials ranged from ashlar and concrete to brick and ceramic pipe. Maintenance regimes guarded purity and flow. Aqueducts stabilized populations, supported sanitation, and underpinned urban growth for millennia."
    },
    {
        "name": "Apothecary",
        "category": "Health",
        "requires": [
            {
                "type": "technology",
                "name": "Clinker Hulls"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Aqueduct"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 160
            },
            {
                "name": "Health",
                "value": 4
            }
        ],
        "description": "An apothecary was both shop and practitioner specializing in the preparation and sale of medicinals. Stock included dried herbs, gums, resins, minerals, and distillates stored in labeled jars. Compounding used balances, mortars, percolators, and stills, guided by local pharmacopeias. In the Islamic world, pharmacies in Baghdad and Cairo operated under market inspection and produced syrups and electuaries. Song and Ming China sustained apothecary guilds tied to materia medica texts and pulse traditions. Medieval and Renaissance Europe regulated apothecaries alongside physicians and surgeons, later evolving into chemists and pharmacists. Colonial boticas in New Spain and the Philippines connected imperial trade to local remedies. By the nineteenth century formal training, standardized dosing, and prescription practices reshaped the apothecary into modern pharmacy."
    },
    {
        "name": "Hospital",
        "category": "Health",
        "requires": [
            {
                "type": "technology",
                "name": "Medicine"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Apothecary"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 360
            },
            {
                "name": "Health",
                "value": 6
            }
        ],
        "description": "A hospital is an institution for organized medical care, observation, and training. Early forms included Buddhist facilities patronized by Ashoka and Christian xenodochia that sheltered the poor and sick. Islamic bimaristans in Baghdad, Damascus, and Cairo offered wards, pharmacies, and teaching rounds. European medieval hospitals combined charity with limited clinical work. From the eighteenth century, urban hospitals increasingly emphasized surgery, anatomy, and case records. The nineteenth century brought anesthesia, antisepsis, pavilion plans, nursing reforms led by Florence Nightingale, and public health integration. Notable examples include St Bartholomew’s Hospital in London, the Hôtel-Dieu in Paris, and Pennsylvania Hospital in Philadelphia. Twentieth-century hospitals added laboratories, imaging, and intensive care, becoming central nodes in national health systems worldwide."
    },
    {
        "name": "Supermarket",
        "category": "Health",
        "requires": [
            {
                "type": "technology",
                "name": "Plastics"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Hospital"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 640
            },
            {
                "name": "Health",
                "value": 8
            }
        ],
        "description": "The supermarket is a large self-service retail format that concentrates food, medicine, and household goods under one roof. Self-service began in the early 20th century, notably with Piggly Wiggly in 1916, and scaled through chain systems like A&P. Refrigeration, the automobile, and suburban development after 1945 created wide aisles, parking, and high-volume distribution. Barcode scanning in the 1970s, plastic packaging, and cold-chain logistics standardized inventory and extended shelf life. Many chains adopted private labels and centralized warehousing. The format globalized through firms such as Walmart in the United States, Tesco in the United Kingdom, Carrefour’s hypermarkets in France and beyond, Shoprite in Africa, Pão de Açúcar in Brazil, and Aeon in Japan. Supermarkets reshaped diets, retail labor, and supply chains, and became anchors of modern consumer landscapes."
    },
    {
        "name": "Medical Clinic",
        "category": "Health",
        "requires": [
            {
                "type": "technology",
                "name": "Genetics"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Supermarket"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 1000
            },
            {
                "name": "Health",
                "value": 10
            }
        ],
        "description": "A medical clinic delivers outpatient diagnosis and treatment, ranging from primary care to specialized services. The model expanded in the late 20th century with urgent care centers, community health clinics, and polyclinics that coordinate laboratory testing and imaging. National systems organized care through GP surgeries in the UK and polyclinics in the Soviet Union and successor states. Post-1970 innovations added ultrasound, CT scanning, and day-surgery suites, reducing hospital stays. Mobile clinics extended vaccination and HIV care across Africa, South Asia, and Latin America. Genomics and precision medicine introduced counseling and targeted therapies in specialty clinics. Telemedicine networks linked remote patients to urban specialists. Clinics now function as the frontline of public health, offering screening, triage, and chronic disease management while integrating electronic records and standardized protocols."
    },
    {
        "name": "Garden",
        "category": "Happiness",
        "requires": [
            {
                "type": "technology",
                "name": "Irrigation"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 30
            },
            {
                "name": "Happiness",
                "value": 2
            }
        ],
        "description": "A garden is a planned plot for food, ornament, and rest. Early gardens appeared with Neolithic horticulture along rivers and village edges. Bronze Age courts in Mesopotamia and the Levant developed irrigated, walled gardens attached to palaces and temples. Egyptian homes and estates used basins, date palms, and vegetable beds along the Nile floodplain. The Persian pairidaeza shaped later Islamic and Mughal charbagh layouts. Chinese scholar gardens blended rocks, ponds, and pavilions as sites of reflection. Mesoamerican chinampas created fertile plots on lake shallows that supported dense urbanism. Medieval kitchen gardens sustained monasteries and towns. In early modern and modern eras, botanical gardens advanced plant exchange and science, while public parks brought structured planting to urban leisure. Gardens remained adaptable spaces that mediate cultivation, status, and community."
    },
    {
        "name": "Arena",
        "category": "Happiness",
        "requires": [
            {
                "type": "technology",
                "name": "Sports"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Garden"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 90
            },
            {
                "name": "Happiness",
                "value": 3
            }
        ],
        "description": "An arena is a large venue built for contests, spectacles, and assemblies. In classical Greece, stadia hosted footraces and festivals with terraced seating. Rome developed amphitheaters such as the Colosseum for gladiatorial combats, animal hunts, and public ceremonies. The Roman Circus Maximus and later hippodromes staged chariot racing as mass entertainment. Mesoamerican ballcourts provided ritual sport complexes in city centers. Arenas served civic identity, imperial display, and crowd management with radial access and durable masonry. After antiquity, bullrings in Spain and Latin America, and covered velodromes and boxing halls, continued the type. Modern arenas adopt steel and concrete shells, retractable roofs, and electronic scoreboards, hosting sports, concerts, and political rallies. They remain central urban landmarks tied to mass gathering and engineered sightlines."
    },
    {
        "name": "Tavern",
        "category": "Happiness",
        "requires": [
            {
                "type": "technology",
                "name": "Trade Caravans"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Arena"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 160
            },
            {
                "name": "Happiness",
                "value": 4
            }
        ],
        "description": "The tavern is a food-and-drink house that served travelers and locals as a social and commercial node. In medieval Europe, alehouses and inns supplied meals, beds, and news along pilgrimage and trade routes under guild and royal regulation. Urban taverns provided meeting rooms for guilds, merchants, and municipal business. Comparable venues appeared widely: Chinese wine shops and tea-beer houses, Japanese establishments that evolved into Edo-period izakaya, and portside drinking houses across the Atlantic and Indian oceans. Colonial American taverns doubled as post offices, courts, and political forums. Maritime taverns catered to seafarers with credit and hiring. Authorities policed taverns for moral order, licensing, and taxation. By the 19th century, purpose-built public houses and hotels absorbed many functions, but the tavern’s role in sociability and local exchange persisted."
    },
    {
        "name": "Coffee House",
        "category": "Happiness",
        "requires": [
            {
                "type": "technology",
                "name": "Mercantilism"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Tavern"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 360
            },
            {
                "name": "Happiness",
                "value": 6
            }
        ],
        "description": "The coffee house arose in the Ottoman world in the 16th century as a public venue for coffee, conversation, and games. Qahveh-khaneh spread through Istanbul, Cairo, and the Levant, drawing artisans, scholars, and merchants. The form reached Europe in the mid-17th century. London coffeehouses became “penny universities,” where news, pamphlets, and trade circulated; Lloyd’s originated there as an insurance market. Parisian cafés nurtured literary circles and political debate before and during the Revolution. The Viennese Kaffeehaus established a long-lived urban culture of reading and correspondence. From Tehran to Tunis and from Buenos Aires to Calcutta, cafés supported commerce, journalism, and civic life. In the 20th century, espresso bars and global chains updated the model with standardized roasting, take-away service, and wireless workspaces."
    },
    {
        "name": "Department Store",
        "category": "Happiness",
        "requires": [
            {
                "type": "technology",
                "name": "Economics"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Coffee House"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 640
            },
            {
                "name": "Happiness",
                "value": 8
            }
        ],
        "description": "The department store concentrates diverse goods in specialized sections, using fixed prices, display windows, and aggressive advertising. Pioneers included Le Bon Marché and Au Printemps in Paris, Harrods in London, and Macy’s in New York. Escalators, elevators, and iron-framed halls enabled multi-level retail and spectacle shopping. Stores cultivated female clientele with amenities, return policies, and seasonal fashion shows. Catalog sales linked city flagships to rural consumers. The format spread globally: Mitsukoshi and Takashimaya in Japan, GUM in Moscow, El Palacio de Hierro in Mexico City, and David Jones in Australia. These enterprises shaped modern merchandising, window dressing, and holiday campaigns. Late 20th-century competition from malls and e-commerce forced reinvention through branding, experiential floors, and integration with online platforms."
    },
    {
        "name": "Amusement Park",
        "category": "Happiness",
        "requires": [
            {
                "type": "technology",
                "name": "Microchips"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Department Store"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 1000
            },
            {
                "name": "Happiness",
                "value": 10
            }
        ],
        "description": "An amusement park is a dedicated leisure complex that combines mechanical rides, themed attractions, and show venues. Precursors included European pleasure gardens and Coney Island’s early 20th-century parks. Post-1970 development introduced computer-controlled coasters, animatronics, synchronized lighting, and integrated crowd-flow planning. Parks grew into multi-day resorts with hotels and transit links. Franchised destinations expanded worldwide: Disneyland and Walt Disney World with later expansions, Universal Studios in Florida, Japan, and Singapore, Tokyo Disney Resort, Ocean Park in Hong Kong, Everland in South Korea, Europa-Park in Germany, and Ferrari World in Abu Dhabi. Safety codes, maintenance regimes, and digital ticketing became core operations. The industry blends engineering, narrative design, and mass entertainment scaled for regional tourism economies."
    },
    {
        "name": "Town Watch",
        "category": "Order",
        "requires": [
            {
                "type": "technology",
                "name": "Warfare"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 30
            },
            {
                "name": "Order",
                "value": 2
            }
        ],
        "description": "The town watch is a civic patrol created to guard gates, deter theft, and enforce curfews, especially at night. Early forms appeared in Mesopotamian and Egyptian cities with gatekeepers and street sentries. Greek poleis and Roman communities fielded night watches; the Roman vigiles combined fire-fighting with patrol. Medieval and early modern towns in Europe required citizens to stand watch, later hiring constables. Similar institutions existed elsewhere: Tang and Song Chinese city watches, Edo-period patrols under machi-bugyō with night rounds and fire watch, and Spanish and Latin American serenos who carried lamps and whistles. Colonial settlements adapted watches to port and market control. In the 18th and 19th centuries, many watches professionalized or merged into centralized police, as in London after 1829."
    },
    {
        "name": "Courthouse",
        "category": "Order",
        "requires": [
            {
                "type": "technology",
                "name": "Code of Law"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Town Watch"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 90
            },
            {
                "name": "Order",
                "value": 3
            }
        ],
        "description": "A courthouse is a building for hearing cases, recording judgments, and housing judicial offices. In antiquity, Greek dikasteria and Roman basilicas accommodated trials and civic arbitration. Provincial forums across the Roman world provided covered halls for legal business. Early Islamic cities hosted qadi courts, often adjoining mosques. In South Asia, darbar halls and later colonial high courts formalized proceedings. Purpose-built courthouses became civic landmarks in the early modern era, such as London’s Old Bailey. Nineteenth- and twentieth-century examples include American county courthouses in neoclassical or Romanesque styles, GUM’s counterpart judicial complexes in Russia, and national supreme court buildings from New Delhi to Ottawa. Modern courthouses integrate jury rooms, evidence storage, and secure circulation, reflecting procedural law, public access, and security demands."
    },
    {
        "name": "Town Hall",
        "category": "Order",
        "requires": [
            {
                "type": "technology",
                "name": "Township"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Courthouse"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 160
            },
            {
                "name": "Order",
                "value": 4
            }
        ],
        "description": "A town hall is the civic seat of municipal government, used for council meetings, records, and local administration. Medieval examples emerged with self-governing communes in Italy and the German lands, where the Rathaus became a signature form. Belfry-topped halls in Flanders combined civic pride with watch and alarm functions. English guildhalls served similar roles for market regulation and burgh governance. Iberian ayuntamientos anchored plazas in Castile and later Spanish America, including the Cabildo of Buenos Aires. Architecture often featured a great chamber, archive rooms, clocks, and public facades for proclamations. Renaissance and Baroque rebuilds brought larger halls and ceremonial staircases. The form persisted into modern municipal buildings worldwide, housing councils, registrars, and public hearing rooms, while remaining the symbolic center of local civic life."
    },
    {
        "name": "Magistrate",
        "category": "Order",
        "requires": [
            {
                "type": "technology",
                "name": "Bureaucracy"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Town Hall"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 360
            },
            {
                "name": "Order",
                "value": 6
            }
        ],
        "description": "A magistrate is a local judicial and administrative officer who handles minor criminal cases, licensing, and bylaw enforcement. The role traces to Roman magistratus and to county-level officials in imperial China who heard petitions in the yamen. Medieval Europe vested summary justice in borough courts and manorial officials. Early modern justices of the peace in England combined policing, poor relief oversight, and market regulation. Under European empires, colonial magistrates enforced ordinances and codified law across Africa, South Asia, and the Caribbean. Nineteenth- and twentieth-century magistrates’ courts in the United Kingdom, France, and Japan processed the bulk of routine cases. India’s district and metropolitan magistrates continue this pattern. The office professionalized with legal training, clearer appeal routes, and standardized procedures, yet remained a key interface between state administration and everyday urban life."
    },
    {
        "name": "Police Station",
        "category": "Order",
        "requires": [
            {
                "type": "technology",
                "name": "Universal Suffrage"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Magistrate"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 640
            },
            {
                "name": "Order",
                "value": 8
            }
        ],
        "description": "A police station is the local headquarters for patrol organization, investigations, detention, and public reporting. The modern form developed with nineteenth-century urban reforms such as London’s Metropolitan Police, Paris’s Prefecture de Police, and precinct houses in New York. Stations included parade rooms, charge desks, armories, cells, and later telegraph, telephone, and radio rooms. Architectural styles ranged from fortress-like Victorian blocks to standardized interwar and postwar facilities. In Japan, networks of kōban and chuzaisho supported larger stations through neighborhood presence. In Latin America and South Asia, municipal stations anchored beat patrols and investigative bureaus. Twentieth-century modernization added motor pools, forensic labs, and data units. Contemporary stations integrate community service counters, custody suites meeting legal standards, and digital dispatch linked to citywide command centers."
    },
    {
        "name": "Riot Police",
        "category": "Order",
        "requires": [
            {
                "type": "technology",
                "name": "State Surveillance"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Police Station"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 1000
            },
            {
                "name": "Order",
                "value": 10
            }
        ],
        "description": "Riot police are specialized units trained for public-order operations, using shields, helmets, batons, and chemical agents. Their development accelerated after the mass protests and civil unrest of the 1960s and 1970s. France’s Compagnies Républicaines de Sécurité, Japan’s Kidōtai, and South Korea’s former conscript riot units formed notable models. Brazil’s Polícia de Choque and India’s Rapid Action Force address stadium violence, strikes, and communal tensions. Tactics include cordons, dispersal lines, targeted arrests, and less-lethal munitions under rules of engagement. Equipment has evolved to include body armor, visors, and communications headsets. Training balances crowd psychology, negotiation, and graded force to reduce casualties and property damage."
    },
    {
        "name": "Governor",
        "category": "Influence",
        "requires": [
            {
                "type": "technology",
                "name": "Tradition"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 30
            },
            {
                "name": "Influence",
                "value": 2
            }
        ],
        "description": "A governor is a territorial ruler or official appointed or elected to exercise executive authority on behalf of a central power. Early precedents include Sumerian and Akkadian city officials under kings, Achaemenid satraps supervising provinces, and Han Chinese commandery governors overseeing taxation and justice. The Roman Empire relied on proconsuls and propraetors to govern provinces and command troops. In the early modern era, Spanish viceroys, Portuguese captains-general, and Ottoman beylerbeyi managed far-flung domains. Colonial governance in British India and Africa used governors to implement policy, collect revenue, and maintain order. In federal states such as the United States, India, Nigeria, and Brazil, elected governors coordinate state administration, disaster response, and legislation. Across periods, the office balanced local conditions, fiscal demands, and directives from the center."
    },
    {
        "name": "Mansion",
        "category": "Influence",
        "requires": [
            {
                "type": "technology",
                "name": "Government"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Governor"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 90
            },
            {
                "name": "Influence",
                "value": 3
            }
        ],
        "description": "A mansion is a large private residence built to project elite wealth and control household life. Early forms include Roman domus and villae with atria and gardens. In China, grand siheyuan compounds organized courtyards, reception halls, and service quarters. Indian havelis in Rajasthan and Gujarat displayed carved facades and inward-facing family spaces. European palazzi and country houses consolidated landowner authority and patronage. Ottoman yalı lined the Bosporus with timber waterfront residences. Colonial plantations in the Caribbean and the American South paired mansions with estate economies. The nineteenth-century Gilded Age added urban mansions in New York and Newport. Common features included ceremonial halls, libraries, service basements, and landscaped approaches. Many later became museums, embassies, or institutional headquarters."
    },
    {
        "name": "Royal Court",
        "category": "Influence",
        "requires": [
            {
                "type": "technology",
                "name": "Divine Right"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Mansion"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 160
            },
            {
                "name": "Influence",
                "value": 4
            }
        ],
        "description": "A royal court is the political and cultural center surrounding a monarch, composed of household officers, counselors, diplomats, and artists. Medieval European courts, often itinerant, coordinated justice, taxation, and feudal obligations through chambers, chapels, and chanceries. The courts of the Capetians, Plantagenets, and Valois set models for hierarchy and ceremony. In the Renaissance, Italian courts in Florence, Ferrara, and Milan fostered patronage that advanced painting, music, and humanist scholarship. The Burgundian and later Habsburg courts refined etiquette that spread across Europe. Beyond Europe, the Ottoman court at Topkapı and the Ming court in Beijing structured governance through ritual, palace bureaucracies, and controlled access to the sovereign. As states bureaucratized, courts retained roles in diplomacy, festival culture, and the distribution of honors."
    },
    {
        "name": "Gentlemen's Club",
        "category": "Influence",
        "requires": [
            {
                "type": "technology",
                "name": "Diplomacy"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Royal Court"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 360
            },
            {
                "name": "Influence",
                "value": 6
            }
        ],
        "description": "A gentlemen’s club is an exclusive social institution where elites dine, read, and network for business and politics. Nineteenth-century London produced influential examples such as the Reform, Athenaeum, and Carlton. Colonial cities developed clubs in Calcutta, Melbourne, and Cape Town that cemented imperial social hierarchies. American clubs in New York and Boston linked financiers and lawyers. Facilities included libraries, card rooms, and committee spaces. Membership rules shaped access to power. Many clubs admitted women late in the twentieth century or created companion institutions."
    },
    {
        "name": "Embassy Quarter",
        "category": "Influence",
        "requires": [
            {
                "type": "technology",
                "name": "Universal Suffrage"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Gentlemen's Club"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 640
            },
            {
                "name": "Influence",
                "value": 8
            }
        ],
        "description": "An embassy quarter is an urban district concentrating foreign legations and embassies for security, protocol, and shared services. Nineteenth- and twentieth-century capitals planned such zones to manage extraterritorial rights and diplomatic movement. Washington’s Embassy Row along Massachusetts Avenue, Vienna’s districts near the Ringstraße, and Berlin’s Tiergarten cluster host national missions. Beijing’s historic Legation Quarter at Dongjiaominxiang became a focal point during the Boxer Uprising. Postcolonial planning in New Delhi created Chanakyapuri to house embassies with wide streets and plots. Tokyo’s Akasaka and Roppongi contain many missions in modern towers. Architecture often showcases national styles while meeting host-country codes. These quarters serve consular work, negotiations, cultural outreach, and crisis coordination."
    },
    {
        "name": "Network Monitoring",
        "category": "Influence",
        "requires": [
            {
                "type": "technology",
                "name": "Virtual Reality"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Embassy Quarter"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 1000
            },
            {
                "name": "Influence",
                "value": 10
            }
        ],
        "description": "Network monitoring is the technical and institutional practice of observing communications and data flows for performance, security, and intelligence. It evolved from Cold War signals intelligence and wiretapping to packet capture on ARPANET-era systems. By the late twentieth century, tools such as SNMP, NetFlow, and intrusion detection enabled continuous oversight of traffic. States built programs ranging from the Five Eyes’ global interception to Russia’s SORM and China’s deep packet inspection within the Great Firewall. Corporate security operations centers monitor enterprise networks for malware, data exfiltration, and denial-of-service attacks. The 2013 Snowden disclosures outlined large-scale collection by the NSA and partners. Modern monitoring blends lawful intercept gateways, endpoint telemetry, and anomaly detection with legal oversight and privacy debates."
    },
    {
        "name": "Training Ground",
        "category": "Mil Land",
        "requires": [
            {
                "type": "technology",
                "name": "Military Training"
            },
            {
                "type": "domain",
                "name": "Land"
            },
            {
                "type": "elevation",
                "name": "Flat"
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 90
            },
            {
                "name": "Production",
                "value": 6,
                "for": [
                    {
                        "type": "platform",
                        "name": "Human"
                    }
                ]
            }
        ],
        "description": "A training ground is a dedicated area for drilling troops, practicing weapons, and organizing units before campaign. Early city-states set aside drill squares near walls or palaces. Mesopotamian militias rehearsed shield and spear tactics. Egyptian facilities along the Nile trained archers and chariot crews with target ranges and obstacle courses. Greek poleis and later Rome used open fields and camps for marching, formation changes, and javelin practice; the Campus Martius is a classic example. In China, Warring States and Han authorities maintained mustering fields with archery butts and horse circuits. Similar grounds existed in Mesoamerica and South Asia for levy musters. Such sites standardized movement, cohesion, and basic logistics, turning irregular levies into effective units for field or garrison duty."
    },
    {
        "name": "Garrison",
        "category": "Mil Land",
        "requires": [
            {
                "type": "technology",
                "name": "Steel"
            },
            {
                "type": "domain",
                "name": "Land"
            },
            {
                "type": "elevation",
                "name": "Flat"
            }
        ],
        "upgradesFrom": [
            "Training Ground"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 160
            },
            {
                "name": "Production",
                "value": 8,
                "for": [
                    {
                        "type": "platform",
                        "name": "Human"
                    }
                ]
            }
        ],
        "description": "A garrison is a permanent detachment assigned to defend settlements, roads, and frontiers. It maintains watch, repairs defenses, and enforces authority. The Roman Empire stationed cohorts in castra along borders, as at Vindolanda on Hadrian’s Wall. Han China filled beacon towers and frontier towns with mixed infantry and cavalry to deter raids. In the Islamic world, ribats and citadels housed soldiers securing trade routes. Medieval polities placed garrisons in castles to control countryside. Renaissance states kept small infantry posts in conquered towns. Early modern powers exported the model overseas in presidios from the Philippines to New Spain. Garrison life shaped local economies through supply contracts and pay, and it stabilized rule by providing rapid response forces and a visible military presence."
    },
    {
        "name": "Barracks",
        "category": "Mil Land",
        "requires": [
            {
                "type": "technology",
                "name": "Firearms"
            },
            {
                "type": "domain",
                "name": "Land"
            },
            {
                "type": "elevation",
                "name": "Flat"
            }
        ],
        "upgradesFrom": [
            "Garrison"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 360
            },
            {
                "name": "Production",
                "value": 12,
                "for": [
                    {
                        "type": "platform",
                        "name": "Human"
                    }
                ]
            }
        ],
        "description": "Barracks are purpose-built housing for soldiers of standing armies. They concentrate troops, streamline training, and reduce reliance on civilian billeting. In 16th–17th century Europe, rulers raised permanent regiments and built casernes near drill grounds and arsenals. The Ottoman Empire maintained large janissary barracks in Istanbul and provincial centers to support its elite infantry. France and Prussia expanded standardized barrack blocks with mess halls, magazines, and infirmaries during the 18th century. Colonial empires constructed barracks across India, North America, and Africa to anchor garrisons. Industrial urban growth led cities to place barracks on dedicated reservations with parade squares and transport links. The form professionalized military life by regulating diet, health, and discipline, while enabling rapid mobilization and centralized command."
    },
    {
        "name": "Recruitment Office",
        "category": "Mil Land",
        "requires": [
            {
                "type": "technology",
                "name": "Antibiotics"
            },
            {
                "type": "domain",
                "name": "Land"
            },
            {
                "type": "elevation",
                "name": "Flat"
            }
        ],
        "upgradesFrom": [
            "Barracks"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 640
            },
            {
                "name": "Production",
                "value": 16,
                "for": [
                    {
                        "type": "platform",
                        "name": "Human"
                    }
                ]
            }
        ],
        "description": "A recruitment office is an administrative site for enlistment, medical screening, paperwork, and initial assignment. During World War I, local centers processed volunteers and conscripts, from London and Paris to Calcutta and Ottawa. World War II draft boards and enlistment stations expanded these functions with aptitude tests and classification systems. Many states created interwar and postwar national bureaus, such as French prefectural conscription offices and Soviet military commissariats, to manage annual cohorts. Japan and Italy used centralized registries to support mobilization. Offices also directed propaganda campaigns, maintained deferred occupation lists, and handled veteran records. Standardized intake procedures improved force planning, reduced fraud, and linked civilian populations with the modern state’s military apparatus during mass warfare."
    },
    {
        "name": "Military Base",
        "category": "Mil Land",
        "requires": [
            {
                "type": "technology",
                "name": "Rifle Scopes"
            },
            {
                "type": "domain",
                "name": "Land"
            },
            {
                "type": "elevation",
                "name": "Flat"
            }
        ],
        "upgradesFrom": [
            "Recruitment Office"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 1000
            },
            {
                "name": "Production",
                "value": 20,
                "for": [
                    {
                        "type": "platform",
                        "name": "Human"
                    }
                ]
            }
        ],
        "description": "A military base is a large, permanent installation that hosts units, depots, housing, and command centers for modern operations. Post-1970 expansion created joint complexes integrating land, air, and logistics functions. Examples include Camp Humphreys in South Korea, Pearl Harbor–Hickam in Hawaii, and Ramstein in Germany. Maritime facilities at Diego Garcia support long-range airlift and naval logistics in the Indian Ocean. Yokosuka anchors Western Pacific fleet activity, while Hainan’s Yulin base anchors China’s South Sea Fleet. Bases provide training ranges, maintenance depots, medical centers, schools, and family services. They project power through prepositioned stocks and rapid deployment infrastructure. Host-nation agreements govern access, status, and environmental controls, shaping regional security and the pace of allied or expeditionary operations."
    },
    {
        "name": "Boatyard",
        "category": "Mil Water",
        "requires": [
            {
                "type": "technology",
                "name": "Ship Engineering"
            },
            {
                "type": "terrain",
                "name": "Coast"
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 90
            },
            {
                "name": "Production",
                "value": 6,
                "for": [
                    {
                        "type": "domain",
                        "name": "Water"
                    }
                ]
            }
        ],
        "description": "A boatyard is a small coastal or riverside workshop for building and repairing boats and modest ships. Work uses timber stocks, slipways, and simple sheds close to water. Ancient Egypt maintained yard areas along the Nile and at sites like Abydos, where planked vessels were assembled and serviced. Bronze Age communities around the Aegean and Levant built light traders and war craft for coastal exchange. Phoenician towns created stone slipways for small craft maintenance. Austronesian boatyards in Island Southeast Asia produced outrigger canoes and larger lashed-lug hulls for inter-island voyaging. Tools included adzes, drills, and caulking materials like bitumen or plant fibers. Boatyards supported fishing fleets, river transport, and early naval patrols that guarded harbors and estuaries."
    },
    {
        "name": "Shipwright",
        "category": "Mil Water",
        "requires": [
            {
                "type": "technology",
                "name": "Compass"
            },
            {
                "type": "terrain",
                "name": "Coast"
            }
        ],
        "upgradesFrom": [
            "Boatyard"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 160
            },
            {
                "name": "Production",
                "value": 8,
                "for": [
                    {
                        "type": "domain",
                        "name": "Water"
                    }
                ]
            }
        ],
        "description": "Shipwright refers to the craft and workshop organization that builds and repairs seagoing vessels. In medieval Europe, shipwrights formed guilds, set apprenticeships, and standardized timber selection and joinery. The Venetian Arsenal coordinated thousands of craftsmen to produce galleys at scale using pre-fabricated parts. Across the Indian Ocean, Yemeni and Gujarati builders refined sewn and pegged hulls for dhow and baghla types. In Song and Yuan China, shipwrights adopted the magnetic compass, developed watertight bulkheads, and advanced sternpost rudders, enabling larger ocean-capable junks. Northern traditions, including Hanseatic and Scandinavian yards, moved from clinker to carvel planking for greater cargo volume. The craft linked design, navigation, and metallurgy, and it underpinned the naval and commercial expansion of late medieval and Renaissance polities."
    },
    {
        "name": "Shipyard",
        "category": "Mil Water",
        "requires": [
            {
                "type": "technology",
                "name": "Cartography"
            },
            {
                "type": "terrain",
                "name": "Coast"
            }
        ],
        "upgradesFrom": [
            "Shipwright"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 360
            },
            {
                "name": "Production",
                "value": 12,
                "for": [
                    {
                        "type": "domain",
                        "name": "Water"
                    }
                ]
            }
        ],
        "description": "A shipyard is a large, permanent facility that builds, outfits, and launches ocean-going vessels. It includes slipways, cranes, mast houses, rigging lofts, and stores for timber, pitch, and later iron and steel. During the Age of Exploration, Lisbon’s Ribeira das Naus and Seville’s yards produced caravels and galleons for Atlantic routes. The Dutch East India Company operated integrated yards at Amsterdam and Zeeland, turning out Indiamen using efficient block-and-tackle handling. English royal dockyards, notably Chatham, standardized hull forms and rigging for fleets. In South Asia, the Wadia yard in Bombay built teak warships and merchantmen for the East India Company. With industrialization, shipyards adopted steam engines, iron framing, and riveting, transforming capacity and enabling global naval competition."
    },
    {
        "name": "Drydock",
        "category": "Mil Water",
        "requires": [
            {
                "type": "technology",
                "name": "Hydrodynamics"
            },
            {
                "type": "terrain",
                "name": "Coast"
            }
        ],
        "upgradesFrom": [
            "Shipyard"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 640
            },
            {
                "name": "Production",
                "value": 16,
                "for": [
                    {
                        "type": "domain",
                        "name": "Water"
                    }
                ]
            }
        ],
        "description": "A drydock is an enclosed basin or graving dock that allows a ship to be held out of water for construction, inspection, or repair. Gates or caissons seal the entrance, after which pumps remove water. The 19th century saw rapid growth of stone and later concrete drydocks to service iron and steel hulls. Portsmouth and Liverpool expanded facilities for armored warships. The Brooklyn Navy Yard added large docks for battleships and liners. Japan’s Kure and Britain’s Rosyth developed modern dock complexes before World War I. Interwar and World War II programs enlarged docks to handle carriers and fast battleships. Drydocks enabled efficient hull maintenance, propeller and shaft work, and underwater repairs vital to industrial navies and commercial fleets."
    },
    {
        "name": "Naval Station",
        "category": "Mil Water",
        "requires": [
            {
                "type": "technology",
                "name": "Global Army"
            },
            {
                "type": "terrain",
                "name": "Coast"
            }
        ],
        "upgradesFrom": [
            "Drydock"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 1000
            },
            {
                "name": "Production",
                "value": 20,
                "for": [
                    {
                        "type": "domain",
                        "name": "Water"
                    }
                ]
            }
        ],
        "description": "A naval station is a strategic coastal complex that sustains fleet operations through basing, logistics, maintenance, and command. Cold War expansion produced global hubs such as Naval Station Norfolk, which coordinates Atlantic deployments. Overseas, Yokosuka in Japan supports the Seventh Fleet, while Diego Garcia provides Indian Ocean anchorage, airlift, and storage. Singapore’s modern bases, including Changi, service multinational task groups in Southeast Asia. Russia’s Severomorsk and Syria’s Tartus serve similar functions for their fleets. Stations host drydocks, fuel farms, ammunition depots, schools, and communications nodes. They manage port security and joint exercises, integrate with air and land facilities, and allow prolonged forward presence. Their infrastructure shapes maritime strategy, deterrence posture, and crisis response timelines."
    },
    {
        "name": "Town Square",
        "category": "Trade",
        "requires": [
            {
                "type": "technology",
                "name": "Trade"
            },
            {
                "type": "domain",
                "name": "Land"
            },
            {
                "type": "elevation",
                "name": "Flat"
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 30
            },
            {
                "name": "Trade Slot",
                "value": 2
            }
        ],
        "description": "A town square is an open paved space at a settlements center used for assembly, exchange, and civic ritual. It concentrates streets, wells or fountains, and access to public buildings. Stone or brick paving resists wear and allows drainage; arcades or loggias shelter stalls and speakers. Greece used the agora for debate and petty trade. Rome developed fora with basilicas and temples. Islamic cities built maydans that hosted markets and ceremonies, as at Naqsh-e Jahan Square in Isfahan. European communes held courts and fairs on market squares ringed by guildhalls. North African examples, such as Marrakechs Jemaa el-Fnaa, mixed vendors, performers, and food. The space anchors wayfinding and supports periodic markets, festivals, proclamations, and militia musters."
    },
    {
        "name": "Market",
        "category": "Trade",
        "requires": [
            {
                "type": "technology",
                "name": "Currency"
            },
            {
                "type": "domain",
                "name": "Land"
            },
            {
                "type": "elevation",
                "name": "Flat"
            }
        ],
        "upgradesFrom": [
            "Town Square"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 90
            },
            {
                "name": "Trade Slot",
                "value": 3
            }
        ],
        "description": "A market is a designated trading precinct with fixed stalls, lanes, and weighing points where authorities regulate measures, tolls, and sanitation. Roofed halls or covered streets protect perishable goods; shutters and lockups secure stock. Istanbuls Grand Bazaar integrates craft hans, money changers, and caravanserai functions. Delhis Chandni Chowk linked imperial storage with retail. The suqs of Aleppo and Fez organized trade by commodity and guild. In Mesoamerica, Tlatelolcos market used stewards and judges to police transactions. Medieval Europe added timber or iron market halls and weekly chartered fairs. Standard weights, inspectors, and guild officers stabilized prices and quality, making the market a predictable node for regional exchange."
    },
    {
        "name": "Trader's Guild",
        "category": "Trade",
        "requires": [
            {
                "type": "technology",
                "name": "Feudalism"
            },
            {
                "type": "domain",
                "name": "Land"
            },
            {
                "type": "elevation",
                "name": "Flat"
            }
        ],
        "upgradesFrom": [
            "Market"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 160
            },
            {
                "name": "Trade Slot",
                "value": 4
            }
        ],
        "description": "A traders guild is a corporate association of merchants that maintains a hall, archives, and meeting rooms for regulation, credit, and dispute resolution. The building stores ledgers, seals, and scales; it hosts audits, oath taking, and price setting. Hanseatic kontors at Bergen and Bruges coordinated privileges and convoy dues. The Artus Court in Gdask and the livery halls of London show ceremonial and administrative rooms beside countinghouses. In China, huiguan (native-place guild halls) in Guangzhou and Shanghai pooled capital and mediated with officials. Facilities often include chapels or shrines, kitchens, and bonded rooms. Guild officers manage apprenticeships, entry fees, and collective insurance against shipwreck, theft, and fire."
    },
    {
        "name": "Warehouse",
        "category": "Trade",
        "requires": [
            {
                "type": "technology",
                "name": "Royal Charter"
            },
            {
                "type": "domain",
                "name": "Land"
            },
            {
                "type": "elevation",
                "name": "Flat"
            }
        ],
        "upgradesFrom": [
            "Trader's Guild"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 360
            },
            {
                "name": "Trade Slot",
                "value": 6
            }
        ],
        "description": "A warehouse is a robust storage building designed for secure, dry, and trackable holding of goods. Thick masonry or timber framing supports multiple floors; hoists, trapdoors, and loading bays move bales and casks. Floor joists and posts are sized for high point loads; raised thresholds and ventilators limit damp and pests. Romes horrea at Ostia held grain, oil, and wine under state seal. The Dutch VOC maintained waterfront warehouses in Amsterdam and Batavia linked to ledger rooms and cranes. Colonial godowns at Calcutta and Singapore tied river wharves to customs. Andean states used qollqa for state grain. Nineteenth-century bonded warehouses added fireproof brick, cast-iron columns, and duty control rooms."
    },
    {
        "name": "Railway Station",
        "category": "Trade",
        "requires": [
            {
                "type": "technology",
                "name": "Railroad"
            },
            {
                "type": "domain",
                "name": "Land"
            },
            {
                "type": "elevation",
                "name": "Flat"
            }
        ],
        "upgradesFrom": [
            "Warehouse"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 640
            },
            {
                "name": "Trade Slot",
                "value": 8
            }
        ],
        "description": "A railway station concentrates platforms, tracks, ticketing, and circulation to board and disperse passengers and cargo. The building integrates concourses, timetables, telegraph or later signaling rooms, and baggage handling. Iron and glass trainsheds span multiple tracks while masonry blocks hold offices and waiting rooms. Britains St Pancras paired a high shed with a hotel front. Mumbais Chhatrapati Shivaji Terminus fused Gothic revival with railway workshops and control spaces. Tokyo Station coordinated suburban and trunk lines with underground passages. Terminals connect to tramways, buses, and warehouses, enabling rapid urban growth and regional trade. Later upgrades added electrification equipment, centralized traffic control, and standardized platform heights."
    },
    {
        "name": "Multimodal Terminal",
        "category": "Trade",
        "requires": [
            {
                "type": "technology",
                "name": "Globalization"
            },
            {
                "type": "domain",
                "name": "Land"
            },
            {
                "type": "elevation",
                "name": "Flat"
            }
        ],
        "upgradesFrom": [
            "Railway Station"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 1000
            },
            {
                "name": "Trade Slot",
                "value": 10
            }
        ],
        "description": "A multimodal terminal integrates rail, road, barge, and sea or air transfer under one operating plan. It features container yards, track ladders, rubber-tyred or rail-mounted gantry cranes, reach stackers, and gate complexes with scanners and weighbridges. Yard management systems allocate slots and schedule trains and drays; customs and inspections occupy secure zones. Rotterdams Maasvlakte and Singapores PSA terminals link deep-water berths to on-dock rail. Chicagos inland hubs, such as Logistics Park, transfer double-stack trains to trucks for continental distribution. Dubais Jebel Ali combines free-zone warehousing with berth access. Standardized ISO containers and electronic data interchange reduce dwell time and damage, raising throughput and network reliability."
    },
    {
        "name": "Wharf",
        "category": "Water",
        "requires": [
            {
                "type": "technology",
                "name": "Sailing"
            },
            {
                "type": "terrain",
                "name": "Coast"
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 30
            },
            {
                "name": "Food",
                "value": 1,
                "for": [
                    {
                        "category": "improvement",
                        "name": "Boats"
                    }
                ]
            }
        ],
        "description": "A wharf is a fixed platform along or projecting from a shore for berthing, loading, and unloading vessels. Early constructions used timber piles, rubble infill, and stone revetments. Phoenician cities such as Tyre and Sidon built complex quay works, as did the Greek port of Piraeus. The Indus site of Lothal had a basin and embankments functioning as a wharf in the third millennium BCE. Roman ports, including Ostia and Caesarea, combined masonry quays with cranes and warehouses. River trade depended on wharves along the Nile and China’s Grand Canal. Medieval towns added fish markets, customs posts, and crane towers beside their quays. Later works incorporated hydraulic concrete and iron ties. The wharf remained a core element of maritime commerce until container terminals reshaped waterfront layouts in the twentieth century."
    },
    {
        "name": "Lighthouse",
        "category": "Water",
        "requires": [
            {
                "type": "technology",
                "name": "Celestial Navigation"
            },
            {
                "type": "terrain",
                "name": "Coast"
            }
        ],
        "upgradesFrom": [
            "Wharf"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 90
            },
            {
                "name": "Food",
                "value": 2,
                "for": [
                    {
                        "category": "improvement",
                        "name": "Boats"
                    }
                ]
            },
            {
                "name": "Production",
                "value": 1,
                "for": [
                    {
                        "category": "improvement",
                        "name": "Boats"
                    }
                ]
            }
        ],
        "description": "A lighthouse is a coastal tower that projects light to guide navigation and warn of hazards. Early aids were beacon fires; the Pharos of Alexandria set a durable model with a tall masonry tower and reflective apparatus. Rome built enduring examples, including the Tower of Hercules at A Coruña and the lighthouse at Dover. Byzantine and Islamic authorities maintained light towers at strategic harbors and straits. From the eighteenth century, improved optics, culminating in the Fresnel lens, increased range and reliability. Organizations such as Trinity House and the U.S. Lighthouse Service standardized designs, fuel systems, and maintenance. Notable modern stations include Cape Hatteras in the United States and Cape Point in South Africa. Automation in the twentieth century reduced staffing while preserving their function as essential aids to navigation."
    },
    {
        "name": "Harbor",
        "category": "Water",
        "requires": [
            {
                "type": "technology",
                "name": "Compass"
            },
            {
                "type": "terrain",
                "name": "Coast"
            }
        ],
        "upgradesFrom": [
            "Lighthouse"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 160
            },
            {
                "name": "Food",
                "value": 2,
                "for": [
                    {
                        "category": "improvement",
                        "name": "Boats"
                    }
                ]
            },
            {
                "name": "Production",
                "value": 2,
                "for": [
                    {
                        "category": "improvement",
                        "name": "Boats"
                    }
                ]
            }
        ],
        "description": "A harbor is a sheltered water area where ships can anchor, load, and obtain services. Natural bays and lagoons were improved with moles, breakwaters, and dredged channels. Medieval and Renaissance hubs such as Venice, Genoa, and Lübeck managed long-distance trade with quays, cranes, and bonded warehouses. The Hanseatic League linked many North Sea and Baltic harbors. In the Indian Ocean, Kilwa Kisiwani and Calicut served dhow and spice routes. China’s Quanzhou operated as a major Song and Yuan maritime harbor with extensive piers and customs. Harbors often hosted naval arsenals, victualling yards, and quarantine stations. As ship size grew, authorities deepened basins and extended mole works. Harbors remained urban gateways for commerce and migration as steam power and rail networks expanded."
    },
    {
        "name": "Port",
        "category": "Water",
        "requires": [
            {
                "type": "technology",
                "name": "Colonialism"
            },
            {
                "type": "terrain",
                "name": "Coast"
            }
        ],
        "upgradesFrom": [
            "Harbor"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 360
            },
            {
                "name": "Production Cost",
                "value": 90
            },
            {
                "name": "Food",
                "value": 3,
                "for": [
                    {
                        "category": "improvement",
                        "name": "Boats"
                    }
                ]
            },
            {
                "name": "Production",
                "value": 3,
                "for": [
                    {
                        "category": "improvement",
                        "name": "Boats"
                    }
                ]
            }
        ],
        "description": "A port is an integrated harbor complex that organizes maritime trade, customs, and logistics at regional or global scale. During the Enlightenment and Industrial eras, ports combined docks, bonded warehouses, railheads, and financial services. London’s West and East India Docks concentrated bulk imports under regulated tariffs. Liverpool, New York, and Hamburg linked steamship lines with inland manufacturing districts. Colonial ports such as Calcutta and Batavia coordinated imperial shipping, migration, and resource exports. Meiji-era Yokohama and Kobe opened Japan to foreign commerce under treaty arrangements. Harbor engineering increased depth and quay length, while lighthouses, pilotage, and telegraphy improved turnaround. The modern port emerged as a state-regulated node connecting ocean routes to national markets and administrative systems."
    },
    {
        "name": "Container Port",
        "category": "Water",
        "requires": [
            {
                "type": "technology",
                "name": "Aluminum Milling"
            },
            {
                "type": "terrain",
                "name": "Coast"
            }
        ],
        "upgradesFrom": [
            "Port"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 640
            },
            {
                "name": "Production Cost",
                "value": 160
            },
            {
                "name": "Food",
                "value": 4,
                "for": [
                    {
                        "category": "improvement",
                        "name": "Boats"
                    }
                ]
            },
            {
                "name": "Production",
                "value": 4,
                "for": [
                    {
                        "category": "improvement",
                        "name": "Boats"
                    }
                ]
            }
        ],
        "description": "A container port is a terminal built for standardized intermodal containers, enabling rapid transfer between ship, rail, and truck. Containerization, developed in the 1950s by operators such as Malcolm McLean, replaced breakbulk cargo with 20- and 40-foot units measured in TEU. Infrastructure includes deep berths, ship-to-shore gantry cranes, yard cranes or straddle carriers, and customs and data systems. Rotterdam, Singapore, and Shanghai’s Yangshan Deep-Water Port rank among the busiest. Los Angeles–Long Beach and Busan anchor trans-Pacific flows. Free trade zones, efficient hinterland rail links, and automated gate processes reduce dwell time. The container port lowered transport costs and enabled global production networks and just-in-time logistics across continents."
    },
    {
        "name": "Automated Port",
        "category": "Water",
        "requires": [
            {
                "type": "technology",
                "name": "Robotics"
            },
            {
                "type": "terrain",
                "name": "Coast"
            }
        ],
        "upgradesFrom": [
            "Container Port"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 1000
            },
            {
                "name": "Food",
                "value": 5,
                "for": [
                    {
                        "category": "improvement",
                        "name": "Boats"
                    }
                ]
            },
            {
                "name": "Production",
                "value": 5,
                "for": [
                    {
                        "category": "improvement",
                        "name": "Boats"
                    }
                ]
            }
        ],
        "description": "An automated port uses robotic handling, autonomous vehicles, and advanced scheduling to move containers with minimal direct labor. Key systems include automated stacking cranes, automated guided vehicles, optical character recognition, and digital twin yard management. Rotterdam’s Maasvlakte II terminals and Singapore’s Tuas Mega Port combine high-density yards with remote crane operations. China’s Qingdao New Qianwan and Shanghai Yangshan Phase 4 operate near fully automated quays. Automation improves safety, throughput, and emissions by enabling electrified equipment and continuous operations. It requires resilient power, data networks, and cybersecurity. Many ports adopt hybrid layouts that mix manual and automated blocks to balance capital costs with operational flexibility during transition."
    },
    {
        "name": "Palisades",
        "category": "Defense",
        "requires": [
            {
                "type": "technology",
                "name": "Wood Working"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 15
            },
            {
                "name": "Defense",
                "value": 5
            }
        ],
        "description": "Palisades are defensive barriers formed by closely set wooden posts, often paired with ditches and earthen banks. They appear in Bronze Age hilltop sites in Europe and around fortified settlements in the Aegean and Anatolia. Roman marching camps used temporary palisades for perimeter defense. In East Asia, Yayoi and Kofun communities enclosed moated villages with timber walls. Mississippian towns in North America, including Cahokia, relied on rebuilt palisade circuits with bastions. African and Pacific island communities also built timber stockades against raiding. Construction was rapid and relied on local timber, but the works were vulnerable to fire and decay. Gatehouses and watch platforms improved observation and control. Palisades persisted where stone or brick was scarce."
    },
    {
        "name": "Stone Walls",
        "category": "Defense",
        "requires": [
            {
                "type": "technology",
                "name": "Bronze Casting"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Palisades"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 45
            },
            {
                "name": "Defense",
                "value": 7
            }
        ],
        "description": "Stone defensive walls provided durable perimeter protection for cities, citadels, and frontiers. Techniques ranged from cyclopean masonry at Mycenae and Tiryns to mortared curtains with towers and crenellations in classical and medieval periods. Hadrian’s Wall combined stone sections with milecastles to regulate movement in Roman Britain. The Inca constructed finely jointed walls at Sacsayhuamán with notable seismic resistance. In China, city walls such as Xi’an evolved from rammed earth to brick and stone facings. Stone resisted fire and offered stable firing platforms, while attackers countered with mining and trebuchets. The rise of gunpowder artillery forced lower, thicker profiles and led to angled outworks that anticipated the star fort."
    },
    {
        "name": "Castle",
        "category": "Defense",
        "requires": [
            {
                "type": "technology",
                "name": "Castles"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Stone Walls"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 80
            },
            {
                "name": "Defense",
                "value": 12
            }
        ],
        "description": "A castle is a fortified residence that controlled land routes and housed a lord, garrison, and administrative staff. Early medieval Europe favored timber motte-and-bailey works, later replaced by stone keeps and curtain walls. Concentric designs, perfected in the Crusader states and in Edward I’s Welsh castles, layered defenses with towers and gatehouses. In Japan, Momoyama-period castles such as Himeji combined stone bases, complex baileys, and fire-resistant keeps. In South Asia, forts like Golconda and Mehrangarh served similar roles with regional forms. Castles collected rents, enforced law, and sheltered populations during war. Gunpowder pressed many into obsolescence or into adaptation as artillery platforms, then as palatial seats."
    },
    {
        "name": "Star Fort",
        "category": "Defense",
        "requires": [
            {
                "type": "technology",
                "name": "Steel Casting"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Castle"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 180
            },
            {
                "name": "Defense",
                "value": 17
            }
        ],
        "description": "A star fort, or trace italienne, is an early modern fortress designed to resist cannon fire and deliver interlocking fields of fire. Low, thick ramparts of earth and brick absorbed shot. Angled bastions, ravelins, and covered ways reduced blind spots and protected gates. Italian prototypes spread in the sixteenth century. Vauban standardized the form in France, as at Neuf-Brisach. Notable examples include Palmanova in Italy, Naarden in the Netherlands, Galle Fort in Sri Lanka, Fort Jesus at Mombasa, and Castillo San Felipe del Morro in Puerto Rico. The system required large works and skilled engineers. Rifled artillery and high explosives in the nineteenth century reduced its effectiveness, though many sites remained in service."
    },
    {
        "name": "Civil Defense",
        "category": "Defense",
        "requires": [
            {
                "type": "technology",
                "name": "Civil Defense"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Star Fort"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 320
            },
            {
                "name": "Defense",
                "value": 23
            }
        ],
        "description": "Civil defense is the organized protection of civilians from wartime hazards and mass-casualty threats. It expanded during World War I air raids and matured in World War II. Governments created wardens, siren networks, blackout rules, evacuation plans, and public training. Shelters ranged from improvised basements to reinforced tunnels and purpose-built bunkers. Britain’s ARP and the US Office of Civilian Defense coordinated gas-mask distribution, firefighting, and rescue. The Soviet Union and Japan mobilized large volunteer formations for urban damage control. The Cold War shifted doctrine to nuclear survival, promoting fallout shelters, radiological monitoring, and continuity planning. Switzerland built near-universal shelter coverage, and Israel developed hardened civil systems after 1948. Many programs later merged into all-hazards emergency management."
    },
    {
        "name": "Siege Workshop",
        "category": "Unit Production",
        "requires": [
            {
                "type": "technology",
                "name": "Mathematics"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 90
            },
            {
                "name": "Production",
                "value": 25,
                "type": "percent",
                "for": [
                    {
                        "category": "equipment",
                        "name": "Siege"
                    }
                ]
            }
        ],
        "description": "A siege workshop was a field or permanent facility where armies designed and assembled engines to breach fortifications. Staff included engineers, carpenters, smiths, rope makers, and sappers. Materials—timber, bronze fittings, iron nails, rawhide, sinew, and cordage—were stockpiled and worked into ladders, battering rams, siege towers, and torsion artillery such as catapults and ballistae. Assyrian armies used mobile workshops to support campaigns against walled cities. Macedonian forces under Philip II and Alexander employed organized siege trains; the siege of Tyre (332 BCE) showcased large-scale construction and naval delivery. Roman fabricae in legionary camps produced and repaired artillery frames. In East Asia, Warring States and Han armies maintained workshops for rams and traction trebuchets, drawing on detailed technical traditions described by Mozi and later military texts."
    },
    {
        "name": "Artillery Factory",
        "category": "Unit Production",
        "requires": [
            {
                "type": "technology",
                "name": "Artillery"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Siege Workshop"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 640
            },
            {
                "name": "Production",
                "value": 25,
                "type": "percent",
                "for": [
                    {
                        "category": "equipment",
                        "name": "Artillery"
                    }
                ]
            }
        ],
        "description": "An artillery factory manufactures gun tubes, carriages, recoil mechanisms, and fire-control fittings for heavy weapons. The industrial era standardized metallurgy and machining, enabling rifled steel barrels and reliable breech systems. Firms such as Krupp (Essen), Schneider-Creusot (France), Vickers (Britain), and Obukhov (Russia) supplied armies worldwide. The United States expanded production through arsenals like Watervliet; Japan built capacity at Osaka and Kokura. During World War I, mass production of field guns and howitzers depended on forged steel, precision boring, and strict gauging. Interwar plants integrated autofrettage and improved recoil designs; World War II added rapid assembly lines and subcontracting networks. Proving grounds linked to factories conducted proof firing and inspection, while separate munitions plants loaded shells and propellants for delivery to the front."
    },
    {
        "name": "Archery Range",
        "category": "Unit Production",
        "requires": [
            {
                "type": "technology",
                "name": "Archery"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 90
            },
            {
                "name": "Production",
                "value": 25,
                "type": "percent",
                "for": [
                    {
                        "category": "equipment",
                        "name": "Ranged"
                    }
                ]
            }
        ],
        "description": "An archery range is a dedicated area for training with bows, arrows, and related equipment. In the Iron Age and classical world, such ranges stood near garrisons, palaces, or open fields where standardized distances and target forms could be maintained. Achaemenid and later Persian forces trained infantry and cavalry archers on level grounds outside major cities. Greek and Anatolian communities kept practice spaces for toxotai. In China, archery grounds were integral to ritual and military education from the Zhou through the Han; archery contests and examinations took place at state schools. On the steppe, Scythian and Sarmatian riders practiced from horseback around seasonal camps. Ranges supported maintenance of technique, bow tuning, and unit drills, sustaining missile capability across varied armies."
    },
    {
        "name": "Firing Range",
        "category": "Unit Production",
        "requires": [
            {
                "type": "technology",
                "name": "Firearms"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Archery Range"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 360
            },
            {
                "name": "Production",
                "value": 25,
                "type": "percent",
                "for": [
                    {
                        "category": "equipment",
                        "name": "Mortar"
                    },
                    {
                        "category": "equipment",
                        "name": "Spec Ops"
                    }
                ]
            }
        ],
        "description": "A firing range is a controlled site for training with firearms and for weapon development. Facilities include firing lines, earthen butts or concrete backstops, target mechanisms, and safety arcs. The late 19th and 20th centuries saw specialized ranges for infantry marksmanship, machine-gun tactics, and ballistics testing. The British Hythe School of Musketry and Bisley Camp standardized doctrine and competition. The United States used Camp Perry for matches and Aberdeen Proving Ground for instrumented trials. Germany’s Kummersdorf and Russia’s Rzhevka supported artillery and small-arms testing. Many countries built indoor ranges for urban forces and weather-independent training. Range operations introduced hearing and eye protection, standardized scoring, and record-keeping, forming the basis of modern small-arms proficiency and acceptance testing."
    },
    {
        "name": "Stables",
        "category": "Unit Production",
        "requires": [
            {
                "type": "technology",
                "name": "Riding"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 90
            },
            {
                "name": "Production",
                "value": 25,
                "type": "percent",
                "for": [
                    {
                        "category": "platform",
                        "name": "Mounted"
                    }
                ]
            }
        ],
        "description": "Stables are buildings for housing, feeding, and breeding horses used in transport and war. In the ancient and classical periods, stables stood near palaces, garrisons, and way stations, with stalls, mangers, drainage, and tack rooms. Imperial systems organized large studs and remount depots to sustain cavalry and chariot forces. Achaemenid Persia maintained royal herds, including Nisaean horses. Egypt’s New Kingdom kept chariot stables at Pi-Ramesses. Rome built barrack stables in frontier forts such as Vindolanda and the Saalburg. In China, state studs and the postal relay network maintained remounts across Han frontiers. Stable operations involved grooms, veterinarians, farriers, and fodder supply, ensuring reliable mobility for scouts, messengers, and shock troops across diverse terrains and climates."
    },
    {
        "name": "Car Factory",
        "category": "Unit Production",
        "requires": [
            {
                "type": "technology",
                "name": "Combustion"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Stables"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 640
            },
            {
                "name": "Production",
                "value": 25,
                "type": "percent",
                "for": [
                    {
                        "type": "platform",
                        "name": "Truck"
                    },
                    {
                        "type": "platform",
                        "name": "Tracked"
                    }
                ]
            }
        ],
        "description": "A car factory assembles automobiles from stamped bodies, engines, transmissions, and standardized parts. Around 1908–1913, Ford’s Highland Park pioneered the moving assembly line and interchangeable components, enabling mass production of the Model T. European plants followed with flow production at Renault Billancourt and Fiat Lingotto, which integrated testing on a rooftop track. In Germany, Volkswagen’s Wolfsburg complex scaled output before and after 1945. The Soviet Union built GAZ at Nizhny Novgorod with foreign assistance. Postwar Japan refined lean production and just-in-time logistics at Toyota City, reshaping global supply chains. Car factories coordinate pressing, welding, paint, final assembly, and end-of-line inspection, supported by toolmaking and supplier networks. The model defined 20th-century manufacturing and worldwide motorization."
    },
    {
        "name": "Bronze Smith",
        "category": "Resource Production",
        "requires": [
            {
                "type": "technology",
                "name": "Bronze Working"
            },
            {
                "type": "resource",
                "name": "Copper"
            },
            {
                "type": "resource",
                "name": "Tin"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 90
            }
        ],
        "gains": [
            {
                "type": "resource",
                "name": "Bronze",
                "value": 4
            }
        ],
        "description": "A bronze smithy is a workshop where copper and tin are alloyed and cast into tools, weapons, and ornaments. Furnaces, crucibles, stone or clay molds, and anvils equip the shop. Craftspeople smelted ore, mixed alloy in controlled ratios, cast by two-part molds or lost-wax, then finished by grinding, cold hammering, and annealing. Bronze’s hardness and corrosion resistance supported axes, chisels, spearheads, mirrors, and ritual vessels. Early centers included Mesopotamian and Egyptian workshops, Minoan and Mycenaean Aegean sites, and Indus settlements. In China, Shang and Zhou foundries at Anyang produced complex ritual bronzes with sectional molds. Southeast Asia’s Dong Son culture cast large drums. Bronze smiths formed core urban crafts, supplying households, temples, and armies until ironworking spread."
    },
    {
        "name": "Steel Mill",
        "category": "Resource Production",
        "requires": [
            {
                "type": "technology",
                "name": "Steel Milling"
            },
            {
                "type": "resource",
                "name": "Coal"
            },
            {
                "type": "resource",
                "name": "Iron"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Bronze Smith"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 640
            }
        ],
        "gains": [
            {
                "type": "resource",
                "name": "Steel",
                "value": 4
            }
        ],
        "description": "A steel mill produces steel from pig iron or scrap using converters and furnaces, then rolls it into finished shapes. From the 1870s, Bessemer converters and open-hearth furnaces enabled cheap mass steel, displacing wrought iron. Plants integrated coke ovens, blast furnaces, and rolling mills. Notable complexes included Pittsburgh and Chicago works in the United States, the Ruhr in Germany, and Middlesbrough in Britain. Russia built Magnitogorsk; India developed Jamshedpur under Tata; Japan’s Yawata and later integrated works modernized rapidly. After 1950, basic oxygen furnaces and continuous casting raised output and quality. Steel mills supplied rails, ship plate, beams, wire, and machinery steel, underpinning railways, bridges, skyscrapers, and armaments through the mid-20th century."
    },
    {
        "name": "Synthetic Oil Plant",
        "category": "Resource Production",
        "requires": [
            {
                "type": "technology",
                "name": "Oil Refining"
            },
            {
                "type": "resource",
                "name": "Coal"
            },
            {
                "type": "resource",
                "name": "Electricity"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 640
            }
        ],
        "gains": [
            {
                "type": "resource",
                "name": "Oil",
                "value": 4
            }
        ],
        "description": "A synthetic oil plant converts coal, natural gas, or oil shale into liquid fuels. Two main routes dominated: coal hydrogenation (Bergius) and Fischer–Tropsch synthesis, along with shale oil retorting. Germany built large complexes at Leuna, Pölitz, and the Ruhr in the 1930s–1940s to reduce dependence on crude imports; these targets drew heavy Allied bombing. Japan processed shale and coal in Manchuria and at Fushun. Postwar, South Africa’s Sasol expanded coal-to-liquids to address embargoes and supply security. Plants integrate gasification, synthesis reactors, hydrocracking, and refining units to produce gasoline, diesel, and lubricants. Programs advanced catalysts and high-pressure engineering, trading higher capital and energy costs for assured fuel supply during wartime and embargo periods."
    },
    {
        "name": "Electronics Factory",
        "category": "Resource Production",
        "requires": [
            {
                "type": "technology",
                "name": "Transistors"
            },
            {
                "type": "resource",
                "name": "Copper"
            },
            {
                "type": "resource",
                "name": "Rare Earth Metals"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 1000
            }
        ],
        "gains": [
            {
                "type": "resource",
                "name": "Electronics",
                "value": 4
            }
        ],
        "description": "An electronics factory is an industrial facility dedicated to producing electronic components and finished devices for civilian, scientific, and military markets. Early plants made vacuum tubes, radios, and telegraph equipment in the late nineteenth and early twentieth centuries. After 1945, mass production of televisions and transistor radios scaled the sector. Cleanrooms and photolithography entered in the 1960s for integrated circuits, followed by surface-mount assembly and automated test in the 1980s. Regional clusters grew around research hubs and export zones: RCA tube works in Camden, New Jersey; Philips in Eindhoven; Zelenograd microelectronics plants in the USSR; Sony and Toshiba lines in Japan; Texas Instruments and Intel fabs in the United States. By the late twentieth century, Penang’s Free Industrial Zone, Hsinchu Science Park, and Shenzhen’s manufacturing belt anchored global supply chains."
    },
    {
        "name": "Coal Power Plant",
        "category": "Power Plant",
        "requires": [
            {
                "type": "technology",
                "name": "Electricity"
            },
            {
                "type": "resource",
                "name": "Coal"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 640
            },
            {
                "name": "Health",
                "value": -2
            }
        ],
        "gains": [
            {
                "type": "resource",
                "name": "Electricity",
                "value": 2
            }
        ],
        "description": "Coal-fired power plants convert the chemical energy of coal into electricity through boilers, steam turbines, and generators coupled to grid substations. The Pearl Street Station in New York (1882) initiated commercial coal generation, and large steam turbines made central stations dominant by the early twentieth century. Pulverized-coal firing and high-pressure boilers improved efficiency in the 1920s–1950s; supercritical units followed. From the 1930s to the 1970s, coal stations became the baseload backbone of many national grids. Emission controls such as electrostatic precipitators and flue-gas desulfurization spread after the 1970s. Notable plants include Battersea Power Station in London, Drax in Yorkshire, Reftinskaya GRES in Russia, the Navajo Generating Station in Arizona, NTPC’s Singrauli Super Thermal Power Station in India, and Liddell Power Station in New South Wales."
    },
    {
        "name": "Oil Power Plant",
        "category": "Power Plant",
        "requires": [
            {
                "type": "technology",
                "name": "Oil Refining"
            },
            {
                "type": "resource",
                "name": "Oil"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 640
            },
            {
                "name": "Health",
                "value": -1
            }
        ],
        "gains": [
            {
                "type": "resource",
                "name": "Electricity",
                "value": 2
            }
        ],
        "description": "Oil-fired power plants burn petroleum fuels in boilers, gas turbines, or large diesel engines to drive generators. They expanded rapidly from the 1940s to the 1970s where oil supply was secure or coal was scarce, and they often served urban peaking demand or island baseload. The 1973–1979 oil shocks led many stations to convert fuels or operate less frequently, but oil units remained important for fast-start capacity. Notable examples include Yokosuka Thermal Power Station in Japan, Kahe Power Plant on Oahu, Poolbeg Generating Station in Dublin, and the San Juan power complex in Puerto Rico. Many African and Caribbean grids relied on heavy-fuel-oil plants built with development finance during the late twentieth century, providing essential electrification despite high operating costs."
    },
    {
        "name": "Hydro Power Plant",
        "category": "Power Plant",
        "requires": [
            {
                "type": "technology",
                "name": "Hydrodynamics"
            },
            {
                "type": "concept",
                "name": "River"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "elevation",
                        "name": "Hill"
                    },
                    {
                        "type": "elevation",
                        "name": "Mountain"
                    }
                ]
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 1000
            }
        ],
        "gains": [
            {
                "type": "resource",
                "name": "Electricity",
                "value": 5
            }
        ],
        "description": "Hydroelectric power plants convert the potential energy of stored or flowing water into electricity using turbines and generators. Alternating-current transmission made remote hydropower practical in the 1890s, culminating in the Niagara Falls project (1895). Reservoir dams integrated flood control, irrigation, and navigation with generation. Francis, Kaplan, and Pelton turbines enabled deployment across varied heads and flows. Large schemes shaped national grids and regional economies: Hoover Dam and Grand Coulee in the United States, Aswan High Dam in Egypt, Churchill Falls in Canada, Itaipu on the Brazil–Paraguay border, and Norway’s cascaded stations. Construction often involved major resettlement and environmental changes. By the late twentieth century, pumped-storage hydropower also stabilized systems with variable thermal and renewable generation."
    },
    {
        "name": "Nuclear Power Plant",
        "category": "Power Plant",
        "requires": [
            {
                "type": "technology",
                "name": "Fission"
            },
            {
                "type": "resource",
                "name": "Uranium"
            },
            {
                "type": "domain",
                "name": "Land"
            },
            {
                "type": "elevation",
                "name": "Flat"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Fresh Water"
                    },
                    {
                        "type": "special",
                        "name": "Next to Coast"
                    }
                ]
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 1000
            }
        ],
        "gains": [
            {
                "type": "resource",
                "name": "Electricity",
                "value": 5
            }
        ],
        "description": "Nuclear power plants generate electricity from controlled fission in reactor cores, producing heat to drive steam turbines. Early grid-connected stations included Obninsk in the USSR (1954), Calder Hall in the United Kingdom (1956), and Shippingport in the United States (1957). Commercial designs standardized around pressurized and boiling water reactors, while Canada developed the heavy-water CANDU, the UK operated gas-cooled AGRs, and the USSR built graphite-moderated RBMKs. National programs scaled rapidly in the 1970s–1980s, notably France’s fleet buildout, Japan’s coastal stations, and units in South Korea and India. Safety regimes and containment systems evolved after incidents at Three Mile Island (1979) and Chernobyl (1986). Examples include Tarapur Atomic Power Station in India, Koeberg in South Africa, and Gravelines in France."
    },
    {
        "name": "Solar Power Plant",
        "category": "Power Plant",
        "requires": [
            {
                "type": "technology",
                "name": "Renewable Energy"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "concept",
                        "name": "Flat Land"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Coal Power Plant",
            "Oil Power Plant"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 1000
            }
        ],
        "gains": [
            {
                "type": "resource",
                "name": "Electricity",
                "value": 1
            }
        ],
        "description": "Solar power plants capture sunlight to produce electricity through photovoltaic (PV) modules or concentrating solar power (CSP) systems. Laboratory PV cells emerged in the 1950s and served satellites in the 1960s. Oil-price shocks drove terrestrial demonstrations in the 1970s and 1980s, including the Solar One CSP project at Daggett, California, and early PV arrays on the Carrizo Plain. Utility-scale growth accelerated in the 1990s–2000s with policy support and cheaper modules, notable in Germany and Spain. Spain’s PS10 tower near Seville and California’s SEGS parabolic-trough plants showed grid-scale potential. Remote telecom sites, lighthouses, and rural clinics adopted PV widely in developing regions. By the turn of the century, solar plants complemented conventional generation with modular, low-operating-cost capacity."
    },
    {
        "name": "Wind Power Plant",
        "category": "Power Plant",
        "requires": [
            {
                "type": "technology",
                "name": "Renewable Energy"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "domain",
                        "name": "Land"
                    },
                    {
                        "type": "terrain",
                        "name": "Coast"
                    }
                ]
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "elevation",
                        "name": "Flat"
                    },
                    {
                        "type": "elevation",
                        "name": "Hill"
                    }
                ]
            }
        ],
        "upgradesFrom": [
            "Coal Power Plant",
            "Oil Power Plant"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 1000
            }
        ],
        "gains": [
            {
                "type": "resource",
                "name": "Electricity",
                "value": 1
            }
        ],
        "description": "Wind power plants, or wind farms, deploy multiple turbines to convert wind kinetic energy into grid electricity. Modern three-bladed horizontal-axis turbines matured in Denmark in the 1970s, leading to community-owned arrays in the 1980s. Large installations followed at Altamont Pass, Tehachapi, and Palm Springs in California. Spain, India, and Germany expanded substantially in the 1990s. Offshore wind began with Vindeby in Denmark (1991) and progressed to larger arrays such as Horns Rev in the North Sea. Grid integration, improved aerodynamics, and taller towers increased capacity factors and reduced costs. Notable sites include Muppandal in Tamil Nadu, the Tarifa region in Spain, and Danish coastal clusters. By the early twenty-first century, wind farms formed major shares of generation in several countries."
    }
]
