[
    {
        "name": "Frozen",
        "description": "Frozen refers to perennially ice-covered environments with very long freezing seasons and little or no thaw. During the Pleistocene, continental ice sheets reshaped basins, river courses, and soils, steering human migration between about 2.6 million and 11.7 thousand years ago. In the early twentieth century, expeditions by Scott and Amundsen mapped polar coasts and tested logistics in extreme cold. Indigenous Arctic peoples developed sled transport, sea-ice hunting, and cold-weather clothing through long adaptation. Since the mid-twentieth century, Greenland and Antarctic ice cores have preserved records of greenhouse gases, dust, and volcanic aerosols, building a timeline used to reconstruct Quaternary climate dynamics."
    },
    {
        "name": "Cold",
        "description": "Cold climates feature long winters with persistent snow cover and seasonal freezing of soils and waterways. From the fourteenth to nineteenth centuries, the Little Ice Age lowered temperatures in Europe, shortening growing seasons and contributing to crop failures and social strain. Napoleon’s 1812 campaign into Russia encountered early frosts, supply collapse, and mass attrition. Fur trade enterprises pushed into boreal forests and subarctic rivers between the seventeenth and nineteenth centuries, spurring mapping, trading posts, and indigenous alliances. Cold conditions favored winter transport by sled and frozen river routes while constraining intensive agriculture."
    },
    {
        "name": "Temperate",
        "description": "Temperate zones have moderate temperatures and four seasons that support diverse cereals, livestock, and vines. In antiquity, Mediterranean temperate belts fostered Roman agriculture, viticulture, and grain trade that supplied cities and legions. River valleys in temperate East Asia and Europe supported dense settlement with paddy, wheat, and millet systems and extensive irrigation. Between the seventeenth and nineteenth centuries, the English Agricultural Revolution introduced crop rotations, selective breeding, and enclosure, raising yields and freeing labor for industry. Temperate climates enabled reliable maritime calendars and urban growth, yet also faced periodic frost, flood, and disease risks."
    },
    {
        "name": "Warm",
        "description": "Warm climates offer long growing seasons and seasonal rainfall that shape farming calendars. South Asian monsoon regimes sustained empires such as the Gupta and Mughal through rice, wheat, and pulse cultivation tied to summer rains. From the sixteenth to nineteenth centuries, European empires built plantation systems in warm tropical zones to produce sugar, cotton, and other cash crops, using coerced and enslaved labor. Around the Mediterranean, warm, dry summers supported olives, grapes, and citrus since antiquity, influencing cuisine and trade. Warm conditions encouraged terrace farming, irrigation tanks, and seasonal migration to manage water and heat."
    },
    {
        "name": "Hot",
        "description": "Hot climates maintain high temperatures in arid deserts or humid tropics, imposing heat stress and water constraints. Along the Nile, ancient Egyptian society organized floodplain agriculture with basin irrigation and storage to buffer the desert environment. Across Arabia, caravan routes linked oases and ports, moving incense, textiles, and metals through harsh dune and gravel landscapes. During European colonial expansion from the sixteenth to twentieth centuries, tropical rainforest zones were opened to rubber, timber, and mineral extraction, alongside medical campaigns against malaria and yellow fever. Urban design in hot regions used courtyards, wind catchers, and shaded markets."
    },
    {
        "name": "Equatorial",
        "description": "Equatorial climates are warm and humid year round, with heavy rainfall and minimal temperature seasonality. The Amazon Basin supported diverse indigenous agriculture and later saw rubber booms and scientific expeditions in the nineteenth and twentieth centuries. In central Africa, the Congo Basin experienced colonial extraction of rubber and timber and major biodiversity surveys. The Malay Archipelago became a core of the spice trade, with colonial plantations for cloves, nutmeg, and sugar. On Borneo and Sumatra, logging expanded and later shifted to oil-palm estates. Pacific equatorial islands supported copra and plantation economies and served as strategic bases during the Second World War."
    }
]