[
    {
        "name": "Flat",
        "description": "Flat terrain consists of broad lowlands that facilitate movement, dense settlement, and intensive agriculture. Such landscapes often host early states because irrigation and transport are straightforward, yet they are exposed to floods and incursions. The Nile Delta supported ancient Egypt with predictable silt and canal networks. The Mesopotamian Plain fostered the first urban centers and cuneiform administration along the Tigris and Euphrates. The North China Plain became the dynastic heartland, linked by river works and the Grand Canal. In North America, the Great Plains enabled ranching, wheat agriculture, railroads, and rapid nineteenth century settlement."
    },
    {
        "name": "Hill",
        "description": "Hills offer elevated positions with natural slopes that aid defense and observation. Communities adapted them for terrace farming, storage, and cult sites. In classical Athens the Acropolis combined fortress and sacred precinct. Across Iron Age Britain, hillforts such as Maiden Castle controlled territory and protected granaries. In the Philippine Cordillera, the Banaue Rice Terraces sustained highland populations through engineered irrigation and stonework. Masada in Judea shows the use of isolated heights as last refuges during siege. Hill landscapes often anchor trade routes and administrative centers while moderating climate and disease compared to valley lowlands.",
        "requires": [
            {
                "type": "domain",
                "name": "Land"
            }
        ],
        "yields": [
            {
                "name": "Production",
                "value": 1
            },
            {
                "name": "Move Cost",
                "value": 1
            }
        ]
    },
    {
        "name": "Mountain",
        "description": "Mountains create strong environmental gradients and barriers that shape migration, warfare, and state formation. Alpine and highland passes funnel trade and armies, while upland communities maintain distinct languages and economies. The Andes supported the Inca through a vertical exchange system linking coast, valley, and puna. The Himalayas constrained interaction between South and Central Asia and established enduring pilgrimage corridors. In Europe, the Alps controlled routes like the Great St Bernard, affecting imperial logistics and seasonal transhumance. The Rocky Mountains influenced continental settlement and resource extraction, from fur trade frontiers to twentieth century mineral and water projects.",
        "requires": [
            {
                "type": "domain",
                "name": "Land"
            }
        ],
        "yields": [
            {
                "name": "Production",
                "value": 1
            },
            {
                "name": "Culture",
                "value": 1
            },
            {
                "name": "Move Cost",
                "value": 2
            }
        ],
        "specials": [
            "Cannot Enter"
        ]
    },
    {
        "name": "Snow Mountain",
        "description": "Snow mountains are high, glaciated peaks that store water and generate powerful rivers. They draw pilgrims, scientists, and climbers, yet impose extreme risk. Mont Blanc’s 1786 ascent inaugurated modern alpinism and systematic mountain science. Mount Everest became a global mountaineering focus after the 1953 ascent by Hillary and Norgay. K2, first climbed in 1954, gained a reputation for technical difficulty and fatal storms. Mount Kailash remains a major sacred goal for Hindu, Buddhist, Jain, and Bon traditions. Himalayan glaciers feed the Indus, Ganges, and Brahmaputra, a hydrological legacy central to agriculture and power generation across South Asia.",
        "requires": [
            {
                "type": "domain",
                "name": "Land"
            }
        ],
        "yields": [
            {
                "name": "Production",
                "value": 1
            },
            {
                "name": "Culture",
                "value": 2
            },
            {
                "name": "Move Cost",
                "value": 2
            }
        ],
        "specials": [
            "Cannot Enter"
        ]
    }
]