[
    {
        "name": "Axe",
        "category": "Melee",
        "requires": [
            {
                "type": "technology",
                "name": "Warfare"
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 10
            },
            {
                "name": "Production Cost",
                "value": 15,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 6
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "type": "Platform",
                        "name": "Human"
                    }
                ]
            }
        ],
        "actions": [
            "Attack",
            "Pillage",
            "Start\/End Piracy"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "Warrior"
            },
            {
                "platform": "Chariot",
                "name": "Chariot"
            }
        ],
        "description": "The axe is one of the earliest composite tools and weapons. Neolithic makers shaped and polished stone heads and fixed them to wooden hafts to increase leverage and control. Stone axes cleared forests, built dwellings, and served in hunting and war. By the late fourth to third millennium BCE, metalworking introduced copper and then bronze blades with more durable edges. In ancient Mesopotamia, Sumerian and Akkadian troops carried battle-axes suited to breaking shields. Egyptian infantry used axes alongside spears in the Old and Middle Kingdoms. Forms diversified for carpentry, felling, and combat. The axe persisted as a military sidearm even after swords spread, and remained vital in daily labor long after dedicated war axes declined."
    },
    {
        "name": "Bronze Axe",
        "category": "Melee",
        "requires": [
            {
                "type": "technology",
                "name": "Bronze Smithing"
            },
            {
                "type": "resource",
                "name": "Bronze"
            }
        ],
        "upgradesFrom": [
            "Axe"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 20
            },
            {
                "name": "Production Cost",
                "value": 15,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 8
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "type": "Platform",
                        "name": "Human"
                    }
                ]
            }
        ],
        "actions": [
            "Attack",
            "Pillage",
            "Start\/End Piracy"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "Axeman"
            },
            {
                "platform": "Chariot",
                "name": "War Chariot"
            },
            {
                "platform": "Horse",
                "name": "Rider"
            }
        ],
        "description": "The bronze axe combined cast metal blades with fitted hafts to create a robust offensive and utilitarian tool. Early flanged and palstave forms gripped the handle mechanically, while later socketed designs improved strength and reliability. Tin-alloyed copper gave sharper, tougher edges than stone or pure copper. From the third to second millennium BCE, professional armies adopted bronze axes to defeat leather shields and early armor. Akkadian axemen appear in reliefs as shock troops. Mycenaean grave goods include ornate blades that indicate warfare and status. In Bronze Age China, the Shang state produced large ceremonial and functional axes, supported by advanced foundries. The spread of bronze axes depended on trade in tin, controlling production scale and regional styles."
    },
    {
        "name": "Iron Sword",
        "category": "Melee",
        "requires": [
            {
                "type": "technology",
                "name": "Iron Smithing"
            },
            {
                "type": "resource",
                "name": "Iron"
            }
        ],
        "upgradesFrom": [
            "Bronze Axe"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 45
            },
            {
                "name": "Production Cost",
                "value": 15,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 11
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "type": "Platform",
                        "name": "Human"
                    }
                ]
            }
        ],
        "actions": [
            "Attack",
            "Pillage",
            "Start\/End Piracy"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "Swordsman"
            },
            {
                "platform": "Horse",
                "name": "Horseman"
            }
        ],
        "description": "The iron sword marked a shift from bronze to ferrous metallurgy in edged weapons. Smelting in bloomeries produced workable iron that, once carburized and quenched, yielded blades with superior resilience. By the first millennium BCE, iron swords were common across Europe and Asia. Celtic La Tène smiths forged long, flexible blades suited to slashing and thrusting. Roman soldiers carried the short gladius for close work, then the longer spatha for cavalry and late infantry. In China, Han infantry used straight jian and increasingly adopted single-edged dao as mass weapons. Iron allowed larger-scale production and more standardized armament. Improved toughness, maintainability, and availability made iron swords the primary sidearm for many classical armies."
    },
    {
        "name": "Longsword",
        "category": "Melee",
        "requires": [
            {
                "type": "technology",
                "name": "Steel Smithing"
            },
            {
                "type": "resource",
                "name": "Iron"
            }
        ],
        "upgradesFrom": [
            "Iron Sword"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 80
            },
            {
                "name": "Production Cost",
                "value": 15,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 15
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "type": "Platform",
                        "name": "Human"
                    }
                ]
            }
        ],
        "actions": [
            "Attack",
            "Pillage",
            "Start\/End Piracy"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "Longswordsman"
            },
            {
                "platform": "Horse",
                "name": "Knight"
            }
        ],
        "description": "The European longsword developed in the 14th century for use against armored opponents. It features a straight double-edged blade, a cruciform hilt, and a grip sized for two hands or one hand with a second on the pommel. Length typically ranged from 90 to 120 centimeters. Fencing manuscripts, or Fechtbücher, document sophisticated techniques, including half-swording to aim thrusts at armor gaps and mordhau strikes using the hilt. German and Swiss schools refined the art, and knights employed the weapon in the Hundred Years' War. The longsword served in judicial duels, battlefield melee, and civilian defense. By the 16th century, as firearms spread and armor declined, it gave way to shorter sidearms and pike-and-shot formations."
    },
    {
        "name": "Saber",
        "category": "Melee",
        "requires": [
            {
                "type": "technology",
                "name": "Cold Steel"
            },
            {
                "type": "resource",
                "name": "Iron"
            }
        ],
        "upgradesFrom": [
            "Longsword"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 130
            },
            {
                "name": "Production Cost",
                "value": 15,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 21
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "type": "Platform",
                        "name": "Human"
                    }
                ]
            }
        ],
        "actions": [
            "Attack",
            "Pillage",
            "Start\/End Piracy"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "Man-at-Arms"
            },
            {
                "platform": "Horse",
                "name": "Cuirassier"
            }
        ],
        "description": "The saber is a curved, single-edged sword optimized for mounted combat. Its geometry favors draw cuts delivered at speed, reducing the risk of the blade binding in targets. The weapon entered Central and Western Europe through steppe and Ottoman influence in the early modern period. Polish hussars adopted the szabla as a national cavalry arm, combining cutting power with quick handling. The Ottoman kilij displayed pronounced curvature and a widened tip for strong terminal effect. Hungarian huszár light cavalry spread saber use across European armies. By the 18th and 19th centuries, sabers became standard cavalry sidearms, with patterns tailored for light and heavy units. They persisted in ceremonial roles after firearms eclipsed swords on the battlefield."
    },
    {
        "name": "Musket",
        "category": "Firearm",
        "requires": [
            {
                "type": "technology",
                "name": "Flintlock"
            }
        ],
        "upgradesFrom": [
            "Saber"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 180
            },
            {
                "name": "Strength",
                "value": 28
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "type": "Platform",
                        "name": "Human"
                    }
                ]
            }
        ],
        "specials": [
            "Can levy"
        ],
        "actions": [
            "Attack",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "Musketman"
            },
            {
                "platform": "Horse",
                "name": "Cavalry"
            }
        ],
        "description": "The flintlock musket dominated 17th and 18th century infantry warfare. It was a smoothbore shoulder arm that fired a spherical lead ball using a flint striking steel to ignite priming powder. Standard calibers and paper cartridges enabled rapid loading under drill. The socket bayonet allowed musketeers to replace pikemen, producing flexible line infantry. Fire discipline and volley tactics created shock and attrition at medium ranges. British redcoats carried the Brown Bess, while French line infantry used the Charleville family. In the American Revolutionary War, trained regulars and militia both relied on muskets despite occasional rifle use. The musket’s limitations in accuracy prompted skirmish screens and dense formations, practices later overturned by rifling and new propellants."
    },
    {
        "name": "Rifle",
        "category": "Firearm",
        "requires": [
            {
                "type": "technology",
                "name": "Repeating Rifles"
            }
        ],
        "upgradesFrom": [
            "Musket"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 260
            },
            {
                "name": "Strength",
                "value": 39
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "type": "Platform",
                        "name": "Human"
                    }
                ]
            }
        ],
        "specials": [
            "Can levy"
        ],
        "actions": [
            "Attack",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "Infantry"
            },
            {
                "platform": "Truck",
                "name": "Mot. Infantry"
            }
        ],
        "description": "The rifle gained dominance in the 19th century by adding spiral grooves to impart spin and improve accuracy. Early adoption accelerated with the Minié ball, which allowed faster loading. Breech-loading systems raised the rate of fire and made prone firing practical. The Prussian Dreyse needle gun exemplified this change in the 1840s, reshaping tactics against muzzle-loading opponents. American Civil War forces fielded rifle-muskets and repeaters, expanding effective ranges and lethal zones. With smokeless powder and stronger actions, magazine-fed bolt rifles emerged. The British Lee–Metford and later Lee–Enfield offered quick cycling and high capacity, suiting rapid fire in colonial and European conflicts. Rifles forced dispersed formations, greater use of cover, and modern fire-and-movement doctrine."
    },
    {
        "name": "Assault Rifle",
        "category": "Firearm",
        "requires": [
            {
                "type": "technology",
                "name": "Automatic Carbines"
            }
        ],
        "upgradesFrom": [
            "Rifle"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 360
            },
            {
                "name": "Strength",
                "value": 53
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "type": "Platform",
                        "name": "Human"
                    }
                ]
            }
        ],
        "specials": [
            "Can levy"
        ],
        "actions": [
            "Attack",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "Assault Infantry"
            },
            {
                "platform": "Truck",
                "name": "Mech. Infantry"
            }
        ],
        "description": "The assault rifle is a selective-fire shoulder arm chambered for an intermediate cartridge. It balances controllable automatic fire with useful range for most infantry engagements. The German StG 44 introduced the concept in World War II, shifting emphasis to 300–400 meter combat. After 1945, the AK-47 spread globally through simple construction and reliability. The United States adopted the lightweight, high-velocity M16 during the Vietnam War, pairing small-caliber rounds with high capacity. Typical features include detachable box magazines, gas operation, and accessory mounting. The class enabled squad-level suppressive fire, emphasizing maneuver over massed volleys. By late 20th century, assault rifles replaced full-power battle rifles in most armies, becoming the standard individual weapon system."
    },
    {
        "name": "Scoped Rifle",
        "category": "Firearm",
        "requires": [
            {
                "type": "technology",
                "name": "Rifle Scopes"
            }
        ],
        "upgradesFrom": [
            "Assault Rifle"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 500
            },
            {
                "name": "Strength",
                "value": 73
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "type": "Platform",
                        "name": "Human"
                    }
                ]
            }
        ],
        "specials": [
            "Can levy"
        ],
        "actions": [
            "Attack",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "Modern Infantry"
            },
            {
                "platform": "Truck",
                "name": "IFV"
            }
        ],
        "description": "The scoped rifle combines a modern carbine or rifle with optical sights to enhance precision and target identification. From 2000 onward, general-issue optics became widespread, including fixed-power ACOG sights and low-power variable optics (LPVOs). These systems allow rapid close shots and effective fire at several hundred meters. Conflicts in Iraq and Afghanistan pushed designated marksman doctrine, equipping select infantry with accurized rifles to bridge riflemen and snipers. Rails enabled integration of lasers, night vision devices, and bipods. Calibers range from 5.56 mm carbines to 7.62 mm designated marksman rifles, selected for mission and terrain. The scoped rifle increased first-round hit probability, reduced ammunition expenditure, and improved small-unit overmatch without relying solely on specialist snipers."
    },
    {
        "name": "Laser Rifle",
        "category": "Firearm",
        "requires": [
            {
                "type": "technology",
                "name": "Weaponized Lasers"
            },
            {
                "type": "resource",
                "name": "Electronics"
            }
        ],
        "upgradesFrom": [
            "Scoped Rifle"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 750
            },
            {
                "name": "Strength",
                "value": 100
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "type": "Platform",
                        "name": "Human"
                    }
                ]
            }
        ],
        "specials": [
            "Can levy"
        ],
        "actions": [
            "Attack",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "Laser Infantry"
            },
            {
                "platform": "Truck",
                "name": "Laser IFV"
            }
        ],
        "description": "A laser rifle is a proposed directed-energy weapon that projects coherent light to deliver energy on target. Solid-state and fiber lasers offer efficiency gains, but portable systems face power storage and thermal management limits. Weather, dust, and turbulence attenuate or distort beams, reducing range and effect. Despite these constraints, prototypes demonstrate potential for silent, rapid engagements and deep magazines limited by power supply. Concepts focus on counter-drone use and precise disabling of sensors. Beam control, eye-safety protocols, and ruggedization remain key hurdles. Military research explores integration with soldier power systems and compact cooling. If fielded, laser rifles would alter logistics by reducing ammunition weight, while introducing new training and legal considerations for directed energy use."
    },
    {
        "name": "Spear",
        "category": "Anti-Cavalry",
        "yields": [
            {
                "name": "Production Cost",
                "value": 10
            },
            {
                "name": "Strength",
                "value": 6
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "category": "Platform",
                        "name": "Mounted"
                    }
                ]
            }
        ],
        "specials": [
            "Can levy"
        ],
        "actions": [
            "Attack",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "Warband"
            }
        ],
        "description": "The spear is the earliest purpose-made weapon of human warfare. It began as a fire-hardened wooden thrusting pole used in hunting. Stone or bone tips were later hafted to increase penetration. In the early cities of Mesopotamia and the Nile, levy infantry carried simple spears with hide or wicker shields. Such weapons demanded minimal training and allowed close-order ranks to keep predators and foes at distance. Spearheads were often socketless and bound with sinew or pitch. The weapon worked both for thrusting at short reach and for defensive bracing. Hunter-gatherer groups, Sumerian levies, and Egyptian militias fielded variants suited to local materials. The form endured because it combined low cost, reach, and simple manufacture before widespread metalworking."
    },
    {
        "name": "Bronze Spear",
        "category": "Anti-Cavalry",
        "requires": [
            {
                "type": "technology",
                "name": "Bronze Working"
            }
        ],
        "upgradesFrom": [
            "Spear"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 20
            },
            {
                "name": "Strength",
                "value": 8
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "category": "Platform",
                        "name": "Mounted"
                    }
                ]
            }
        ],
        "specials": [
            "Can levy"
        ],
        "actions": [
            "Attack",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "Spearman"
            }
        ],
        "description": "Bronze metallurgy transformed the spear into a durable battlefield standard. Tin-copper alloy heads, usually socketed, allowed quick replacement and firm hafting. Leaf-shaped blades and reinforced midribs improved thrusting through hide, linen, and early bronze scales. Butt-spikes aided balance and could finish fallen foes. From the Aegean to Anatolia and China, organized infantry carried bronze spears alongside shields. Mycenaean warriors guarded chariots and fought on foot in close formations. Hittite armies paired spear-armed infantry with chariot shock. Shang forces used bronze socketed points in large levies. The bronze spear’s reliability supported tighter drill and larger armies. It remained primary until iron became economical, when the same forms were made in tougher metal at lower cost."
    },
    {
        "name": "Iron Spear",
        "category": "Anti-Cavalry",
        "requires": [
            {
                "type": "technology",
                "name": "Iron Working"
            }
        ],
        "upgradesFrom": [
            "Bronze Spear"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 45
            },
            {
                "name": "Strength",
                "value": 11
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "category": "Platform",
                        "name": "Mounted"
                    }
                ]
            }
        ],
        "specials": [
            "Can levy"
        ],
        "actions": [
            "Attack",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "Phalanx"
            }
        ],
        "description": "Ironworking spread a stronger, cheaper spear across classical Eurasia. Socketed iron heads resisted bending and could be produced at scale by state workshops. Greek hoplites carried the dory with an iron tip and a bronze butt-spike. Achaemenid infantry fielded spearmen in mixed formations with archers and light troops. Mauryan armies equipped large numbers of spearmen for line combat and garrison duties. Iron allowed longer shafts without fragile joints, improving reach and formation integrity. With iron tips, spears defeated leather and linen armor and threatened early mail. Standardized patterns eased logistics and repair. The iron spear remained the universal infantry arm until specialized pikes and widespread swords and missile weapons altered battlefield roles."
    },
    {
        "name": "Pike",
        "category": "Anti-Cavalry",
        "requires": [
            {
                "type": "technology",
                "name": "Steel"
            }
        ],
        "upgradesFrom": [
            "Iron Spear"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 80
            },
            {
                "name": "Strength",
                "value": 15
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "category": "Platform",
                        "name": "Mounted"
                    }
                ]
            }
        ],
        "specials": [
            "Can levy"
        ],
        "actions": [
            "Attack",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "Pikeman"
            }
        ],
        "description": "The pike is an extra-long spear, often 4 to 6 meters, designed to deny cavalry shock. Its use demanded drilled ranks and precise spacing. Flemish militias first showed its potential against knights in the Low Countries. Swiss pike squares perfected aggressive movement and deep hedges of points during the Burgundian Wars. The weapon created a moving fortress against lancers and disordered foot. Commanders combined pikes with halberds and crossbows, later with arquebuses. Terrain, discipline, and flank security determined success. Firearms and the socket bayonet eventually replaced the pike by the late seventeenth century. Until then it defined European infantry tactics and allowed non-noble troops to defeat armored cavalry on open ground."
    },
    {
        "name": "Halberd",
        "category": "Anti-Cavalry",
        "requires": [
            {
                "type": "technology",
                "name": "Military Discipline"
            }
        ],
        "upgradesFrom": [
            "Pike"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 130
            },
            {
                "name": "Strength",
                "value": 21
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "category": "Platform",
                        "name": "Mounted"
                    }
                ]
            }
        ],
        "specials": [
            "Can levy"
        ],
        "actions": [
            "Attack",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "Halberdier"
            }
        ],
        "description": "The halberd is a polearm with an axe blade, a thrusting spike, and a rear hook. It served to cut, pierce, and pull riders from the saddle. Fifteenth-century Swiss and German infantry adopted it as a companion to pikes. Landsknecht formations used halberdiers to guard colors, break into dense ranks, and finish armored foes. The weapon required strength and training yet remained cheaper than swords. Steel heads with langets protected the shaft from parries. The halberd endured in guards and town militias after firearms spread. The Papal Swiss Guard retains it for ceremony and close protection. On battlefields of the Italian Wars it proved versatile in streets, breaches, and melee around pike blocks."
    },
    {
        "name": "Grenadier",
        "category": "Anti-Cavalry",
        "requires": [
            {
                "type": "technology",
                "name": "Military Tradition"
            }
        ],
        "upgradesFrom": [
            "Halberd"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 180
            },
            {
                "name": "Production Cost",
                "value": 15,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 28
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "category": "Platform",
                        "name": "Mounted"
                    }
                ]
            }
        ],
        "actions": [
            "Attack",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "Grenadier"
            }
        ],
        "description": "Grenadiers began as line infantry trained to throw fused hand grenades during assaults. Seventeenth- and eighteenth-century armies selected tall, steady men for the role and grouped them into elite companies. Bearskin caps and distinctive accoutrements signaled status. As hand grenades fell from routine field use, the title persisted for shock troops who led attacks, stormed breaches, and held critical points. French Grenadiers à Pied and Prussian grenadiers gained reputations in the War of the Spanish Succession and the Seven Years’ War. Many regiments retained grenadier companies as honor units into the nineteenth century. The term later migrated to designation of heavy infantry or guards, detaching from its original explosive task."
    },
    {
        "name": "AT-Rifle",
        "category": "Anti-Tank",
        "requires": [
            {
                "type": "technology",
                "name": "Trench Warfare"
            }
        ],
        "upgradesFrom": [
            "Grenadier"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 260
            },
            {
                "name": "Strength",
                "value": 39
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "category": "Platform",
                        "name": "Vehicle"
                    }
                ]
            }
        ],
        "actions": [
            "Attack",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "AT Rifle"
            }
        ],
        "description": "The anti-tank rifle appeared in the final year of the First World War to defeat thin armor. The Mauser T-Gewehr fired a 13.2 mm solid shot at high velocity against plates of early tanks. Interwar designs refined calibers, recoil systems, and ammunition. Crews aimed at vision slits, tracks, or engine compartments. The Polish Wz.35 used a light, high-speed bullet to spall interior armor. By 1941 thicker homogeneous armor and sloped plates reduced effectiveness. AT rifles shifted to roles against armored cars, half-tracks, and embrasures. Many armies retired them in favor of shaped-charge weapons. Their development marked the first specialized infantry response to mechanized armor on the battlefield."
    },
    {
        "name": "RPG",
        "category": "Anti-Tank",
        "requires": [
            {
                "type": "technology",
                "name": "Hollow Charge"
            }
        ],
        "upgradesFrom": [
            "AT-Rifle"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 360
            },
            {
                "name": "Strength",
                "value": 53
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "category": "Platform",
                        "name": "Vehicle"
                    }
                ]
            }
        ],
        "actions": [
            "Attack",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "RPG"
            }
        ],
        "description": "Rocket-propelled grenade launchers give infantry a portable answer to armor and fortifications. Early systems in the Second World War used shaped-charge warheads on rocket or recoilless launchers, such as the U.S. Bazooka and the German Panzerfaust. Postwar designs, notably the RPG-7, combined simple tubes with reusable sights and diverse munitions. Crews engage from concealment and short ranges, exploiting HEAT jets against weak armor. Urban fighting and ambush tactics magnified their impact in conflicts from Vietnam to Afghanistan. Countermeasures such as reactive armor, slat cages, and active protection reduced success rates. Even so, low cost, ease of training, and flexible warhead types keep RPGs in global service."
    },
    {
        "name": "AT-Drone",
        "category": "Anti-Tank",
        "requires": [
            {
                "type": "technology",
                "name": "Military Drones"
            },
            {
                "type": "resource",
                "name": "Electronics"
            }
        ],
        "upgradesFrom": [
            "RPG"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 500
            },
            {
                "name": "Strength",
                "value": 73
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "category": "Platform",
                        "name": "Vehicle"
                    }
                ]
            }
        ],
        "actions": [
            "Attack",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "AT Drone"
            }
        ],
        "description": "Anti-tank drones extend infantry reach with remote or loitering precision strikes. Electro-optical seekers, datalinks, and man-in-the-loop control allow target identification and attack from standoff. Loitering munitions can circle for minutes or hours before diving with shaped-charge or top-attack warheads. Systems such as Spike NLOS and Switchblade demonstrated guided engagements beyond line of sight. In the Nagorno-Karabakh fighting, loitering munitions and small UAS hunted armor in depth. Networked feeds from scouts and artillery radars improved cueing. Vulnerabilities include electronic warfare, limited endurance, and weather. Their rise reshaped anti-armor doctrine by distributing strike capability to small units and emphasizing concealment, mobility, and air defense at the tactical level."
    },
    {
        "name": "AI Drone",
        "category": "Anti-Tank",
        "requires": [
            {
                "type": "technology",
                "name": "Artificial Intelligence"
            },
            {
                "type": "resource",
                "name": "Electronics"
            }
        ],
        "upgradesFrom": [
            "AT-Drone"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 750
            },
            {
                "name": "Strength",
                "value": 100
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "category": "Platform",
                        "name": "Vehicle"
                    }
                ]
            }
        ],
        "actions": [
            "Attack",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "AI Drone"
            }
        ],
        "description": "AI-driven anti-tank drones envision onboard autonomy for sensing, identification, and engagement. Computer vision, fused RF and thermal sensors, and terrain mapping would enable pursuit without continuous human control. Swarming concepts distribute many low-cost aircraft that coordinate routes, deconflict targets, and saturate defenses. Hunter-killer designs pair scouts with shooters for rapid top-attack on moving armor. Autonomy reduces latency and dependence on datalinks under jamming. Countermeasures focus on decoys, camouflage, electronic attack, and hard-kill protection. Legal and command constraints may require human-on-the-loop supervision. If fielded at scale, such systems would alter survivability calculations for armored units and drive new combined-arms air defense and deception measures."
    },
    {
        "name": "AT-Gun",
        "category": "Tank Gun",
        "requires": [
            {
                "type": "technology",
                "name": "Tracked Treads"
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 260
            },
            {
                "name": "Strength",
                "value": 39
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "category": "Platform",
                        "name": "Vehicle"
                    }
                ]
            }
        ],
        "actions": [
            "Attack",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Tracked",
                "name": "Tank"
            }
        ],
        "description": "The AT-gun in early tanks was a compact cannon intended to defeat armor and field works at practical ranges. First fitted during the First World War, these weapons adapted light naval and field pieces to cramped turrets or sponsons. Calibers ranged from 37 mm to 57 mm, with simple optics and limited recoil systems. British Mark IV variants carried 6‑pounders for breaching strongpoints and disabled enemy machines. The Renault FT’s 37 mm SA 18 offered a balance of firepower and weight for 1918 combat. Interwar light tanks such as the Soviet T‑18 and T‑26 mounted small cannon for infantry support and early anti-armor duties. Rapid improvements in armor soon exposed the limits of low-velocity guns, driving the shift to longer barrels and higher pressures."
    },
    {
        "name": "High-Velocity Gun",
        "category": "Tank Gun",
        "requires": [
            {
                "type": "technology",
                "name": "Hollow Charge"
            }
        ],
        "upgradesFrom": [
            "AT-Gun"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 360
            },
            {
                "name": "Strength",
                "value": 53
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "category": "Platform",
                        "name": "Vehicle"
                    }
                ]
            }
        ],
        "actions": [
            "Attack",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Tracked",
                "name": "Main Battle Tank"
            }
        ],
        "description": "High-velocity tank guns emerged as armor protection improved and engagement ranges grew. Designers lengthened barrels, raised chamber pressures, and strengthened mountings to fire kinetic penetrators at very high speed. Ammunition evolved from solid shot to APCBC, APCR, and APDS types, enabling reliable frontal penetrations. Germany’s 8.8 cm KwK 43 defined late‑war performance on the Tiger II. In the Cold War, the British L7 105 mm became a standard NATO solution, combining accuracy, velocity, and manageable recoil. The Soviet 100 mm D‑10T armed T‑54\/55 series across many conflicts. These guns required robust turret rings, advanced recoil mechanisms, and improved fire control. They shaped the main battle tank concept by making long‑range, armor‑killing fire the core mission."
    },
    {
        "name": "Smoothbore Gun",
        "category": "Tank Gun",
        "requires": [
            {
                "type": "technology",
                "name": "Composites"
            }
        ],
        "upgradesFrom": [
            "High-Velocity Gun"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 500
            },
            {
                "name": "Strength",
                "value": 73
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "category": "Platform",
                        "name": "Vehicle"
                    }
                ]
            }
        ],
        "actions": [
            "Attack",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Tracked",
                "name": "Modern Tank"
            }
        ],
        "description": "Modern smoothbore tank guns dispense with rifling to fire fin‑stabilized projectiles and efficient HEAT warheads. The design enables very high muzzle velocities for long‑rod penetrators and avoids spin dispersion of shaped charges. Standard calibers are 120 mm in NATO service and 125 mm in many post‑Soviet designs. Rheinmetall’s 120 mm L44 and L55 equipped Leopard 2 variants and many allied tanks. The M256 120 mm armed the M1A2 Abrams across recent campaigns. Russian 2A46 and 2A82 125 mm systems equipped T‑90 and T‑14 Armata. Smoothbores pair with thermal sleeves, advanced stabilizers, and digital fire control. Typical loads include APFSDS, multi‑purpose HEAT, and programmable airburst rounds, optimizing lethality against armor, structures, and light targets."
    },
    {
        "name": "Laser Gun",
        "category": "Tank Gun",
        "requires": [
            {
                "type": "technology",
                "name": "Weaponized Lasers"
            },
            {
                "type": "resource",
                "name": "Electronics"
            }
        ],
        "upgradesFrom": [
            "Smoothbore Gun"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 750
            },
            {
                "name": "Strength",
                "value": 100
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "category": "Platform",
                        "name": "Vehicle"
                    }
                ]
            }
        ],
        "actions": [
            "Attack",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Tracked",
                "name": "Laser Tank"
            }
        ],
        "description": "A laser gun for armored platforms is a directed‑energy system that deposits concentrated power on targets to disable sensors, drones, and incoming munitions. Development focuses on beam quality, power generation, and thermal management within the limits of mobile chassis. Experiments by industry and armies test high‑energy laser turrets for hard‑kill active protection and short‑range air defense. Potential roles include counter‑UAS, missile defeat, and non‑kinetic disruption of optics. Advantages include deep magazines limited by power supply, precise engagement, and low cost per shot. Constraints include weather attenuation, line‑of‑sight demands, and substantial cooling requirements. Future vehicles may integrate hybrid powertrains and dedicated power modules to support sustained firing. Operational deployment remains limited to prototypes and demonstrators."
    },
    {
        "name": "Wood Ram",
        "category": "Naval Melee",
        "requires": [
            {
                "type": "technology",
                "name": "Sailing"
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 10
            },
            {
                "name": "Strength",
                "value": 6
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "type": "Domain",
                        "name": "Water"
                    }
                ]
            }
        ],
        "specials": [
            "Pillage Range 1"
        ],
        "actions": [
            "Attack",
            "Pillage",
            "Start\/End Piracy"
        ],
        "names": [
            {
                "platform": "Raft",
                "name": "Raft"
            },
            {
                "platform": "Galley",
                "name": "Galley"
            }
        ],
        "description": "The wood ram was an early naval bow structure reinforced to deliver ramming impacts and enable boarding. Built as an extension of the keel and stem, it required robust framing to transmit shock into the hull. Early Mediterranean galleys employed this method in confined waters of the Aegean and Levant. Greek penteconters used bow‑on strikes to disable steering or smash oars before closing with marines. Wooden rams rarely breached hulls deeply but could cripple an opponent at modest speed. Commanders emphasized timing, approach angle, and coordinated rowing to generate useful momentum. As shipbuilding advanced, wood rams gave way to metal‑sheathed and structurally integrated rostra that produced more lethal hull damage and supported specialized maneuver tactics."
    },
    {
        "name": "Bronze Ram",
        "category": "Naval Melee",
        "requires": [
            {
                "type": "technology",
                "name": "Bronze Smithing"
            }
        ],
        "upgradesFrom": [
            "Wood Ram"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 20
            },
            {
                "name": "Strength",
                "value": 8
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "type": "Domain",
                        "name": "Water"
                    }
                ]
            }
        ],
        "specials": [
            "Pillage Range 1"
        ],
        "actions": [
            "Attack",
            "Pillage",
            "Start\/End Piracy"
        ],
        "names": [
            {
                "platform": "Galley",
                "name": "Bireme"
            }
        ],
        "description": "The bronze ram was a cast metal rostrum mounted at a galley’s waterline to pierce planking and open the hull to flooding. It integrated with the keel and stem through heavy timbers and fastenings. Phoenician biremes and Aegean war galleys employed metal‑reinforced rams for decisive strikes in fleet actions. Tactics such as diekplous and periplous sought to outflank enemy lines, shear oars, and attack vulnerable quarters. Archaeology, including the Athlit Ram, shows complex casting, reinforcing fins, and evidence of repair. Bronze construction balanced hardness, corrosion resistance, and manufacturability at ancient foundries. The weapon dominated Mediterranean naval warfare until larger hulls, changing crew compositions, and evolving tactics pushed fleets toward mixed ramming and boarding methods."
    },
    {
        "name": "Iron Ram",
        "category": "Naval Melee",
        "requires": [
            {
                "type": "technology",
                "name": "Iron Smithing"
            }
        ],
        "upgradesFrom": [
            "Bronze Ram"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 45
            },
            {
                "name": "Strength",
                "value": 11
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "type": "Domain",
                        "name": "Water"
                    }
                ]
            }
        ],
        "specials": [
            "Pillage Range 1"
        ],
        "actions": [
            "Attack",
            "Pillage",
            "Start\/End Piracy"
        ],
        "names": [
            {
                "platform": "Galley",
                "name": "Trireme"
            },
            {
                "platform": "Clinker",
                "name": "Galleass"
            }
        ],
        "description": "The iron ram introduced stronger reinforcement to the bow structure of classical galleys, improving the ability to shatter oars and damage hulls. Greek triremes used reinforced stems and multi‑tooth profiles to strike at oblique angles, reducing the risk of becoming stuck. At Salamis in 480 BCE, coordinated ramming and oar‑shearing broke Persian formations in constricted waters. Roman quinqueremes retained ramming as a core method while balancing it with boarding, especially in the early use of the corvus. Iron elements increased durability under repeated impacts and allowed more aggressive maneuvers against dense enemy lines. As hull size and strategic requirements changed, boarding and missile combat rose in prominence, and dedicated ramming gradually declined in later eras."
    },
    {
        "name": "Raiders",
        "category": "Naval Melee",
        "requires": [
            {
                "type": "technology",
                "name": "Steel Smithing"
            }
        ],
        "upgradesFrom": [
            "Iron Ram"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 80
            },
            {
                "name": "Strength",
                "value": 15
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "type": "Domain",
                        "name": "Water"
                    }
                ]
            }
        ],
        "specials": [
            "Pillage Range 1"
        ],
        "actions": [
            "Attack",
            "Pillage",
            "Start\/End Piracy"
        ],
        "names": [
            {
                "platform": "Clinker",
                "name": "Longship"
            },
            {
                "platform": "Carvel",
                "name": "Xebec"
            }
        ],
        "description": "Medieval naval raiders relied on fast oared or lateen‑sailed craft to strike coasts, rivers, and poorly defended ports. Viking longships, with shallow draft and flexible rig, enabled rapid approach, beaching, and swift withdrawal. Crews targeted monasteries, markets, and shipping around the British Isles and Frankish coasts. Varangian expeditions pushed along Eastern European rivers toward Byzantium, supporting trade, warfare, and mercenary service. Success depended on reconnaissance, surprise, and local maritime skill. States responded with watch systems, fortified bridges, and mobile fleets. Over time, improved coastal defenses, centralized authority, and convoy practices limited freebooting. The raiding tradition fed into later corsair and privateer methods that adapted small craft, irregular crews, and opportunistic tactics to new seas."
    },
    {
        "name": "Buccaneers",
        "category": "Naval Melee",
        "requires": [
            {
                "type": "technology",
                "name": "Pistols"
            }
        ],
        "upgradesFrom": [
            "Raiders"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 130
            },
            {
                "name": "Strength",
                "value": 21
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "type": "Domain",
                        "name": "Water"
                    }
                ]
            }
        ],
        "specials": [
            "Pillage Range 1"
        ],
        "actions": [
            "Attack",
            "Pillage",
            "Start\/End Piracy"
        ],
        "names": [
            {
                "platform": "Carvel",
                "name": "Brigantine"
            }
        ],
        "description": "Buccaneers were 17th‑century sea rovers and privateers who preyed on the Spanish Main during the rivalry of European empires. Operating from bases such as Tortuga and Port Royal, they used nimble sloops and small frigates for interceptions and coastal raids. Letters of marque provided legal cover for attacks on Spanish shipping and towns. Crews favored surprise boardings, cutting‑out expeditions in harbors, and joint overland assaults with local allies. Notable actions included strikes against treasure convoys and raids on ports like Portobelo. Profits, fluid loyalties, and maritime skill sustained their ventures. As state navies expanded and treaties curtailed privateering, buccaneering declined. Many veterans entered formal naval service or colonial militias, carrying forward tactics and seamanship."
    },
    {
        "name": "Musket Marines",
        "category": "Naval Melee",
        "requires": [
            {
                "type": "technology",
                "name": "Dynamite"
            }
        ],
        "upgradesFrom": [
            "Buccaneers"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 180
            },
            {
                "name": "Strength",
                "value": 28
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "type": "Domain",
                        "name": "Water"
                    }
                ]
            }
        ],
        "specials": [
            "Pillage Range 1"
        ],
        "actions": [
            "Attack",
            "Pillage",
            "Start\/End Piracy"
        ],
        "names": [
            {
                "platform": "Carvel",
                "name": "Brig"
            },
            {
                "platform": "Steamer",
                "name": "Gunboat"
            }
        ],
        "description": "Musket marines were naval infantry embarked to provide small‑arms fire, shipboard security, and landing parties during the industrial era. Improved firearms and drill made them effective at close defense, sharpshooting from decks, and rapid shore seizures. On rivers and littorals, gunboats delivered detachments for punitive expeditions and treaty enforcement, a practice linked to colonial interventions in Africa and China. In the American Civil War, Union and Confederate vessels carried landing parties for raids, fort seizures, and river control. As rifled muskets and later magazine rifles spread, cutlass combat waned and the bayonet became standard. Dedicated marine corps refined amphibious techniques, coordinated with naval gunnery, and supported emerging naval infantry roles that bridged sea and land operations."
    },
    {
        "name": "Torpedo",
        "category": "Torpedo",
        "requires": [
            {
                "type": "technology",
                "name": "Hydrodynamics"
            }
        ],
        "upgradesFrom": [
            "Musket Marines"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 260
            },
            {
                "name": "Strength",
                "value": 39
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "type": "Domain",
                        "name": "Water"
                    }
                ]
            },
            {
                "name": "Range",
                "value": 1
            }
        ],
        "specials": [
            "Can select Target"
        ],
        "actions": [
            "Bombard",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Submersible",
                "name": "Submarine"
            }
        ],
        "description": "Early self-propelled torpedoes emerged in the 1860s with Robert Whitehead’s designs at Fiume. Compressed air engines, gyroscopic guidance, and depth-keeping gear enabled accurate runs beneath a ship’s armor belt. Navies built torpedo boats and later destroyers to exploit and counter the weapon. In the Russo-Japanese War, night attacks demonstrated the torpedo’s reach against anchored and maneuvering fleets. By the 1890s, wet-heater propulsion increased range and speed. The weapon reshaped naval tactics by threatening capital ships beyond gun range and by encouraging dispersed formations. Torpedoes became standard armament on submarines, surface combatants, and aircraft in the early twentieth century. Submarine warfare in World War I confirmed their strategic impact."
    },
    {
        "name": "Guided Torpedo",
        "category": "Torpedo",
        "requires": [
            {
                "type": "technology",
                "name": "Guided Ordinance"
            }
        ],
        "upgradesFrom": [
            "Torpedo"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 360
            },
            {
                "name": "Strength",
                "value": 53
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "type": "Domain",
                        "name": "Water"
                    }
                ]
            },
            {
                "name": "Range",
                "value": 1
            }
        ],
        "specials": [
            "Can select Target"
        ],
        "actions": [
            "Bombard",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Submersible",
                "name": "Adv. Submarine"
            }
        ],
        "description": "Wire-guided torpedoes add midcourse control through a cable linking weapon and launch platform. The operator updates target data, steers around countermeasures, and refines aim until terminal homing. The concept matured during the Cold War as nuclear submarines hunted at long range and under challenging acoustic conditions. The U.S. Mk 48 family introduced reliable wire guidance with heavy-warhead performance. West German DM2 series weapons provided similar capabilities for NATO conventional submarines. Guidance links expanded engagement envelopes under ice, in littorals, and against evasive targets. Cut-wire autonomy completes the attack if the link fails. Later variants improved fiber-optic links, bandwidth, and resistance to towed decoys. Tactics emphasized quiet launch, slow initial run, and operator-driven reattacks."
    },
    {
        "name": "Homing Torpedo",
        "category": "Torpedo",
        "requires": [
            {
                "type": "technology",
                "name": "Homing Systems"
            },
            {
                "type": "resource",
                "name": "Electronics"
            }
        ],
        "upgradesFrom": [
            "Guided Torpedo"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 500
            },
            {
                "name": "Strength",
                "value": 73
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "type": "Domain",
                        "name": "Water"
                    }
                ]
            },
            {
                "name": "Range",
                "value": 1
            }
        ],
        "specials": [
            "Can select Target"
        ],
        "actions": [
            "Bombard",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Submersible",
                "name": "Stealth Submarine"
            }
        ],
        "description": "Modern homing torpedoes process acoustic and wake signatures with onboard computers to search, classify, and attack without external control. They combine passive listening with active sonar and advanced counter-countermeasures. Variable depth operations, programmable patterns, and multi-speed profiles help defeat decoys and evasive maneuvers. The U.S. Mk 48 ADCAP Mod 7 added improved processors, new software, and enhanced guidance logic in the 2000s. Britain’s Spearfish Mod 1 entered service with higher reliability, fiber-optic datalinks, and refined seeker performance. Russia’s UGST Fizik equips contemporary submarines with versatile deep and littoral engagement capability. Continual software updates extend life and maintain relevance against quieter targets."
    },
    {
        "name": "AI Torpedo",
        "category": "Torpedo",
        "requires": [
            {
                "type": "technology",
                "name": "Artificial Intelligence"
            },
            {
                "type": "resource",
                "name": "Electronics"
            }
        ],
        "upgradesFrom": [
            "Homing Torpedo"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 750
            },
            {
                "name": "Strength",
                "value": 100
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "type": "Domain",
                        "name": "Water"
                    }
                ]
            },
            {
                "name": "Range",
                "value": 1
            }
        ],
        "specials": [
            "Can select Target"
        ],
        "actions": [
            "Bombard",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Submersible",
                "name": "AI Submarine"
            }
        ],
        "description": "An AI torpedo is a projected evolution of autonomous underwater weapons. Onboard machine learning would fuse active, passive, and wake sensors to identify and prioritize contacts. Cooperative behaviors could coordinate search patterns, deconflict attacks, and mass effects against escorted formations. Resilient acoustic or optical modems would provide limited networking while preserving stealth. Long-endurance unmanned vehicles could carry and release such torpedoes far from bases. Concepts explore adaptive routing, real-time tactic generation, and self-healing swarms under jamming and decoys. Governance challenges include rules of engagement, human oversight, and safeguards against fratricide and unintended escalation. Testing would require high-fidelity synthetic environments and sea trials to validate classification accuracy and fail-safe behaviors."
    },
    {
        "name": "Air Gun",
        "category": "Air Combat",
        "requires": [
            {
                "type": "technology",
                "name": "Flight"
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 260
            },
            {
                "name": "Strength",
                "value": 39
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "type": "Domain",
                        "name": "Air"
                    }
                ]
            }
        ],
        "actions": [
            "Patrol"
        ],
        "names": [
            {
                "platform": "Biplane",
                "name": "Biplane"
            },
            {
                "platform": "Monocoque",
                "name": "Fighter"
            }
        ],
        "description": "Aircraft guns defined air combat in its first decades. Synchronization gear allowed forward-firing Vickers and Spandau machine guns to shoot through propellers in World War I. Interwar designs added wing guns and cannon for improved lethality. In World War II, fighters commonly carried 20 mm Hispano or MG 151 cannons with high explosive shells. Heavy machine guns such as the Browning .50 also remained prominent. Jet combat moved toward missiles, yet internal cannons persisted for close engagements and strafing. Gun pods and rotary cannon like the M61 Vulcan provided high rates of fire for interceptors and attack aircraft. They remain standard on modern fighters for last-ditch shots and precision ground fire."
    },
    {
        "name": "Air Missile",
        "category": "Air Combat",
        "requires": [
            {
                "type": "technology",
                "name": "Guidance Systems"
            }
        ],
        "upgradesFrom": [
            "Air Gun"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 360
            },
            {
                "name": "Strength",
                "value": 53
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "type": "Domain",
                        "name": "Air"
                    }
                ]
            }
        ],
        "actions": [
            "Patrol"
        ],
        "names": [
            {
                "platform": "Monocoque",
                "name": "Jet Fighter Gen. 1"
            },
            {
                "platform": "Supersonic",
                "name": "Jet Fighter Gen. 2"
            }
        ],
        "description": "Air-to-air missiles transformed fighter combat from gun duels to standoff engagements. Early heat-seekers and semi-active radar weapons matured into all-aspect seekers with counter-countermeasures. Active radar missiles such as AIM-120D introduced fire-and-forget capability with midcourse datalink updates. High off-boresight infrared missiles like AIM-9X enabled cued shots using helmet sights and thrust vectoring. The MBDA Meteor added a throttleable ramjet for sustained energy at long range and robust no-escape zones. Integration with networked sensors and fusion allows cooperative targeting and silent launches. Modern inventories pair short-range dogfight missiles with beyond-visual-range weapons to cover the full envelope. Rigorous rules of engagement and identification measures mitigate fratricide and civilian risk."
    },
    {
        "name": "Air Homing Missile",
        "category": "Air Combat",
        "requires": [
            {
                "type": "technology",
                "name": "Homing Systems"
            },
            {
                "type": "resource",
                "name": "Electronics"
            }
        ],
        "upgradesFrom": [
            "Air Missile"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 500
            },
            {
                "name": "Strength",
                "value": 73
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "type": "Domain",
                        "name": "Air"
                    }
                ]
            }
        ],
        "actions": [
            "Patrol"
        ],
        "names": [
            {
                "platform": "Supersonic",
                "name": "Jet Fighter Gen. 3"
            },
            {
                "platform": "Superagile",
                "name": "Jet Fighter Gen. 4"
            },
            {
                "platform": "Stealth",
                "name": "Stealth Fighter"
            }
        ],
        "description": "Next-generation air-to-air missiles are expected to network and cooperate in flight. Multi-sensor seekers blend active radar, passive RF, and imaging infrared to resist countermeasures. Two-way datalinks enable offboard cueing, retargeting, and role specialization among a salvo. Algorithms assign intercept geometry, deconflict trajectories, and sustain datalinks with low probability of intercept. AI-enhanced guidance supports shots against stealthy or highly maneuvering threats at long range. Concepts include collaborative swarms launched by stealth fighters that receive midcourse updates from distributed sensors. The aim is flexible effects from a shared inventory rather than single-missile duels. Modular seekers and open architectures ease upgrades as electronic warfare evolves."
    },
    {
        "name": "Javelin",
        "category": "Scout",
        "yields": [
            {
                "name": "Production Cost",
                "value": 10
            },
            {
                "name": "Strength",
                "value": 5
            },
            {
                "name": "Defense",
                "value": -15,
                "type": "percent"
            },
            {
                "name": "Range",
                "value": 1
            },
            {
                "name": "Sight Radius",
                "value": 1
            }
        ],
        "specials": [
            "Ignore move cost",
            "Cannot attack Water",
            "Can select Target"
        ],
        "actions": [
            "Bombard",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "Hunter"
            }
        ],
        "description": "The javelin is a light spear designed for throwing. Hunter-gatherers carried bundles for stalking medium game and for driving herds. Early warfare used javelin-armed skirmishers who screened heavier troops and exploited gaps. The weapon allowed rapid volleys from mobile fighters who could retreat before close combat. Short shafts and simple points made production easy for small communities. Archaeological finds and rock art show widespread use across Africa, Europe, and Asia from the Paleolithic onward. In many cultures, archery later displaced the javelin for range and rate of fire, yet skirmishers retained it for shock and flexibility. It remained common in ritual contests and hunting well into historic times."
    },
    {
        "name": "Bronze Javelin",
        "category": "Scout",
        "requires": [
            {
                "type": "technology",
                "name": "Bronze Working"
            }
        ],
        "upgradesFrom": [
            "Javelin"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 20
            },
            {
                "name": "Strength",
                "value": 7
            },
            {
                "name": "Defense",
                "value": -15,
                "type": "percent"
            },
            {
                "name": "Range",
                "value": 1
            },
            {
                "name": "Sight Radius",
                "value": 1
            }
        ],
        "specials": [
            "Ignore move cost",
            "Cannot attack Water",
            "Can select Target"
        ],
        "actions": [
            "Bombard",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "Scout"
            },
            {
                "platform": "Chariot",
                "name": "Chariot Scout"
            },
            {
                "platform": "Horse",
                "name": "Horse Scout"
            },
            {
                "platform": "Elephant",
                "name": "Elephant Scout"
            }
        ],
        "description": "Bronze-tipped javelins spread with metalworking across the Near East and Aegean in the second millennium BCE. Bronze points improved penetration and durability compared with wood or bone. Light troops and scouts carried several shafts for harassment, pursuit, and screening. Chariot crews often combined archery with javelins to disrupt enemy formations before a close pass. Finds from Ugarit, Mycenae, and Anatolia show socketed heads suited to quick replacement in campaign. The weapon fitted raiding warfare that favored speed, ambush, and limited engagements. As states fielded larger armies, bronze javelins equipped levies and skirmishers who preceded spear or axe-armed infantry. Regional styles varied with shaft length and head weight."
    },
    {
        "name": "Iron Javelin",
        "category": "Scout",
        "requires": [
            {
                "type": "technology",
                "name": "Iron Working"
            }
        ],
        "upgradesFrom": [
            "Bronze Javelin"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 45
            },
            {
                "name": "Strength",
                "value": 10
            },
            {
                "name": "Defense",
                "value": -15,
                "type": "percent"
            },
            {
                "name": "Range",
                "value": 1
            },
            {
                "name": "Sight Radius",
                "value": 1
            }
        ],
        "specials": [
            "Ignore move cost",
            "Cannot attack Water",
            "Can select Target"
        ],
        "actions": [
            "Bombard",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "Peltast"
            },
            {
                "platform": "Horse",
                "name": "Horse Peltast"
            },
            {
                "platform": "Elephant",
                "name": "Elephant Peltast"
            }
        ],
        "description": "Iron-headed javelins appeared widely in the first millennium BCE as smelting disseminated. Iron offered tough points that could be thinner without bending, improving range and penetration. Greek peltasts carried several and used them to break cohesion before hoplite clashes. In the Hellenistic era, light infantry and cavalry skirmishers continued this role across rough ground. Numidian horsemen in the Punic Wars excelled at close throws followed by rapid withdrawal. Simple construction allowed mass armament of levies. The iron javelin remained common until archery and later missile weapons dominated, though some regions preserved it in cavalry tactics and hunting. Roman light troops and auxilia also fielded lighter javelins distinct from the heavy pilum."
    },
    {
        "name": "Crossbow",
        "category": "Scout",
        "requires": [
            {
                "type": "technology",
                "name": "Machinery"
            }
        ],
        "upgradesFrom": [
            "Iron Javelin"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 80
            },
            {
                "name": "Strength",
                "value": 13
            },
            {
                "name": "Defense",
                "value": -15,
                "type": "percent"
            },
            {
                "name": "Range",
                "value": 1
            },
            {
                "name": "Sight Radius",
                "value": 1
            }
        ],
        "specials": [
            "Ignore move cost",
            "Cannot attack Water",
            "Can select Target"
        ],
        "actions": [
            "Bombard",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "Crossbowman"
            },
            {
                "platform": "Horse",
                "name": "Horse Crossbow"
            },
            {
                "platform": "Elephant",
                "name": "Elephant Crossbow"
            }
        ],
        "description": "The crossbow is a mechanical bow mounted on a stock and released by a trigger. It appeared in Eurasia in antiquity and spread widely in medieval Europe and Asia. Spanning methods ranged from simple belt hooks to windlasses and cranks. Training demands were lower than for longbow archers, which aided mass deployment. Heavy bolts could pierce mail and some plate at short range. Crossbowmen fought in field battles and excelled in sieges where steady aim mattered. Famous uses include Genoese crossbowmen at Crécy in 1346 and Crusader-era assaults on fortified places. Chinese states employed repeating and heavy crossbows for defense, with the Song dynasty cataloging models for walls and field units."
    },
    {
        "name": "Arquebus",
        "category": "Scout",
        "requires": [
            {
                "type": "technology",
                "name": "Firearms"
            }
        ],
        "upgradesFrom": [
            "Crossbow"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 130
            },
            {
                "name": "Strength",
                "value": 18
            },
            {
                "name": "Defense",
                "value": -15,
                "type": "percent"
            },
            {
                "name": "Range",
                "value": 1
            },
            {
                "name": "Sight Radius",
                "value": 1
            }
        ],
        "specials": [
            "Ignore move cost",
            "Cannot attack Water",
            "Can select Target"
        ],
        "actions": [
            "Bombard",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "Arquebusier"
            },
            {
                "platform": "Horse",
                "name": "Harquebusier"
            },
            {
                "platform": "Elephant",
                "name": "Elephant Arquebus"
            }
        ],
        "description": "The arquebus is an early shoulder-fired matchlock firearm that spread across Eurasia in the 15th and 16th centuries. A slow match ignited priming powder in a pan, firing a lead ball from a smoothbore. Shot power and armor penetration outclassed most crossbows, though weather and misfires were frequent. The weapon drove the pike-and-shot system, with arquebusiers delivering volleys under pike protection. Spanish tercios refined this tactic, and the Battle of Pavia in 1525 showcased its battlefield effect. Japanese domains adopted the Tanegashima arquebus after 1543, producing large numbers during the Sengoku period. Rest sticks, powder flasks, and drill improved rate of fire and cohesion."
    },
    {
        "name": "Rifled Musket",
        "category": "Scout",
        "requires": [
            {
                "type": "technology",
                "name": "Rifling"
            }
        ],
        "upgradesFrom": [
            "Arquebus"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 180
            },
            {
                "name": "Strength",
                "value": 24
            },
            {
                "name": "Defense",
                "value": -15,
                "type": "percent"
            },
            {
                "name": "Range",
                "value": 1
            },
            {
                "name": "Sight Radius",
                "value": 1
            }
        ],
        "specials": [
            "Ignore move cost",
            "Cannot attack Water",
            "Can select Target"
        ],
        "actions": [
            "Bombard",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "Light Infantry"
            },
            {
                "platform": "Horse",
                "name": "Light Cavalry"
            },
            {
                "platform": "Elephant",
                "name": "Elephant Rifles"
            }
        ],
        "description": "The rifled musket is a muzzle-loading shoulder arm with spiral grooves that impart spin to a conical projectile. Widespread adoption followed the Minié ball innovation in the 1840s, which allowed rapid loading and reliable rifling engagement. Effective ranges increased to several hundred meters, sharply raising lethality. The Crimean War saw early mass use. The American Civil War then standardized models such as the US Springfield and British Enfield, accelerating the shift to dispersed formations, earthworks, and entrenchment. Rate of fire remained lower than later breechloaders, and black powder smoke obscured fields. Yet accuracy altered tactics, logistics, and casualty patterns across mid-19th-century armies."
    },
    {
        "name": "Sniper",
        "category": "Scout",
        "requires": [
            {
                "type": "technology",
                "name": "Trench Warfare"
            }
        ],
        "upgradesFrom": [
            "Rifled Musket"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 260
            },
            {
                "name": "Strength",
                "value": 33
            },
            {
                "name": "Defense",
                "value": -15,
                "type": "percent"
            },
            {
                "name": "Range",
                "value": 1
            },
            {
                "name": "Sight Radius",
                "value": 1
            }
        ],
        "specials": [
            "Ignore move cost",
            "Cannot attack Water",
            "Can select Target"
        ],
        "actions": [
            "Bombard",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "Sniper"
            },
            {
                "platform": "Truck",
                "name": "Ranger"
            }
        ],
        "description": "A sniper is a trained marksman who employs concealment, observation, and precision fire at extended ranges. The role crystallized in World War I trench warfare with scoped rifles and dedicated teams. Doctrine emphasized independent stalking, counter-sniper work, and disruption of command posts and machine-gun crews. Notable cases include Simo Häyhä’s Winter War record and the duels in Stalingrad during World War II. Modern practice integrates rangefinders, ballistics charts, and spotter-shooter pairs. Camouflage, fieldcraft, and patience remain central to mission success across conventional and irregular conflicts."
    },
    {
        "name": "SMG",
        "category": "Spec Ops",
        "requires": [
            {
                "type": "technology",
                "name": "Vertical Flight"
            }
        ],
        "upgradesFrom": [
            "Sniper"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 360
            },
            {
                "name": "Production Cost",
                "value": 25,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 46
            },
            {
                "name": "Defense",
                "value": -15,
                "type": "percent"
            },
            {
                "name": "Range",
                "value": 1
            },
            {
                "name": "Paradrop Range",
                "value": 5
            },
            {
                "name": "Sight Radius",
                "value": 1
            }
        ],
        "specials": [
            "Ignore move cost",
            "Can move after attack",
            "Can select Target"
        ],
        "actions": [
            "Bombard",
            "Paradrop",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "Paratrooper"
            },
            {
                "platform": "Truck",
                "name": "Mot. Paratrooper"
            }
        ],
        "description": "The submachine gun fires pistol-caliber cartridges in compact, controllable bursts, favoring close-quarters combat. Early patterns appeared at the end of World War I and proliferated between the wars. Airborne and assault troops adopted SMGs for urban fighting, building clearing, and surprise raids. German Fallschirmjäger fielded MP38\/40 series weapons, while US paratroopers used Thompson variants and later M1A1 designs. British and Commonwealth forces employed the Sten for massed issue. During Operation Market Garden, paratroopers relied on SMGs for mobility and suppressive fire in street battles. The class balanced modest range with high rate of fire, simple handling, and compact profile."
    },
    {
        "name": "Night Vision",
        "category": "Spec Ops",
        "requires": [
            {
                "type": "technology",
                "name": "High-Power Radar"
            },
            {
                "type": "resource",
                "name": "Electronics"
            }
        ],
        "upgradesFrom": [
            "SMG"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 500
            },
            {
                "name": "Production Cost",
                "value": 25,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 63
            },
            {
                "name": "Defense",
                "value": -15,
                "type": "percent"
            },
            {
                "name": "Range",
                "value": 1
            },
            {
                "name": "Paradrop Range",
                "value": 7
            },
            {
                "name": "Sight Radius",
                "value": 1
            }
        ],
        "specials": [
            "Ignore move cost",
            "Can move after attack",
            "Can select Target"
        ],
        "actions": [
            "Bombard",
            "Paradrop",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "Special Forces"
            },
            {
                "platform": "Truck",
                "name": "Mot. Special Forces"
            }
        ],
        "description": "Night-vision systems amplify low light or detect infrared radiation to permit operations in darkness. Modern image intensifiers and uncooled thermal imagers can be helmet-mounted or weapon-mounted. Paired with infrared aiming lasers, they enable silent movement and precision engagement without visible illumination. Special operations forces integrated night vision at scale in the 2000s, conducting time-sensitive raids in Iraq and Afghanistan. The 2011 Abbottabad raid used night-vision and IR aiming to maintain surprise and control. Advances improved resolution, dynamic range, and durability while reducing weight. Training focuses on depth perception, light discipline, and deconfliction of laser and illumination tools."
    },
    {
        "name": "Sling",
        "category": "Ranged",
        "requires": [
            {
                "type": "technology",
                "name": "Slings"
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 10
            },
            {
                "name": "Production Cost",
                "value": 15,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 5
            },
            {
                "name": "Defense",
                "value": -15,
                "type": "percent"
            },
            {
                "name": "Range",
                "value": 2
            }
        ],
        "specials": [
            "Cannot attack Water",
            "Cannot kill Land Units",
            "Damages all Units in Tile"
        ],
        "actions": [
            "Bombard",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "Slinger"
            },
            {
                "platform": "Chariot",
                "name": "Chariot Slinger"
            }
        ],
        "description": "The sling is a corded projectile launcher that hurls stones or molded bullets using centrifugal force. It dates to prehistory and served for hunting and warfare across many regions. A pouch holds the projectile, and a sudden release sets its trajectory. Range and velocity rival light bows when used by skilled slingers. Archaeology records Neolithic use, with later armed forces fielding specialist units. Assyrian armies depicted slingers in reliefs, and Classical sources mention Balearic troops renowned for accuracy. The David and Goliath story preserves a near-eastern cultural memory of sling combat. Cheap materials and simple construction sustained its long service life."
    },
    {
        "name": "Bow",
        "category": "Ranged",
        "requires": [
            {
                "type": "technology",
                "name": "Archery"
            }
        ],
        "upgradesFrom": [
            "Sling"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 20
            },
            {
                "name": "Production Cost",
                "value": 15,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 7
            },
            {
                "name": "Defense",
                "value": -15,
                "type": "percent"
            },
            {
                "name": "Range",
                "value": 2
            }
        ],
        "specials": [
            "Cannot attack Water",
            "Cannot kill Land Units",
            "Damages all Units in Tile"
        ],
        "actions": [
            "Bombard",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "Bowman"
            },
            {
                "platform": "Chariot",
                "name": "Chariot Bowman"
            },
            {
                "platform": "Horse",
                "name": "Horse Bowman"
            },
            {
                "platform": "Elephant",
                "name": "Elephant Bowman"
            }
        ],
        "description": "The self bow is a single-piece wooden bow, often of yew, elm, or similar woods, paired with simple arrows. It emerged in prehistoric contexts and persisted as a core hunting and military tool. Performance depended on wood quality, draw weight, and arrow design. Bronze Age states fielded massed archers, with the Egyptians employing chariot-mounted archery at Kadesh. In East Asia, the Shang dynasty developed courtly and military archery traditions. Self bows supported skirmishing, volley fire, and hunting, and they required sustained training for battlefield effectiveness. They remained in use even as composite bows and later firearms spread."
    },
    {
        "name": "Composite Bow",
        "category": "Ranged",
        "requires": [
            {
                "type": "technology",
                "name": "Wood Composites"
            }
        ],
        "upgradesFrom": [
            "Bow"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 45
            },
            {
                "name": "Production Cost",
                "value": 15,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 10
            },
            {
                "name": "Defense",
                "value": -15,
                "type": "percent"
            },
            {
                "name": "Range",
                "value": 2
            }
        ],
        "specials": [
            "Cannot attack Water",
            "Cannot kill Land Units",
            "Damages all Units in Tile"
        ],
        "actions": [
            "Bombard",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "Archer"
            },
            {
                "platform": "Horse",
                "name": "Horse Archer"
            },
            {
                "platform": "Elephant",
                "name": "Elephant Archer"
            }
        ],
        "description": "The composite bow combines a wood core with horn on the belly and sinew on the back, glued under tension to store high energy in a compact form. Many were recurved and reflexed, enabling powerful shots from horseback. Production was complex and sensitive to humidity, but output excelled in rate of fire and penetration at short to medium ranges. Steppe cultures, including Scythians and later nomads, used them for mounted warfare. Parthian cavalry executed the famed backward “shot” while retreating. In East Asia, Han forces faced Xiongnu mounted archers wielding composite bows, prompting reforms in frontier defense and cavalry tactics."
    },
    {
        "name": "Longbow",
        "category": "Ranged",
        "requires": [
            {
                "type": "technology",
                "name": "Buttress"
            }
        ],
        "upgradesFrom": [
            "Composite Bow"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 80
            },
            {
                "name": "Production Cost",
                "value": 15,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 13
            },
            {
                "name": "Defense",
                "value": -15,
                "type": "percent"
            },
            {
                "name": "Range",
                "value": 2
            }
        ],
        "specials": [
            "Cannot attack Water",
            "Cannot kill Land Units",
            "Damages all Units in Tile"
        ],
        "actions": [
            "Bombard",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "Longbowman"
            },
            {
                "platform": "Horse",
                "name": "Horse Longbowman"
            },
            {
                "platform": "Elephant",
                "name": "Elephant Longbowman"
            }
        ],
        "description": "The longbow is a tall self bow, often of yew, drawing to the ear and delivering heavy arrows at long range. It became associated with Welsh and English levies trained from youth. Draw weights commonly exceeded 80 pounds, with war arrows tipped by bodkin or broadhead points. English campaigns in the Hundred Years’ War used massed longbow fire to disrupt and attrit advancing men-at-arms. Engagements at Crécy in 1346 and Agincourt in 1415 showed its battlefield effect when combined with fieldworks and disciplined shooting. Sustained training, robust logistics for arrows, and suitable timber supplies were essential to maintain its capability."
    },
    {
        "name": "Hand Cannon",
        "category": "Mortar",
        "requires": [
            {
                "type": "technology",
                "name": "Firearms"
            }
        ],
        "upgradesFrom": [
            "Longbow"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 130
            },
            {
                "name": "Production Cost",
                "value": 15,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 18
            },
            {
                "name": "Defense",
                "value": -15,
                "type": "percent"
            },
            {
                "name": "Range",
                "value": 2
            }
        ],
        "specials": [
            "Cannot attack Water",
            "Cannot kill Land Units",
            "Damages all Units in Tile"
        ],
        "actions": [
            "Bombard",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "Cannoneer"
            },
            {
                "platform": "Horse",
                "name": "Horse Cannoneer"
            },
            {
                "platform": "Elephant",
                "name": "Elephant Cannoneer"
            }
        ],
        "description": "The hand cannon was among the earliest handheld firearms. It appeared in Yuan dynasty China in the 13th century and spread across Eurasia by the 14th century. The weapon was a metal tube fixed to a stock or stave. Ignition used a touchhole and smoldering match. It fired lead or stone shot and sometimes darts. Hussite forces fielded crude hand cannons from wagons during the Hussite Wars. Ming garrisons used similar tubes in siege defense and assault. Performance was limited by low accuracy and slow handling. Yet it introduced shock, smoke, and armor piercing to infantry combat. The hand cannon evolved into the matchlock arquebus by the late 15th century through the addition of locks, better barrels, and standardized powder."
    },
    {
        "name": "Light Cannon",
        "category": "Mortar",
        "requires": [
            {
                "type": "technology",
                "name": "Rifling"
            }
        ],
        "upgradesFrom": [
            "Hand Cannon"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 180
            },
            {
                "name": "Production Cost",
                "value": 15,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 24
            },
            {
                "name": "Defense",
                "value": -15,
                "type": "percent"
            },
            {
                "name": "Range",
                "value": 2
            }
        ],
        "specials": [
            "Cannot attack Water",
            "Cannot kill Land Units",
            "Damages all Units in Tile"
        ],
        "actions": [
            "Bombard",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "Light Cannon"
            },
            {
                "platform": "Horse",
                "name": "Horse Cannon"
            },
            {
                "platform": "Elephant",
                "name": "Elephant Cannon"
            }
        ],
        "description": "Light cannon in the industrial era were mobile rifled guns designed for direct fire in support of infantry and cavalry. Advances in metallurgy produced steel barrels with higher pressures and longer life. Breech-loading mechanisms and fixed ammunition improved rate of fire. During the Crimean War, field batteries used lighter pieces for counterbattery and suppression. By the 1860s–1870s, Krupp exported steel rifled guns that equipped many European armies. These weapons fired shrapnel and common shell with reliable impact or time fuzes. Horse artillery used them for rapid maneuver. Light cannon remained integral through the Franco-Prussian War, where accurate rifled fire dominated smoothbore opponents. They bridged the gap between Napoleonic field guns and modern quick-firing artillery."
    },
    {
        "name": "Mortar",
        "category": "Mortar",
        "requires": [
            {
                "type": "technology",
                "name": "Trench Warfare"
            }
        ],
        "upgradesFrom": [
            "Light Cannon"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 260
            },
            {
                "name": "Production Cost",
                "value": 15,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 33
            },
            {
                "name": "Defense",
                "value": -15,
                "type": "percent"
            },
            {
                "name": "Range",
                "value": 2
            }
        ],
        "specials": [
            "Cannot attack Water",
            "Cannot kill Land Units",
            "Damages all Units in Tile"
        ],
        "actions": [
            "Bombard",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "Mortar"
            },
            {
                "platform": "Truck",
                "name": "Mot. Mortar"
            }
        ],
        "description": "Twentieth-century mortars delivered steep-trajectory fire from close to the front line. The British Stokes 3-inch mortar of 1915 established the modern pattern: a drop-fired finned bomb, smoothbore tube, bipod, and baseplate. It provided trench units with immediate high-angle fire against dugouts and wire. Interwar designs standardized 81 mm and 82 mm calibers. In World War II, the German Granatwerfer 34 and the Soviet 82-PM-41 equipped infantry battalions. Mortars proved effective in forests, mountains, and urban fighting. They were light enough for manpack or mule transport, yet delivered bursts of smoke, illumination, and high explosive. Postwar Brandt and US M29 designs extended range and reliability. Mortars became a universal infantry support arm."
    },
    {
        "name": "Guided Mortar",
        "category": "Mortar",
        "requires": [
            {
                "type": "technology",
                "name": "Guided Ordinance"
            }
        ],
        "upgradesFrom": [
            "Mortar"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 360
            },
            {
                "name": "Production Cost",
                "value": 15,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 46
            },
            {
                "name": "Defense",
                "value": -15,
                "type": "percent"
            },
            {
                "name": "Range",
                "value": 2
            }
        ],
        "specials": [
            "Cannot attack Water",
            "Cannot kill Land Units",
            "Damages all Units in Tile"
        ],
        "actions": [
            "Bombard",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "Guided Mortar"
            },
            {
                "platform": "Truck",
                "name": "Mot. Guided Mortar"
            }
        ],
        "description": "Guided mortar systems add precision to traditional high-angle fire. Guidance uses GPS\/INS, semi-active laser homing, or imaging infrared seekers. The US XM395 Precision Guided Mortar Munition offers meter-class accuracy from 120 mm tubes, reducing collateral damage in urban terrain. Sweden’s STRIX round, introduced in the 1990s, uses an IR seeker to attack armored vehicles from above. Guidance kits or purpose-built rounds can correct course after launch using canards or impulse thrusters. These munitions enable point strikes on brief targets and permit fewer rounds per mission. They also expand the role of light infantry mortars in complex terrain. Manuals retain standard ballistic procedures as fallback when guidance is denied."
    },
    {
        "name": "Attack Drone",
        "category": "Mortar",
        "requires": [
            {
                "type": "technology",
                "name": "Military Drones"
            },
            {
                "type": "resource",
                "name": "Electronics"
            }
        ],
        "upgradesFrom": [
            "Guided Mortar"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 500
            },
            {
                "name": "Production Cost",
                "value": 15,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 63
            },
            {
                "name": "Defense",
                "value": -15,
                "type": "percent"
            },
            {
                "name": "Range",
                "value": 2
            }
        ],
        "specials": [
            "Cannot attack Water",
            "Cannot kill Land Units",
            "Damages all Units in Tile"
        ],
        "actions": [
            "Bombard",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Human",
                "name": "Attack Drone"
            },
            {
                "platform": "Truck",
                "name": "Mot. Attack Drone"
            }
        ],
        "description": "Attack drones project future trends in armed unmanned aviation. They combine persistent surveillance, onboard target identification, and precision strike in a single platform. Autonomy manages navigation, deconfliction, and swarm coordination, while a human remains in command for lethal action. Expected payloads include guided bombs, loitering munitions, and directed-energy options. Data links and edge processing allow operation under contested spectrum conditions. The concept grows from 2010s–2020s loitering munitions and armed UAVs, and from early manned–unmanned teaming experiments. Future forces anticipate swarms that mass effects against air defenses and armor columns. Projected systems seek modular airframes, rapid launch from vehicles or ships, and recovery or expendability depending on mission."
    },
    {
        "name": "Battering Ram",
        "category": "Siege",
        "requires": [
            {
                "type": "technology",
                "name": "Sieging"
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 20
            },
            {
                "name": "Strength",
                "value": 7
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "type": "Concept",
                        "name": "Urban"
                    }
                ]
            }
        ],
        "actions": [
            "Attack",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Carriage",
                "name": "Battering Ram"
            }
        ],
        "description": "The battering ram was a principal tool of ancient and classical siegecraft. A heavy wooden beam, often shod with iron, was swung against gates or masonry until structural failure occurred. Assyrian reliefs show rams mounted under protective sheds with crews and sappers working together. Roman armies standardized rams within larger siege trains that included towers and earthworks. At Masada, Flavian forces drove a ramp against the fortress and used rams to attack the breached wall. Later variants hung the beam from chains to store kinetic energy and reduce friction. Defenders countered with fire, grapnels, and soft internal barricades. The ram dominated until artillery and countermining shifted siege methods."
    },
    {
        "name": "Catapult",
        "category": "Siege",
        "requires": [
            {
                "type": "technology",
                "name": "Mathematics"
            }
        ],
        "upgradesFrom": [
            "Battering Ram"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 45
            },
            {
                "name": "Production Cost",
                "value": 10,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 10
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "type": "Concept",
                        "name": "Urban"
                    }
                ]
            },
            {
                "name": "Range",
                "value": 2
            }
        ],
        "specials": [
            "Cannot kill Land Units",
            "Damages Buildings",
            "Damages Improvements",
            "Can carry stockpile"
        ],
        "actions": [
            "Bombard",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Carriage",
                "name": "Catapult"
            },
            {
                "platform": "Heavy Galley",
                "name": "Quadreme"
            }
        ],
        "description": "Catapults used torsion or tension energy to launch stones, bolts, or pots of incendiary material. Greek engineers developed the gastraphetes and early torsion engines in the fourth century BCE. Hellenistic and Roman armies refined the onager and ballista for field and siege roles. Crews adjusted skein tension and elevation to vary range. Carthaginian forces employed engines during Mediterranean sieges. Catapults inflicted psychological and physical damage on walls and dense formations. They required skilled rigging and constant maintenance to prevent limb failure. With the rise of the counterweight trebuchet, torsion catapults declined in primary siege roles, but they persisted in garrisons and aboard ships for light projectiles."
    },
    {
        "name": "Trebuchet",
        "category": "Siege",
        "requires": [
            {
                "type": "technology",
                "name": "Castles"
            }
        ],
        "upgradesFrom": [
            "Catapult"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 80
            },
            {
                "name": "Production Cost",
                "value": 10,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 13
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "type": "Concept",
                        "name": "Urban"
                    }
                ]
            },
            {
                "name": "Range",
                "value": 2
            }
        ],
        "specials": [
            "Cannot kill Land Units",
            "Damages Buildings",
            "Damages Improvements",
            "Can carry stockpile"
        ],
        "actions": [
            "Bombard",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Carriage",
                "name": "Trebuchet"
            },
            {
                "platform": "Heavy Clinker",
                "name": "Heavy Galleass"
            }
        ],
        "description": "The trebuchet was the preeminent medieval mechanical artillery. Counterweight machines replaced earlier traction types by the twelfth century, delivering heavy stones with high efficiency. A long arm pivoted on an axle; a massive counterweight powered the throw; a sling optimized release. Trebuchets hurled stones, carcasses, or incendiaries over walls. At Acre in 1191, rival machines battered fortifications for weeks. The Mongol-led siege of Xiangyang in 1273 used counterweight trebuchets provided by engineers of West Asian origin to break city walls. Construction demanded timber, carpenters, rigging, and careful siting. Gunpowder artillery eclipsed trebuchets in the fifteenth century, but replicas continue to demonstrate their range and accuracy."
    },
    {
        "name": "Bombard",
        "category": "Siege",
        "requires": [
            {
                "type": "technology",
                "name": "Gunpowder"
            }
        ],
        "upgradesFrom": [
            "Trebuchet"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 130
            },
            {
                "name": "Production Cost",
                "value": 10,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 18
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "type": "Concept",
                        "name": "Urban"
                    }
                ]
            },
            {
                "name": "Range",
                "value": 2
            }
        ],
        "specials": [
            "Cannot kill Land Units",
            "Damages Buildings",
            "Damages Improvements",
            "Can carry stockpile"
        ],
        "actions": [
            "Bombard",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Carriage",
                "name": "Bombard"
            },
            {
                "platform": "Heavy Clinker",
                "name": "Carrack"
            },
            {
                "platform": "Heavy Carvel",
                "name": "Galleon"
            }
        ],
        "description": "Bombards were early large-caliber gunpowder cannon for sieges during the late medieval and early Renaissance periods. They used wrought iron staves bound by hoops or cast bronze barrels, firing spherical stone shot. Rates of fire were slow due to heavy charges and delicate barrels. The Ottomans employed giant bombards at the siege of Constantinople in 1453, breaching sections of the Theodosian Walls. French forces in the Italian Wars combined smaller bronze bombards with field artillery to reduce fortresses. Transport required oxen, sledges, and elaborate carpentry. Trunnions, lighter metal, and iron cannonballs later enabled more manageable guns. Bombards introduced explosive propellant artillery to European siegecraft."
    },
    {
        "name": "Cannon",
        "category": "Siege",
        "requires": [
            {
                "type": "technology",
                "name": "Steel Casting"
            }
        ],
        "upgradesFrom": [
            "Bombard"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 180
            },
            {
                "name": "Production Cost",
                "value": 10,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 24
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "type": "Concept",
                        "name": "Urban"
                    }
                ]
            },
            {
                "name": "Range",
                "value": 2
            }
        ],
        "specials": [
            "Cannot kill Land Units",
            "Damages Buildings",
            "Damages Improvements",
            "Can carry stockpile"
        ],
        "actions": [
            "Bombard",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Carriage",
                "name": "Cannon"
            },
            {
                "platform": "Heavy Carvel",
                "name": "Ship-of-the-Line"
            },
            {
                "platform": "Heavy Steamer",
                "name": "Ironclad"
            }
        ],
        "description": "Industrial-era cannon benefited from cast-steel barrels, improved propellants, and reliable fuzes. Rifling and breech-loading turned artillery into accurate, long-range weapons for land and sea. Krupp fielded steel guns adopted across Europe, reshaping battlefield gunnery by the 1860s. Naval artillery shifted with ironclads such as HMS Warrior, whose broadside carried powerful rifled cannon. Common shell and shrapnel were standardized, while recoil systems and carriages improved stability. Quick-firing guns and fixed ammunition increased rates of fire against fast targets. Cannon became central to coastal defense, field corps, and fleets. Their development set the stage for twentieth-century howitzers, naval rifles, and modern artillery doctrine."
    },
    {
        "name": "Howitzer",
        "category": "Artillery",
        "requires": [
            {
                "type": "technology",
                "name": "Artillery"
            }
        ],
        "upgradesFrom": [
            "Cannon"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 260
            },
            {
                "name": "Production Cost",
                "value": 20,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 33
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "type": "Concept",
                        "name": "Urban"
                    }
                ]
            },
            {
                "name": "Range",
                "value": 3
            }
        ],
        "specials": [
            "Cannot kill Land Units",
            "Damages Buildings",
            "Damages Improvements",
            "Can carry stockpile"
        ],
        "actions": [
            "Bombard",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Carriage",
                "name": "Howitzer"
            },
            {
                "platform": "Tracked",
                "name": "Assault Gun"
            },
            {
                "platform": "Steamer",
                "name": "Steam Destroyer"
            },
            {
                "platform": "Diesel Hull",
                "name": "Destroyer"
            },
            {
                "platform": "Heavy Steamer",
                "name": "Dreadnought"
            },
            {
                "platform": "Heavy Diesel",
                "name": "Battleship"
            }
        ],
        "description": "The howitzer is a high-angle artillery piece designed for indirect fire into entrenchments and behind cover. In the late nineteenth century, industrialized armies adopted steel construction, recoil systems, and separate-loading ammunition with variable propellant charges, enabling flexible trajectories. The Krupp 15 cm sFH 93 (1893) and Škoda 10 cm M.99 (1899) became standard field and fortress weapons across Europe. Howitzers combined portability with curved fire that guns could not provide, making them central in sieges and positional warfare. During World War I they dominated counter-battery tasks and trench reduction using high explosive and shrapnel. Interwar developments refined carriages, shields, and limbers for motor traction. The type persisted into the twentieth century with split trails, faster rates of fire, and improved fuzes, securing a lasting role in combined-arms doctrine."
    },
    {
        "name": "Rocket Artillery",
        "category": "Artillery",
        "requires": [
            {
                "type": "technology",
                "name": "Ballistics"
            }
        ],
        "upgradesFrom": [
            "Howitzer"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 360
            },
            {
                "name": "Production Cost",
                "value": 20,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 46
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "type": "Concept",
                        "name": "Urban"
                    }
                ]
            },
            {
                "name": "Range",
                "value": 3
            }
        ],
        "specials": [
            "Cannot kill Land Units",
            "Damages Buildings",
            "Damages Improvements",
            "Can carry stockpile"
        ],
        "actions": [
            "Bombard",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Carriage",
                "name": "Rocket Artillery"
            },
            {
                "platform": "Tracked",
                "name": "Mech. Rocket Artillery"
            },
            {
                "platform": "Diesel Hull",
                "name": "Rocket Frigate"
            },
            {
                "platform": "Heavy Diesel",
                "name": "Rocket Cruiser"
            }
        ],
        "description": "Rocket artillery employs unguided rockets to deliver rapid area bombardment. Its modern battlefield impact emerged in World War II. Soviet BM-13 Katyusha batteries fired sudden salvos that saturated target zones and shocked defenders. German Nebelwerfer regiments fielded spin-stabilized rockets with smoke, high explosive, and chemical loads. The US T34 Calliope mounted tubes atop Sherman tanks to support assaults. Simplicity, high volume of fire, and light launch vehicles enabled swift relocation after firing. Dispersion limited point accuracy, but mass compensated at brigade scale. Postwar forces retained multiple launchers for suppression and interdiction, especially where logistics favored low-cost munitions. Counter-battery radar and improved camouflage shaped tactics, while psychological effects remained notable due to noise, blast, and the speed of salvo delivery."
    },
    {
        "name": "MLRS",
        "category": "Artillery",
        "requires": [
            {
                "type": "technology",
                "name": "Homing Systems"
            },
            {
                "type": "resource",
                "name": "Electronics"
            }
        ],
        "upgradesFrom": [
            "Rocket Artillery"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 500
            },
            {
                "name": "Production Cost",
                "value": 20,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 63
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "type": "Concept",
                        "name": "Urban"
                    }
                ]
            },
            {
                "name": "Range",
                "value": 3
            }
        ],
        "specials": [
            "Cannot kill Land Units",
            "Damages Buildings",
            "Damages Improvements",
            "Can carry stockpile"
        ],
        "actions": [
            "Bombard",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Carriage",
                "name": "MLRS"
            },
            {
                "platform": "Tracked",
                "name": "Mech. MLRS"
            },
            {
                "platform": "Diesel Hull",
                "name": "Missile Frigate"
            },
            {
                "platform": "Heavy Diesel",
                "name": "Missile Cruiser"
            }
        ],
        "description": "Multiple Launch Rocket Systems are self-propelled platforms that fire ripple salvos or precision rockets at long range. The M270 entered US and allied service in the 1980s and delivered deep fires during the 2003 Iraq War. Its wheeled counterpart, the M142 HIMARS, demonstrated rapid displacement and precision GMLRS strikes in Ukraine after 2022. The Russian BM-30 Smerch offered heavy-caliber saturation at extended ranges. Modern MLRS combine modular launch pods, GPS\/INS guidance, and shoot-and-scoot doctrine to reduce counter-battery risk. Ammunition families include unitary warheads, submunitions, and sensor-fuzed payloads. Networked targeting from UAVs and counter-battery radars improved effectiveness. The class bridges traditional rocket artillery and precision fires, enabling theater-level interdiction and responsive support across dispersed battlefields."
    },
    {
        "name": "Drone Swarm",
        "category": "Artillery",
        "requires": [
            {
                "type": "technology",
                "name": "Artificial Intelligence"
            },
            {
                "type": "resource",
                "name": "Electronics"
            }
        ],
        "upgradesFrom": [
            "MLRS"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 750
            },
            {
                "name": "Production Cost",
                "value": 20,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 86
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "type": "Concept",
                        "name": "Urban"
                    }
                ]
            },
            {
                "name": "Range",
                "value": 4
            }
        ],
        "specials": [
            "Cannot kill Land Units",
            "Damages Buildings",
            "Damages Improvements",
            "Can carry stockpile"
        ],
        "actions": [
            "Bombard",
            "Pillage"
        ],
        "names": [
            {
                "platform": "Carriage",
                "name": "Drone Swarm"
            },
            {
                "platform": "Tracked",
                "name": "Mech. Drone Swarm"
            },
            {
                "platform": "Diesel Hull",
                "name": "Drone Frigate"
            },
            {
                "platform": "Heavy Diesel",
                "name": "Drone Cruiser"
            }
        ],
        "description": "Drone swarms envision large numbers of small, networked unmanned aerial systems coordinating autonomously for strike and reconnaissance. They distribute sensing and attack tasks across nodes, reassign roles when drones are lost, and overwhelm defenses through simultaneity. DARPA’s OFFSET explored urban swarming, autonomy at scale, and human-on-the-loop control. Chinese research and PLA demonstrations showcased formation flight, collaborative target allocation, and adaptive routing. Projected battlefields feature swarms that cue artillery, seed loitering munitions, and saturate radars. Core enablers include low-cost airframes, edge processing, standardized payloads, and resilient links with mesh networking. Vulnerabilities include electronic warfare, GPS denial, and attrition by layered air defenses. Operational integration demands robust identification, deconfliction, and rules for escalation as manned and unmanned assets share congested airspace."
    },
    {
        "name": "Wood Deck",
        "category": "Carrier",
        "requires": [
            {
                "type": "technology",
                "name": "Aerodynamics"
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 260
            },
            {
                "name": "Production Cost",
                "value": 50,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 33
            },
            {
                "name": "Air Slot",
                "value": 2
            }
        ],
        "actions": [
            "Pillage"
        ],
        "names": [
            {
                "platform": "Diesel Hull",
                "name": "Carrier"
            }
        ],
        "description": "Wooden flight decks characterized the earliest aircraft carriers. They provided a light, repairable surface for fragile biplanes and early monoplanes. HMS Argus entered service in 1918 as the first full-deck carrier and validated continuous takeoff and landing operations. USS Langley (CV-1) trained US naval aviators in the 1920s and developed deck handling procedures. The Imperial Japanese Navy’s Akagi used wooden decking in the interwar period prior to later reconstructions. Wood simplified battle damage repair but posed fire risks and suffered under high landing loads. As aircraft grew heavier and faster, navies moved to steel and armored decks, improved arresting gear, and reinforced elevators. The wooden era established signaling, spotting, and recovery practices that shaped carrier aviation for the rest of the century."
    },
    {
        "name": "Catapult Deck",
        "category": "Carrier",
        "requires": [
            {
                "type": "technology",
                "name": "High-Power Radar"
            }
        ],
        "upgradesFrom": [
            "Wood Deck"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 360
            },
            {
                "name": "Production Cost",
                "value": 50,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 46
            },
            {
                "name": "Air Slot",
                "value": 3
            }
        ],
        "actions": [
            "Pillage"
        ],
        "names": [
            {
                "platform": "Diesel Hull",
                "name": "Heavy Carrier"
            }
        ],
        "description": "Catapult decks enable CATOBAR operations, launching heavy jet aircraft with steam catapults and recovering them with arresting gear. This configuration supports large strike fighters, airborne early warning platforms, and tankers at full fuel and ordnance loads. The US Navy’s Nimitz-class sustained high sortie rates using multiple waist and bow catapults. France’s Charles de Gaulle operates Rafale M and E-2C\/D from a compact nuclear hull with steam catapults. USS John C. Stennis exemplified mature deck choreography and night operations. Steam catapults demand intensive maintenance and fresh water, yet deliver predictable end-speed across sea states. In the 2000s, some fleets began transitioning to electromagnetic launch systems, but CATOBAR with steam remained the benchmark for heavy carrier aviation."
    },
    {
        "name": "Radar Deck",
        "category": "Carrier",
        "requires": [
            {
                "type": "technology",
                "name": "High-Power Radar"
            }
        ],
        "upgradesFrom": [
            "Catapult Deck"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 500
            },
            {
                "name": "Production Cost",
                "value": 50,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 63
            },
            {
                "name": "Air Slot",
                "value": 4
            }
        ],
        "actions": [
            "Pillage"
        ],
        "names": [
            {
                "platform": "Diesel Hull",
                "name": "Fleet Carrier"
            },
            {
                "platform": "Nuclear Hull",
                "name": "Nuclear Carrier"
            }
        ],
        "description": "Radar deck denotes carrier designs that merge advanced phased-array sensors, integrated masts, and a UAV-centered air wing. The concept treats the ship as a high-power node in a distributed network, fusing emissions control, long-range air search, and fire-control quality tracks. Next-generation CVN studies describe conformal arrays, panoramic electronic warfare suites, and resilient links to unmanned tankers, early warning drones, and strike assets. Speculation around PLAN Type 004 outlines similar integration. Flight deck layouts anticipate compact maintenance for UAV detachments, automated handling, and rapid data offload. Sensor fusion supports cooperative engagements with escorts and land-based systems. Such carriers aim to extend detection and kill chains while reducing pilot risk, though power, cooling, and electromagnetic compatibility remain major engineering challenges."
    },
    {
        "name": "Missile Bay",
        "category": "Missile Bay",
        "requires": [
            {
                "type": "technology",
                "name": "Ballistics"
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 360
            },
            {
                "name": "Production Cost",
                "value": 10,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 46
            },
            {
                "name": "Missile Slot",
                "value": 3
            }
        ],
        "actions": [
            "Pillage"
        ],
        "names": [
            {
                "platform": "Submersible",
                "name": "Missile Submarine"
            },
            {
                "platform": "Nuclear Sub",
                "name": "Nuclear Submarine"
            }
        ],
        "description": "Missile bays on submarines house ballistic or cruise missiles in dedicated tubes, enabling covert strategic strike or conventional attack. The US USS George Washington conducted the first Polaris SSBN patrols in 1960, establishing at-sea nuclear deterrence. The Soviet Project 667A Yankee class expanded continuous patrol patterns in the North Atlantic and Arctic. The Ohio class carried Trident systems through the late Cold War and beyond, with some hulls later converted to SSGNs for Tomahawk salvos and special operations support. Missile compartments required structural reinforcement, quieting measures, and complex launch control with gas-ejection systems. Patrol doctrine emphasized endurance, secure communications, and survivability. Reload at sea remained impractical, making port turnarounds and secure bastions central to force management."
    },
    {
        "name": "AA Gun",
        "category": "Anti-Air",
        "requires": [
            {
                "type": "technology",
                "name": "Repeating Rifles"
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 260
            },
            {
                "name": "Strength",
                "value": 33
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "type": "Domain",
                        "name": "Air"
                    }
                ]
            },
            {
                "name": "Intercept",
                "value": 67,
                "type": "percent"
            },
            {
                "name": "Range",
                "value": 1
            }
        ],
        "actions": [
            "Pillage"
        ],
        "names": [
            {
                "platform": "Carriage",
                "name": "AA Gun"
            },
            {
                "platform": "Truck",
                "name": "Mobile AA"
            },
            {
                "platform": "Steamer",
                "name": "AA Steamer"
            },
            {
                "platform": "Diesel Hull",
                "name": "AA Destroyer"
            }
        ],
        "description": "Anti-aircraft guns formed the first line of defense against aircraft from World War I through early Cold War years. By World War II, heavy pieces such as the German 8.8 cm Flak and British QF 3.7-inch engaged high-altitude bombers using predictors, height-finders, and later proximity fuzes. Light and medium weapons, including the US M45 Quadmount, defended against strafers and dive bombers. Radar-directed fire control improved accuracy for barrage and tracking fire. Dense gun belts protected cities, ports, and field formations. Missiles gradually took over medium and high-altitude roles, but guns endured against close air threats and evolved into radar-guided systems and CIWS for ships and airfields. Ammunition developments added airburst and programmable fuzes for modern applications."
    },
    {
        "name": "AA Missile",
        "category": "Anti-Air",
        "requires": [
            {
                "type": "technology",
                "name": "Guidance Systems"
            }
        ],
        "upgradesFrom": [
            "AA Gun"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 360
            },
            {
                "name": "Strength",
                "value": 46
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "type": "Domain",
                        "name": "Air"
                    }
                ]
            },
            {
                "name": "Intercept",
                "value": 75,
                "type": "percent"
            },
            {
                "name": "Range",
                "value": 2
            }
        ],
        "actions": [
            "Pillage"
        ],
        "names": [
            {
                "platform": "Carriage",
                "name": "SAM"
            },
            {
                "platform": "Truck",
                "name": "Mobile SAM"
            },
            {
                "platform": "Diesel Hull",
                "name": "SAM Destroyer"
            }
        ],
        "description": "Surface-to-air missiles emerged to counter fast jets and high-altitude bombers, and evolved into layered air-defense networks by the 2000s. Systems such as Patriot PAC-3 demonstrated hit-to-kill intercepts and defended forces and infrastructure in Iraq in 2003. NASAMS protected Washington, D.C., integrating networked radars and AIM-120 missiles for flexible urban defense. The Russian S-300PMU2 provided long-range coverage and area denial for many operators. Modern SAMs pair phased-array radars, data links, and seekers with mobile launchers to engage aircraft, cruise missiles, and some ballistic targets. Engagements rely on cueing from airborne and ground sensors, electronic counter-countermeasures, and shoot-look-shoot doctrine. Logistics, training, and emissions control shape effectiveness under suppression of enemy air defense conditions."
    },
    {
        "name": "AA Homing Missile",
        "category": "Anti-Air",
        "requires": [
            {
                "type": "technology",
                "name": "Homing Systems"
            },
            {
                "type": "resource",
                "name": "Electronics"
            }
        ],
        "upgradesFrom": [
            "AA Missile"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 500
            },
            {
                "name": "Strength",
                "value": 63
            },
            {
                "name": "Strength",
                "value": 30,
                "type": "percent",
                "vs": [
                    {
                        "type": "Domain",
                        "name": "Air"
                    }
                ]
            },
            {
                "name": "Intercept",
                "value": 100,
                "type": "percent"
            },
            {
                "name": "Range",
                "value": 3
            }
        ],
        "actions": [
            "Pillage"
        ],
        "names": [
            {
                "platform": "Carriage",
                "name": "Homing SAM"
            },
            {
                "platform": "Truck",
                "name": "Mot. Homing SAM"
            },
            {
                "platform": "Diesel Hull",
                "name": "AEGIS Destroyer"
            }
        ],
        "description": "AA Homing Missile is a projected generation of surface-to-air interceptors that fuse networked sensors, multi-mode seekers, and cooperative guidance to defeat fast, distant targets. It extends the classic SAM envelope into long-range counter-air and limited missile defense. Offboard cueing from radars, fighters, and satellites enables beyond-horizon launches and midcourse updates. Terminal guidance employs active radar, passive RF, and imaging infrared to counter evasive aircraft and low-signature threats. Agile control surfaces and datalinks support salvo cooperation and target handoff. Notional examples include AEGIS follow-on interceptors beyond SM-6, post–S-500 long-range concepts, and glide-phase hypersonic intercept programs. The design focus is resilience against jamming, decoys, and maneuver. Such missiles would operate within layered air defense networks integrating command-and-control, electronic warfare, and battle management."
    },
    {
        "name": "Rocket Pod",
        "category": "Ground Attack",
        "requires": [
            {
                "type": "technology",
                "name": "Rocketry"
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 260
            },
            {
                "name": "Strength",
                "value": 33
            },
            {
                "name": "Strength",
                "value": 15,
                "type": "percent",
                "vs": [
                    {
                        "category": "Platform",
                        "name": "Vehicle"
                    }
                ]
            },
            {
                "name": "Strength",
                "value": 15,
                "type": "percent",
                "vs": [
                    {
                        "type": "Domain",
                        "name": "Water"
                    }
                ]
            }
        ],
        "specials": [
            "Can select Target"
        ],
        "actions": [
            "Bombard"
        ],
        "names": [
            {
                "platform": "Monocoque",
                "name": "Dive Bomber"
            },
            {
                "platform": "Supersonic",
                "name": "Strike Fighter Gen. 1"
            }
        ],
        "description": "Rocket pods are aircraft-mounted launchers for unguided rockets used in close air support and interdiction. They provide rapid ripple fire against area targets such as troop concentrations, soft vehicles, and light fortifications. Pods simplify maintenance and allow flexible loadouts on fighters, attack aircraft, and helicopters. In the Second World War, RAF Typhoons fired RP-3 rockets against armor and rail lines with notable effect. Postwar forces adopted standardized rockets like the 5-inch Zuni, carried by jets and naval aircraft. During the Vietnam War, the 2.75-inch Hydra 70 became a staple for gunships and helicopters. Despite the rise of precision weapons, rocket pods remain common due to low cost and high volume of fire. Modern sights and fuzes improve accuracy and lethality."
    },
    {
        "name": "AT-Missile",
        "category": "Ground Attack",
        "requires": [
            {
                "type": "technology",
                "name": "Hollow Charge"
            }
        ],
        "upgradesFrom": [
            "Rocket Pod"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 360
            },
            {
                "name": "Strength",
                "value": 46
            },
            {
                "name": "Strength",
                "value": 15,
                "type": "percent",
                "vs": [
                    {
                        "category": "Platform",
                        "name": "Vehicle"
                    }
                ]
            },
            {
                "name": "Strength",
                "value": 15,
                "type": "percent",
                "vs": [
                    {
                        "type": "Domain",
                        "name": "Water"
                    }
                ]
            }
        ],
        "specials": [
            "Can select Target"
        ],
        "actions": [
            "Bombard"
        ],
        "names": [
            {
                "platform": "Supersonic",
                "name": "Strike Fighter Gen. 2"
            },
            {
                "platform": "Superagile",
                "name": "Strike Fighter Gen. 3"
            }
        ],
        "description": "Air-launched anti-tank guided missiles enable aircraft and helicopters to destroy armored vehicles from stand-off range. Semi-active laser, millimeter-wave radar, or dual-mode seekers provide precision against moving targets and in cluttered environments. The AGM-114 Hellfire defined the class during conflicts in Iraq and Afghanistan, delivering reliable armor defeat and urban precision. The British Brimstone added fire-and-forget capability and salvo employment, demonstrated during Libya operations in 2011. Extended-range variants like Spike-ER and Spike NLOS allow engagement from tens of kilometers with man-in-the-loop control. Typical warheads use tandem HEAT to defeat explosive reactive armor. Networked targeting from UAVs and ground teams expanded employment flexibility. These missiles reduced exposure of crews and platforms while providing persistent overwatch for maneuver units."
    },
    {
        "name": "Drone Missile",
        "category": "Ground Attack",
        "requires": [
            {
                "type": "technology",
                "name": "Military Drones"
            },
            {
                "type": "resource",
                "name": "Electronics"
            }
        ],
        "upgradesFrom": [
            "AT-Missile"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 500
            },
            {
                "name": "Strength",
                "value": 63
            },
            {
                "name": "Strength",
                "value": 15,
                "type": "percent",
                "vs": [
                    {
                        "category": "Platform",
                        "name": "Vehicle"
                    }
                ]
            },
            {
                "name": "Strength",
                "value": 15,
                "type": "percent",
                "vs": [
                    {
                        "type": "Domain",
                        "name": "Water"
                    }
                ]
            }
        ],
        "specials": [
            "Can select Target"
        ],
        "actions": [
            "Bombard"
        ],
        "names": [
            {
                "platform": "Superagile",
                "name": "Strike Fighter Gen. 4"
            }
        ],
        "description": "Drone missile employment denotes unmanned combat air vehicles launching precision munitions against ground targets under remote or autonomous control. The approach reduces risk to pilots and increases persistence over contested airspace. Loyal wingman concepts pair attritable drones with crewed fighters for cooperative strikes. Trials with the Kratos XQ-58A explored collaborative missions, sensor sharing, and weapons release under supervision. Future massed attack scenarios envision swarms saturating defenses through route diversity and timing control. Onboard autonomy manages navigation, deconfliction, and target assignment within command intent. Data-links support human authorization and retargeting. Modular payload bays carry small guided missiles or glide bombs tailored to point targets. The model scales from single sorties to distributed campaigns supplied by rapid manufacturing."
    },
    {
        "name": "Bomb",
        "category": "Bomb",
        "requires": [
            {
                "type": "technology",
                "name": "Flight"
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 260
            },
            {
                "name": "Production Cost",
                "value": 25,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 33
            },
            {
                "name": "Strength",
                "value": 15,
                "type": "percent",
                "vs": [
                    {
                        "type": "Concept",
                        "name": "Urban"
                    }
                ]
            },
            {
                "name": "Range",
                "value": 50,
                "type": "percent"
            }
        ],
        "specials": [
            "Cannot kill Land Units",
            "Damages Buildings",
            "Damages Improvements",
            "Damages all Units in Tile",
            "Can carry stockpile"
        ],
        "actions": [
            "Bombard"
        ],
        "names": [
            {
                "platform": "Biplane",
                "name": "Light Bomber"
            },
            {
                "platform": "Monocoque",
                "name": "Heavy Bomber"
            }
        ],
        "description": "Unguided aerial bombs formed the core of early airpower. Crews released gravity weapons over area targets using visual or mechanical aiming. During the First World War, Gotha bombers and Zeppelins carried out raids on cities and ports. Interwar development improved fuzes, casings, and bomb racks. In the Second World War, mass formations of B-17 and B-24 bombers conducted strategic campaigns against industrial centers. Dive-bombers such as the Ju 87 Stuka achieved accuracy through steep attack profiles. Unguided bombs proved effective against fixed infrastructure and troop positions but required large quantities and favorable weather. Circular error probable remained high. Postwar use declined with the advent of precision guidance, yet general-purpose bombs persisted as low-cost options when collateral risk was acceptable."
    },
    {
        "name": "Guided Bomb",
        "category": "Bomb",
        "requires": [
            {
                "type": "technology",
                "name": "Guided Ordinance"
            }
        ],
        "upgradesFrom": [
            "Bomb"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 360
            },
            {
                "name": "Production Cost",
                "value": 25,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 46
            },
            {
                "name": "Strength",
                "value": 15,
                "type": "percent",
                "vs": [
                    {
                        "type": "Concept",
                        "name": "Urban"
                    }
                ]
            },
            {
                "name": "Range",
                "value": 50,
                "type": "percent"
            }
        ],
        "specials": [
            "Cannot kill Land Units",
            "Damages Buildings",
            "Damages Improvements",
            "Damages all Units in Tile",
            "Can carry stockpile"
        ],
        "actions": [
            "Bombard"
        ],
        "names": [
            {
                "platform": "Monocoque",
                "name": "Jet Bomber Gen. 1"
            },
            {
                "platform": "Supersonic",
                "name": "Jet Bomber Gen. 2"
            }
        ],
        "description": "Guided bombs add seekers and control kits to standard bomb bodies to achieve precise impact on fixed targets. Laser, GPS\/INS, or dual-mode guidance reduces circular error probable and collateral damage. The JDAM kit transformed general-purpose bombs into all-weather weapons during the Iraq War in 2003. Paveway laser-guided bombs saw extensive use in Afghanistan from 2001, striking caves, bunkers, and urban strongpoints. The GBU-39 Small Diameter Bomb introduced compact glide with high loadout counts and standoff. Guidance enables engagement from higher altitude outside many air defenses. Kits support impact fuzes, delay fuzes, and penetrators for hardened structures. Networked targeting and digital maps improved weaponeering. Guided bombs became the standard for deliberate strikes in modern air campaigns."
    },
    {
        "name": "Homing Bomb",
        "category": "Bomb",
        "requires": [
            {
                "type": "technology",
                "name": "Homing Systems"
            },
            {
                "type": "resource",
                "name": "Electronics"
            }
        ],
        "upgradesFrom": [
            "Guided Bomb"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 500
            },
            {
                "name": "Production Cost",
                "value": 25,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 63
            },
            {
                "name": "Strength",
                "value": 15,
                "type": "percent",
                "vs": [
                    {
                        "type": "Concept",
                        "name": "Urban"
                    }
                ]
            },
            {
                "name": "Range",
                "value": 50,
                "type": "percent"
            }
        ],
        "specials": [
            "Cannot kill Land Units",
            "Damages Buildings",
            "Damages Improvements",
            "Damages all Units in Tile",
            "Can carry stockpile"
        ],
        "actions": [
            "Bombard"
        ],
        "names": [
            {
                "platform": "Supersonic",
                "name": "Jet Bomber Gen. 3"
            },
            {
                "platform": "Superagile",
                "name": "Jet Bomber Gen. 4"
            }
        ],
        "description": "Homing bombs are projected precision munitions that use onboard seekers and advanced control to autonomously identify and home on targets after release. Multi-mode seekers fuse radar, infrared, and optical cues to maintain track through smoke, camouflage, and electronic attack. Glide kits and pop-out wings extend range, enabling release outside point defenses. Algorithms conduct target recognition, aim-point selection, and aim correction in flight. Swarming releases permit coordinated deconfliction and sequenced impacts on complex sites. Concepts include autonomous target recognition glide bombs and next-generation PGMs with modular seekers. Such weapons aim to reduce dependence on continuous laser designation or GPS. The approach supports dynamic targeting against relocatable systems, mobile air defenses, and time-sensitive emitters under heavy countermeasures."
    },
    {
        "name": "Comms Satellite",
        "category": "Satellite",
        "requires": [
            {
                "type": "technology",
                "name": "Space Flight"
            },
            {
                "type": "resource",
                "name": "Electronics"
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 500
            },
            {
                "name": "Culture",
                "value": 15,
                "type": "percent",
                "for": [
                    {
                        "type": "concept",
                        "name": "Citizen"
                    }
                ]
            },
            {
                "name": "Gold",
                "value": 15,
                "type": "percent",
                "for": [
                    {
                        "type": "concept",
                        "name": "Citizen"
                    }
                ]
            }
        ],
        "names": [
            {
                "platform": "Satellite",
                "name": "Comms Satellite"
            }
        ],
        "description": "Communications satellites relay voice, data, and broadcast signals across long distances by operating as repeaters in Earth orbit. Early experiments culminated in Telstar in 1962, which linked live television between continents. Global constellations under Intelsat extended telephony and television distribution during the late twentieth century. Inmarsat provided maritime and aeronautical services, improving safety and navigation information at sea and in flight. Satellites use geostationary or non-geostationary orbits, with transponders in bands such as C, Ku, and Ka. Ground stations and user terminals uplink and downlink through steerable antennas. Advances increased bandwidth, spot-beam reuse, and digital processing. Communications satellites became critical for international broadcasting, disaster relief, remote telemedicine, and command-and-control for both civil and military users."
    },
    {
        "name": "Spy Satellite",
        "category": "Satellite",
        "requires": [
            {
                "type": "technology",
                "name": "Space Flight"
            },
            {
                "type": "resource",
                "name": "Electronics"
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 500
            },
            {
                "name": "Sight Radius",
                "value": 3
            }
        ],
        "names": [
            {
                "platform": "Satellite",
                "name": "Spy Satellite"
            }
        ],
        "description": "Reconnaissance satellites collect imagery and signals from orbit to inform national security, mapping, and crisis monitoring. Electro-optical systems like the KH-11 family provide high-resolution photographs in daylight. Synthetic aperture radar spacecraft such as Lacrosse\/Onyx produce images through cloud and darkness. Commercial platforms, including WorldView-3, supply detailed imagery to governments and industry. Modern constellations integrate precision pointing, rapid tasking, and encrypted downlinks. Data flow through relay satellites to reduce latency. Analysis combines multispectral data with ground observations. Reconnaissance from space expanded strategic warning, treaty verification, and targeting without overflight violations. The capability evolved from film-return satellites to real-time digital collection with broad area search and narrow spot collection from low Earth orbit."
    },
    {
        "name": "Worker",
        "category": "Worker",
        "yields": [
            {
                "name": "Production Cost",
                "value": 15
            }
        ],
        "specials": [
            "Max 2 per City"
        ],
        "actions": [
            "Build",
            "Repair"
        ],
        "platforms": [
            {
                "platform": "Human",
                "name": "Worker"
            }
        ],
        "description": "Workers in ancient societies formed organized labor groups that built and maintained essential infrastructure. Agricultural communities excavated irrigation ditches, canals, and reservoirs to control seasonal water. Stone quarries supplied blocks for temples, walls, and civic buildings, supported by skilled masonry. Crews built packed-earth roads, causeways, and bridges that improved trade and military movement. Terracing stabilized hillsides and expanded arable land. Labor was mobilized through kinship, guilds, taxation, or corvée service under local authorities. Tools included stone picks, wooden shovels, sledges, and simple cranes. Archaeological records show planned work gangs, ration distribution, and overseer marks on blocks. These labor systems created durable landscapes that shaped settlement patterns and state formation over centuries."
    },
    {
        "name": "Builder",
        "category": "Worker",
        "requires": [
            {
                "type": "technology",
                "name": "Government"
            }
        ],
        "upgradesFrom": [
            "Worker"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 30
            }
        ],
        "specials": [
            "Max 2 per City"
        ],
        "actions": [
            "Build",
            "Repair"
        ],
        "platforms": [
            {
                "platform": "Human",
                "name": "Builder"
            }
        ],
        "description": "Builders in the Bronze Age formed the skilled core of early state projects. They raised monumental and civic works using mudbrick, dressed stone, and timber. At Ur they constructed ziggurats with staged platforms and baked brick facing. In Egypt Old Kingdom crews quarried limestone and granite, hauled blocks on sledges, and set courses with plumb lines and ramps. In the Indus Valley they laid city walls, gridded streets, and drains in standardized brick. Organization relied on overseers, seasonal labor levies, and storehouse rations. Tools included copper chisels, adzes, cord surveys, and simple cranes. Their works anchored taxation, ritual, and administrative authority."
    },
    {
        "name": "Peasant",
        "category": "Worker",
        "requires": [
            {
                "type": "technology",
                "name": "Feudalism"
            }
        ],
        "upgradesFrom": [
            "Builder"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 120
            }
        ],
        "specials": [
            "Max 2 per City"
        ],
        "actions": [
            "Build",
            "Repair"
        ],
        "platforms": [
            {
                "platform": "Human",
                "name": "Peasant"
            }
        ],
        "description": "Medieval peasants sustained agrarian economies under varied legal ties. In Europe many worked as serfs within open-field systems. They owed labor services or rents to manorial lords and rotated strips across communal fields. In Song China smallholders and tenants expanded rice paddy terracing, water control, and double cropping. In the medieval Islamic world villagers maintained qanats, gardens, and oasis fields under local and waqf arrangements. Tools were iron ploughs, hoes, and scythes. Village councils organized grazing and harvest. Taxes, tithes, and corvée framed obligations. Peasant surplus funded towns, monasteries, and armies, while poor harvests exposed communities to famine and revolt."
    },
    {
        "name": "Engineer",
        "category": "Worker",
        "requires": [
            {
                "type": "technology",
                "name": "Dynamite"
            }
        ],
        "upgradesFrom": [
            "Peasant"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 270
            }
        ],
        "specials": [
            "Max 2 per City"
        ],
        "actions": [
            "Build",
            "Repair"
        ],
        "platforms": [
            {
                "platform": "Human",
                "name": "Engineer"
            }
        ],
        "description": "Industrial-era engineers combined scientific training with field practice to deliver large works. They surveyed with theodolites, leveled grades, and computed loads for iron and steel. Explosives and steam plant enabled canal cuts, tunnels, and bridges at new scales. The Suez Canal demanded dredging, blasting, and disease control across shifting sands. In North America the transcontinental railway drove cuttings, trestles, and standardized gauges across mountains and plains. Mining engineers drove deep shafts, ventilated workings, and managed pumps against flooding. Professional societies codified standards, drawings, and safety. Government corps and private firms coordinated finance and labor. Their methods shaped global transport and extraction networks."
    },
    {
        "name": "Tractor",
        "category": "Worker",
        "requires": [
            {
                "type": "technology",
                "name": "Tracked Treads"
            }
        ],
        "upgradesFrom": [
            "Engineer"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 390
            }
        ],
        "specials": [
            "Max 2 per City"
        ],
        "actions": [
            "Build",
            "Repair"
        ],
        "platforms": [
            {
                "platform": "Human",
                "name": "Tractor"
            }
        ],
        "description": "The tractor is a powered vehicle designed to deliver drawbar pull and power take-off for agricultural and construction tasks. Early models adopted internal combustion engines, steel lugs, and later rubber tires. Tracked variants, exemplified by Caterpillar, improved traction on soft soils and served as the base for bulldozers and graders. In the 1920s to 1950s tractors replaced draft animals on many farms and enabled deeper plowing and mechanized seeding and harvesting. Soviet collectivization pushed rapid field mechanization through state machine-tractor stations. During the Dust Bowl era, conservation agencies used tractors for contour plowing and shelterbelt planting. Standardized hitches, hydraulics, and PTO drives expanded implement ranges. Tractors reshaped rural labor, land consolidation, and yields."
    },
    {
        "name": "Contractor",
        "category": "Worker",
        "requires": [
            {
                "type": "technology",
                "name": "Robotics"
            }
        ],
        "upgradesFrom": [
            "Tractor"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 750
            }
        ],
        "specials": [
            "Max 2 per City"
        ],
        "actions": [
            "Build",
            "Repair"
        ],
        "platforms": [
            {
                "platform": "Human",
                "name": "Contractor"
            }
        ],
        "description": "Contractors in the early twenty-first century manage complex builds with digital coordination and automated fleets. They integrate scheduling, cost, and clash detection through BIM and digital twins. On megasites, contractors field autonomous mining trucks and remote operations rooms. Robotics and 3D printers place concrete walls and repetitive components. Drones map progress and volumetrics. Supply chains are tracked with sensors and just-in-time delivery. Safety systems rely on geofencing and wearable monitors. Contracts balance risk between owners and consortia under global standards. The contractor’s role blends engineering oversight, data management, and compliance across dispersed teams and highly instrumented worksites."
    },
    {
        "name": "Tribe",
        "category": "Settler",
        "requires": [
            {
                "type": "technology",
                "name": "Tradition"
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 20
            },
            {
                "name": "Range",
                "value": 1
            },
            {
                "name": "Strength",
                "value": 4
            }
        ],
        "specials": [
            "Start size 1"
        ],
        "actions": [
            "Settle"
        ],
        "platforms": [
            {
                "platform": "Human",
                "name": "Tribe"
            }
        ],
        "description": "Ancient tribes were kin-structured groups that founded early sedentary communities. Late Epipaleolithic Natufian bands built hamlets with stone foundations and storage pits. At Jericho, successive layers record a shift to permanent houses, a tower, and ditch. At Çatalhöyük, clustered mudbrick houses formed a dense proto-urban village without streets, accessed by roof ladders. Subsistence mixed cultivation, herding, hunting, and gathering. Ritual spaces, burials within houses, and shared feasts reinforced identity. Exchange moved obsidian, shells, and pigments across regions. Tribal leadership was situational and negotiated. Seasonal gatherings coordinated labor for building, harvest, and defense."
    },
    {
        "name": "Settler",
        "category": "Settler",
        "requires": [
            {
                "type": "technology",
                "name": "Pottery"
            }
        ],
        "upgradesFrom": [
            "Tribe"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 40
            },
            {
                "name": "Range",
                "value": 1
            },
            {
                "name": "Strength",
                "value": 6
            }
        ],
        "specials": [
            "Start size 2"
        ],
        "actions": [
            "Settle"
        ],
        "platforms": [
            {
                "platform": "Human",
                "name": "Settler"
            },
            {
                "platform": "Clinker",
                "name": "Settler Cog"
            }
        ],
        "description": "Bronze Age settlers organized migrations that founded new towns with agricultural surplus. In Anatolia, Early Bronze villages expanded around fortified tells and metalworking precincts. Planned settlements of the Indus Valley laid straight streets, drains, and standardized brick platforms tied to flood regimes. Levantine hill-towns occupied defensible ridges with cisterns and terrace fields. Storage jars, silos, and animal pens secured surplus for trade and tribute. Cult shrines and council buildings formalized local authority. Paths became roads as caravans linked copper, tin, and finished goods. Settler groups combined kin ties with negotiated alliances to secure water, land, and craft skills."
    },
    {
        "name": "Colonist",
        "category": "Settler",
        "requires": [
            {
                "type": "technology",
                "name": "Colonialism"
            }
        ],
        "upgradesFrom": [
            "Settler"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 260
            },
            {
                "name": "Range",
                "value": 1
            },
            {
                "name": "Strength",
                "value": 13
            }
        ],
        "specials": [
            "Start size 3"
        ],
        "actions": [
            "Settle"
        ],
        "platforms": [
            {
                "platform": "Human",
                "name": "Colonist"
            },
            {
                "platform": "Clinker",
                "name": "Colonist Cog"
            },
            {
                "platform": "Carvel",
                "name": "Colonist Caravel"
            }
        ],
        "description": "Renaissance-era colonists sailed under royal or corporate charters to establish overseas settlements. In the Spanish Caribbean they founded towns linked to encomienda labor and mission networks. Portuguese captaincies in Brazil granted hereditary rights to exploit land and brazilwood, later sugar. English ventures at Roanoke and Jamestown tested plantation economy and self-governance under precarious conditions. Forts, churches, and warehouses anchored ports. Disease, warfare, and coerced labor reshaped local populations. Atlantic routes integrated colonies into bullion flows and commodity trades. Colonial assemblies and governors negotiated between metropolitan policy, private profit, and survival."
    },
    {
        "name": "Migrant",
        "category": "Settler",
        "requires": [
            {
                "type": "technology",
                "name": "Universal Suffrage"
            }
        ],
        "upgradesFrom": [
            "Colonist"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 520
            },
            {
                "name": "Range",
                "value": 1
            },
            {
                "name": "Strength",
                "value": 19
            }
        ],
        "specials": [
            "Start size 4"
        ],
        "actions": [
            "Settle"
        ],
        "platforms": [
            {
                "platform": "Human",
                "name": "Migrant"
            }
        ],
        "description": "Industrial-age migrants moved in mass for wages, land, rights, and safety. Steamships and railways enabled transoceanic passages and inland settlement. Through Ellis Island, millions entered the United States to work in factories and mines or to homestead under federal acts. On frontiers, the Homestead Act drew families to claim surveyed plots. Gold rushes in California and Australia pulled global streams of fortune seekers, merchants, and artisans. Migrants formed ethnic associations, mutual aid societies, and neighborhoods. Laws, quotas, and labor conflicts set limits and opportunities. Remittances and chain migration linked sending regions to new industrial economies."
    },
    {
        "name": "Trader",
        "category": "Trader",
        "requires": [
            {
                "type": "technology",
                "name": "Trade"
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 15
            },
            {
                "name": "Range",
                "value": 10
            }
        ],
        "actions": [
            "Trade"
        ],
        "platforms": [
            {
                "platform": "Human",
                "name": "Trader"
            },
            {
                "platform": "Raft",
                "name": " Trade Raft"
            },
            {
                "platform": "Galley",
                "name": "Trade Galley"
            },
            {
                "platform": "Clinker",
                "name": "Trade Cog"
            }
        ],
        "description": "Ancient traders moved goods along short and medium routes by pack animal, riverboat, and coastal craft. In Anatolia and the Levant, itinerant dealers carried obsidian, metals, and textiles between village markets and workshop towns. Along the Nile, barges shifted grain, stone, and luxury items between nomes and royal projects. Across the Gulf, Dilmun merchants served as intermediaries between Mesopotamia and Oman for copper and dates. Traders used weights, seals, and tablets to record transactions. Seasonal fairs, pilgrimages, and caravan watering points structured movement. Their exchanges tied subsistence communities to early state redistributive systems."
    },
    {
        "name": "Merchant",
        "category": "Trader",
        "requires": [
            {
                "type": "technology",
                "name": "Trade Caravans"
            }
        ],
        "upgradesFrom": [
            "Trader"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 120
            },
            {
                "name": "Range",
                "value": 20
            }
        ],
        "actions": [
            "Trade"
        ],
        "platforms": [
            {
                "platform": "Human",
                "name": "Merchant"
            },
            {
                "platform": "Clinker",
                "name": "Merchant Cog"
            },
            {
                "platform": "Carvel",
                "name": "Schooner"
            }
        ],
        "description": "Medieval merchants managed regional and intercontinental exchange through caravans, fairs, and port guilds. They organized camel trains on the Silk Road and linked Baltic and North Sea markets through the Hanseatic League. Contracts, tally sticks, and letters of credit reduced risk. Counting houses tracked weights, measures, and currencies. The law merchant and staple courts provided common procedures. Merchants arranged convoys, hired guards, and rented warehouse space. They moved luxury silks, spices, furs, and salt, but also grain and timber. Trans-Saharan caravans carried gold and salt between Sahelian cities and Mediterranean ports. Their networks connected producers, rulers, and consumers across linguistic and legal boundaries."
    },
    {
        "name": "Capitalist",
        "category": "Trader",
        "requires": [
            {
                "type": "technology",
                "name": "Economics"
            }
        ],
        "upgradesFrom": [
            "Merchant"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 390
            },
            {
                "name": "Range",
                "value": 35
            }
        ],
        "actions": [
            "Trade"
        ],
        "platforms": [
            {
                "platform": "Human",
                "name": "Capitalist"
            },
            {
                "platform": "Carvel",
                "name": "Clipper"
            },
            {
                "platform": "Steamer",
                "name": "Paddle Steamer"
            },
            {
                "platform": "Diesel Hull",
                "name": "Ocean Liner"
            }
        ],
        "description": "Enlightenment-era capitalists financed long-distance trade through joint-stock firms, marine insurance, and professional management. Investors pooled funds in chartered companies such as the Dutch VOC and the British East India Company. Amsterdam and later London stock exchanges priced shares and debt. Capitalists contracted ships, secured monopolies, and built warehouses and forts. They used double-entry accounts and actuarial tables to manage risk. Bills of exchange and discounting linked provincial markets to Atlantic and Indian Ocean circuits. Their activity integrated commodities, from tea and textiles to sugar and tobacco, into global systems. The resulting capital markets underpinned early industrial investment and state finance."
    },
    {
        "name": "Freighter",
        "category": "Trader",
        "requires": [
            {
                "type": "technology",
                "name": "Globalization"
            }
        ],
        "upgradesFrom": [
            "Capitalist"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 490
            },
            {
                "name": "Range",
                "value": 50
            }
        ],
        "actions": [
            "Trade"
        ],
        "platforms": [
            {
                "platform": "Human",
                "name": "Freighter"
            },
            {
                "platform": "Diesel Hull",
                "name": "Container Ship"
            }
        ],
        "description": "Modern freighters move containerized cargo across oceans within tightly scheduled networks. Shipping lines operate large vessels, including Maersk Triple-E class ships, on transpacific and Asia-Europe routes. Standardized boxes allow rapid transfer between ship, rail, and truck. Port cranes, tracking systems, and slot management maintain just-in-time flows. Alliances coordinate capacity and reduce costs. Freighters carry electronics, garments, machinery, and foodstuffs at scale. The system reshaped port geographies and inland logistics hubs. It also exposed supply chains to bottlenecks such as canal closures and pandemic disruptions. By the 2000s, a small number of operators handled most long-haul container traffic."
    },
    {
        "name": "Shaman",
        "category": "Missionary",
        "requires": [
            {
                "type": "technology",
                "name": "Mysticism"
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 15
            }
        ],
        "actions": [
            "Start Mission"
        ],
        "platforms": [
            {
                "platform": "Human",
                "name": "Shaman"
            }
        ],
        "description": "Shamans served as spiritual mediators in ancient and indigenous societies. They used trance, drumming, song, and controlled fasting to contact spirit worlds and diagnose illness. In Siberia, shamans conducted healing rites and soul-retrieval. San communities practiced trance dances that integrated community cohesion with curing. In the Andes before Columbus, specialists mediated between highland communities, ancestors, and local deities. Knowledge passed through apprenticeship and ritual tests. Shamans prescribed taboos, herbal remedies, and protective charms. Their authority rested on performance, visions, and outcomes rather than scriptural canon. The role persisted alongside later religions, often blending with local cults and seasonal ceremonies."
    },
    {
        "name": "Priest",
        "category": "Missionary",
        "requires": [
            {
                "type": "technology",
                "name": "Organized Religion"
            }
        ],
        "upgradesFrom": [
            "Shaman"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 30
            }
        ],
        "actions": [
            "Start Mission"
        ],
        "platforms": [
            {
                "platform": "Human",
                "name": "Priest"
            }
        ],
        "description": "Classical priests administered cults, sacrifices, and festivals within organized communities. In Greek cities, priesthoods managed temple property and rites for civic gods. Roman pontifices and augurs interpreted auspices, oversaw calendars, and guided public ritual. Priests preserved hymns, liturgies, and legal precedents. They trained assistants, maintained sacred precincts, and received offerings. Some provided oracles and divination. With emerging Christianity, ordained leaders preached, baptized, and organized congregations, often under persecution. Priests mediated between laypeople and the divine through prescribed rites. Their records, dedications, and temple accounts provide primary evidence for civic life, patronage, and political authority in the classical Mediterranean."
    },
    {
        "name": "Monk",
        "category": "Missionary",
        "requires": [
            {
                "type": "technology",
                "name": "Fundamentalism"
            }
        ],
        "upgradesFrom": [
            "Priest"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 195
            }
        ],
        "actions": [
            "Start Mission"
        ],
        "platforms": [
            {
                "platform": "Human",
                "name": "Missionary"
            }
        ],
        "description": "Medieval monks pursued ascetic discipline while building durable institutions of faith, learning, and charity. Benedictine and later Cistercian houses spread across Europe, promoting liturgy, reading, and regulated labor. Scriptoria copied texts and preserved classical and theological works. Monasteries cleared land, managed fisheries, and introduced water mills and viticulture. Missionary monks carried Christianity to frontier regions; Saints Cyril and Methodius evangelized Slavic peoples and created the Glagolitic script. In Asia, Buddhist monks traveled to Korea and Japan, founding temples and scholastic lineages. Monastic networks relayed books, relics, and news. Their estates and schools shaped regional economies and elite culture."
    },
    {
        "name": "Preacher",
        "category": "Missionary",
        "requires": [
            {
                "type": "technology",
                "name": "Universal Suffrage"
            }
        ],
        "upgradesFrom": [
            "Monk"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 390
            }
        ],
        "actions": [
            "Start Mission"
        ],
        "platforms": [
            {
                "platform": "Human",
                "name": "Preacher"
            }
        ],
        "description": "Twentieth-century preachers used mass media to expand evangelism beyond local pulpits. Revivalists organized tent meetings, stadium crusades, and citywide campaigns. Figures such as Billy Graham leveraged radio, film, and television to reach national audiences. Periodicals, tract ministries, and mail-order courses supported follow-up and fundraising. Urbanization and new sound systems enabled large gatherings. Pentecostal and Holiness movements emphasized healing services and personal conversion. Preachers built parachurch organizations, colleges, and broadcast networks. Their message circulated through records and later satellite feeds. The model influenced politics, philanthropy, and global missions, especially in the Americas, Africa, and South Korea."
    },
    {
        "name": "Emissary",
        "category": "Diplomat",
        "requires": [
            {
                "type": "technology",
                "name": "Warfare"
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 15
            }
        ],
        "actions": [
            "Start Mission"
        ],
        "platforms": [
            {
                "platform": "Human",
                "name": "Emissary"
            }
        ],
        "description": "Bronze Age emissaries carried sealed letters, gifts, and proposals between rival courts. The Amarna correspondence shows great kings addressing each other as peers in Akkadian cuneiform. Emissaries negotiated marriages, truces, and access to trade routes. They relied on safe-conducts, escorts, and oath rituals. Protocol governed seating, gift sizes, and ceremonial greetings. After the battle of Kadesh, Hittite and Egyptian officials forged a formal treaty and exchanged envoys to maintain terms. Assyrian missions extracted tribute and reaffirmed vassal obligations. Emissaries reported intelligence on court factions, troop counts, and local conditions, shaping policy in palatial centers."
    },
    {
        "name": "Envoy",
        "category": "Diplomat",
        "requires": [
            {
                "type": "technology",
                "name": "Democracy"
            }
        ],
        "upgradesFrom": [
            "Emissary"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 68
            }
        ],
        "actions": [
            "Start Mission"
        ],
        "platforms": [
            {
                "platform": "Human",
                "name": "Envoy"
            }
        ],
        "description": "Classical envoys acted as temporary representatives in leagues, empires, and federations. Athenian envoys spoke before assemblies and councils during the Peloponnesian conflicts. Roman senatorial legati accompanied commanders, delivered ultimatums, and arranged surrenders or alliances. Hellenistic city-states sent delegations to arbitrate disputes and to renew treaties. Envoys claimed limited immunity under custom and religion. Oratorical skill, genealogy, and prestige influenced outcomes. Hostages, oaths, and boundary stones secured agreements. Reports from envoys informed councils about enemy intentions and logistics. Their work linked diplomacy with military movements and interstate law in the Mediterranean world."
    },
    {
        "name": "Ambassador",
        "category": "Diplomat",
        "requires": [
            {
                "type": "technology",
                "name": "Trade Caravans"
            }
        ],
        "upgradesFrom": [
            "Envoy"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 120
            }
        ],
        "actions": [
            "Start Mission"
        ],
        "platforms": [
            {
                "platform": "Human",
                "name": "Ambassador"
            }
        ],
        "description": "Medieval ambassadors emerged as resident agents who managed continual relations between courts. Italian city-states pioneered permanent legations; Venetian ambassadors filed detailed relazioni after service in Ottoman and European capitals. Byzantine missions combined ceremony, gifts, and theological debate. Papal legates negotiated investiture, marriage dispensations, and crusading appeals. Ambassadors sought safe-conducts, extraterritorial rights, and trade capitulations. They cultivated informants and wrote coded dispatches. Immunities and precedence rules formed the basis of later diplomatic law. By the late Middle Ages, many rulers maintained standing embassies to monitor rivals, protect merchants, and manage privileges for diaspora communities."
    },
    {
        "name": "Diplomat",
        "category": "Diplomat",
        "requires": [
            {
                "type": "technology",
                "name": "Diplomacy"
            }
        ],
        "upgradesFrom": [
            "Ambassador"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 270
            }
        ],
        "actions": [
            "Start Mission"
        ],
        "platforms": [
            {
                "platform": "Human",
                "name": "Diplomat"
            }
        ],
        "description": "The Renaissance diplomat emerged as a permanent envoy stationed at foreign courts. Italian city-states pioneered resident embassies to manage shifting alliances and trade privileges. Venice maintained a dense network and regular dispatches. Protocol, ceremonial precedence, and diplomatic immunity took shape. Ambassadors used ciphered letters, couriers, and negotiation memos. They gathered political and military intelligence while arranging treaties and marriages. Papal legations mediated between secular princes and the Church. Notable cases include Venetian residents at the Ottoman Porte and missions among Italian rivals. Treatises by Guicciardini and Machiavelli reflected the craft’s pragmatic ethos and the balance-of-power logic born in Italy."
    },
    {
        "name": "Thief",
        "category": "Spy",
        "requires": [
            {
                "type": "technology",
                "name": "Trade"
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 15
            }
        ],
        "actions": [
            "Start Mission"
        ],
        "platforms": [
            {
                "platform": "Human",
                "name": "Thief"
            }
        ],
        "description": "Urban growth in Renaissance Europe fostered a class of professional thieves. Cutpurses worked crowded venues such as Elizabethan theaters and city processions. Markets and seasonal fairs drew pickpockets who moved in bands. In Tudor–Stuart England, canting jargon aided secrecy and recruitment. Thieves targeted purses, clothing, and small luxury goods that could be fenced quickly. Authorities answered with watchmen, gallows statutes, and public punishments. Printed rogue literature both glamorized and documented techniques. London Bridewell records and court cases show networks spanning taverns and lodging houses. The trade adapted to new fashions like slashed garments and concealed pouches."
    },
    {
        "name": "Courtier",
        "category": "Spy",
        "requires": [
            {
                "type": "technology",
                "name": "Divine Right"
            }
        ],
        "upgradesFrom": [
            "Thief"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 120
            }
        ],
        "actions": [
            "Start Mission"
        ],
        "platforms": [
            {
                "platform": "Human",
                "name": "Courtier"
            }
        ],
        "description": "The Enlightenment courtier combined social grace with political utility. Proximity to monarchs turned access into intelligence. At Versailles under Louis XV, patronage, salons, and correspondence channeled information. Madame de Pompadour maintained circles that relayed diplomatic news and shaped appointments. Courtiers tracked foreign envoys, intercepted letters, and seeded rumors. During Jacobite intrigues, informants at courts in Paris and London relayed plans to ministers. Gifts, pensions, and offices rewarded cooperation. Court police monitored libels and scandal sheets that influenced reputation. Though formal ministries expanded, intimate knowledge of audiences, routines, and favor remained decisive. The courtier’s value lay in doors opened rather than documents seized."
    },
    {
        "name": "Gentleman",
        "category": "Spy",
        "requires": [
            {
                "type": "technology",
                "name": "Diplomacy"
            }
        ],
        "upgradesFrom": [
            "Courtier"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 270
            }
        ],
        "actions": [
            "Start Mission"
        ],
        "platforms": [
            {
                "platform": "Human",
                "name": "Gentleman"
            }
        ],
        "description": "In the industrial era, the “gentleman” operative drew on education, travel, and private means. Before full professionalization, British and imperial networks used clubland contacts and scientific covers. During the Great Game, gentlemen mapped passes in Central Asia, learned local languages, and tested frontiers. Special Branch and colonial services recruited planters, magistrates, and surveyors as informants. Reports mixed social observation with logistics and terrain notes. Public schools and Oxbridge supplied shared codes of trust but also class blind spots. By the early twentieth century, emerging security services formalized tradecraft, yet still relied on gentleman amateurs for introductions, safe houses, and discreet influence overseas."
    },
    {
        "name": "Spy",
        "category": "Spy",
        "requires": [
            {
                "type": "technology",
                "name": "Radio"
            }
        ],
        "upgradesFrom": [
            "Gentleman"
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 390
            }
        ],
        "actions": [
            "Start Mission"
        ],
        "platforms": [
            {
                "platform": "Human",
                "name": "Spy"
            }
        ],
        "description": "The twentieth-century spy was a trained professional using radios, ciphers, and covert techniques. World War II agencies such as SOE and OSS built schools for sabotage, wireless, and disguise. Agents in occupied Europe ran cells, maintained dead drops, and used one-time pads. Signals work supported field operations through codebreaking, as at Bletchley Park. The Cold War expanded tradecraft to long-term illegals, microdots, and surveillance detection routes. Penetrations like the Cambridge Five exposed vulnerabilities of trust-based recruitment. Legal covers ranged from diplomatic postings to journalism. Modern intelligence fused human and signals sources, with compartmentalization, vetting, and technical support. Risk remained high, from radio triangulation to counterintelligence stings."
    }
]
