[
    {
        "name": "Mbuti",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Congo"
            }
        ],
        "category": "Major",
        "description": "The Mbuti are forest foragers of the Ituri in the Congo Basin, with cultural continuity from the early Holocene. Archaeology shows long use of microlithic tools and dispersed camp sites adapted to dense rainforest. Mbuti society is organized in small, flexible bands with egalitarian decision-making and authority based on age, skill, and ritual knowledge. Subsistence centers on net hunting, trapping, gathering wild yams, mushrooms, and honey, and seasonal mobility. Barkcloth clothing, polyphonic singing, and ceremonies such as the molimo maintain social cohesion and relations with the forest.\nFrom the late first millennium CE, the Mbuti developed exchange with incoming Bantu-speaking farmers. They traded meat, honey, and forest products for iron blades, pots, and salt, while maintaining autonomy in forest zones. Colonial labor demands, conservation regimes, and recent conflicts disrupted access to lands, yet the Mbuti retained advanced ecological knowledge and resilient social networks tied to river corridors and long-term partners on the forest margins."
    },
    {
        "name": "Bantu",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Congo"
            }
        ],
        "upgradesFrom": [
            "Mbuti"
        ],
        "category": "Major",
        "description": "Bantu-speaking communities expanded from the Nigeria–Cameroon borderlands into the Congo Basin between the first millennium BCE and the first millennium CE. They carried iron smelting, woodworking, and farming systems based on yams, oil palm, and, later, banana and plantain. In the forests they founded riverine villages, used dugout canoes for transport, and practiced shifting cultivation with iron hoes and axes that opened mosaics of fields and fallows.\nBy the late first millennium CE, stable lineage-based chiefdoms emerged. Local pottery traditions and iron industries spread along tributaries of the Congo River. Exchange linked farmers with autochthonous foragers such as the Mbuti through clientage and reciprocity. Copper, salt, raffia cloth, and smoked fish moved on canoe routes. This technological and demographic base enabled the rise of larger polities in both the western lowlands and the south-central lakes region, setting conditions for formations such as Mpemba Kasi and, inland, later Luba statecraft."
    },
    {
        "name": "Mpemba Kasi",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Congo"
            }
        ],
        "upgradesFrom": [
            "Bantu"
        ],
        "category": "Major",
        "description": "Mpemba Kasi was a Kikongo-speaking polity on the plateau of the lower Congo region before the fifteenth century. Oral traditions record Mwene (lord) Mpemba Kasi as head of one of several neighboring countries around Mbanza Kongo. In the fourteenth century, a leader from Mpemba Kasi, Lukeni lua Nimi, forged alliances and conquests—especially with Mbata—that created the Kingdom of Kongo. The early Kongo ruling house, the Kilukeni, drew institutions, lineages, and ritual from this Mpemba Kasi core.\nEconomically, Mpemba Kasi’s farmers cultivated millet and root crops, produced raffia cloth, and worked iron. Roads and messenger networks linked hilltop capitals to river ports that later handled traffic with the Atlantic at Mpinda. Administrative practices developed in Mpemba Kasi—provincial organization and tribute—became templates for Kongo governance. Through this transition, the polity supplied the personnel and political architecture that integrated the lower Congo into wider regional and, after 1483, Atlantic circuits."
    },
    {
        "name": "Luba",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Congo"
            }
        ],
        "upgradesFrom": [
            "Mpemba Kasi"
        ],
        "category": "Major",
        "description": "The Luba emerged in the Upemba Depression of south-central Congo, where lacustrine villages developed complex metallurgy and trade from the first millennium CE. By the fourteenth century a centralized sacral kingship (balopwe) formed, remembered in traditions of Nkongolo and Kalala Ilunga. Royal authority rested on ritual legitimacy, control of iron and copper production, and a network of chiefs integrated by marriage, initiation, and court diplomacy. Lukasa memory boards, court stools, and figure sculpture encoded history and office.\nFrom the fifteenth to nineteenth centuries the Luba political model spread across the savannas, shaping Luba-Lunda states and caravan routes carrying copper, iron, salt, beads, and ivory between the Congo Basin, the Zambezi watershed, and Indian Ocean entrepôts. In the nineteenth century Zanzibari-linked raiding and internal rivalries fragmented the realm. Under the Congo Free State and Belgian rule, Luba lands were drawn into mining and forced labor. Despite disruption, Luba arts, mnemonic systems, and chieftaincy structures endured and influenced regional identities into the colonial and postcolonial eras."
    },
    {
        "name": "Congo",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Congo"
            }
        ],
        "upgradesFrom": [
            "Luba"
        ],
        "category": "Major",
        "description": "The modern state of Congo descends from the Congo Free State (1885–1908), a personal colony of Leopold II marked by violent rubber extraction, and the Belgian Congo (1908–1960), which built railways, mining centers in Katanga, and ports at Matadi, Léopoldville, and Elisabethville. Independence in 1960 brought the Congo Crisis, with Katanga and South Kasai secessions, UN intervention, and the assassination of Patrice Lumumba. Joseph-Désiré Mobutu seized power in 1965, renamed the country Zaire in 1971, promoted state corporatism, and presided over economic decline.\nIn 1996–1997 the AFDL toppled Mobutu. The Second Congo War (1998–2003) drew in multiple states and armed groups. A peace process led to elections and the Democratic Republic of the Congo name. Since 2006 the country has pursued reconstruction while facing persistent conflict in the east. The DRC is now the world’s leading source of cobalt and a major copper producer, holds vast rainforest and hydropower potential at Inga, and sustains major cultural industries such as Congolese rumba. Governance and security reforms continue amid regional diplomacy and conservation initiatives."
    },
    {
        "name": "Kush",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Ethiopia"
            }
        ],
        "category": "Major",
        "description": "The Kingdom of Kush arose from the earlier Kerma culture in Nubia, between the First and Sixth Cataracts of the Nile. After New Kingdom Egypt withdrew, a Napatan monarchy consolidated power in the 9th–8th centuries BCE and formed the Twenty-Fifth Dynasty that ruled Egypt c. 747–656 BCE. Kushite kings promoted Amun cults, built pyramids and temples, and managed long-distance trade along the Nile and across the eastern desert.\n\nFrom the 4th century BCE the political center shifted to Meroe. There, large-scale iron smelting, agriculture, and caravan trade supported a durable state. The Meroitic script emerged by the 2nd century BCE, one of Africa’s earliest alphasyllabaries. Kush engaged Ptolemaic and Roman Egypt, fought Rome in 24–21 BCE, and secured a favorable treaty. Environmental stress and trade realignment weakened Meroe in the 3rd–4th centuries CE. Campaigns by Aksumite rulers against Nubian polities contributed to the final collapse. The region’s commerce and statecraft linked the Nile world to the Red Sea routes later used by Aksum."
    },
    {
        "name": "Aksum",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Ethiopia"
            }
        ],
        "upgradesFrom": [
            "Kush"
        ],
        "category": "Major",
        "description": "The Kingdom of Aksum rose in the northern Ethiopian and Eritrean highlands in the first centuries CE. Its port at Adulis connected the interior to Red Sea and Indian Ocean trade. Aksum exported ivory, gold, and agricultural products, and imported glassware and textiles. The state minted gold, silver, and bronze coins with legends in Greek and Geʽez, evidencing far-reaching commerce.\n\nMonumental stelae marked elite tombs, and the Geʽez script matured in royal and ecclesiastical use. Under King Ezana, c. 330 CE, Aksum adopted Christianity through the mission of Frumentius. The kingdom projected power across the Red Sea. In the early 6th century King Kaleb intervened in South Arabia against the Himyarite kingdom. From the 7th century, shifts in Red Sea trade, soil exhaustion, and political competition reduced Aksum’s reach. Power migrated toward the highlands of Lasta and Shewa, where new elites sustained Christian institutions and prepared the ground for the Zagwe."
    },
    {
        "name": "Zagwe",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Ethiopia"
            }
        ],
        "upgradesFrom": [
            "Aksum"
        ],
        "category": "Major",
        "description": "The Zagwe dynasty governed much of the northern Ethiopian highlands in the 12th and 13th centuries. Its rulers, likely of Agaw origin, established their capital in Lasta. They patronized monastic communities and consolidated a Christian kingdom after the decline of Aksum. King Lalibela is credited with commissioning the rock-hewn churches of Roha (Lalibela), a complex that embodies advanced quarrying, planning, and liturgical design.\n\nZagwe administrations supported terraced agriculture and managed caravan links to Muslim merchants toward the Red Sea. Ties with the Coptic Patriarchate in Egypt maintained ecclesiastical succession. Zagwe legitimacy rested on sanctity and stewardship rather than Solomonic descent. Around 1270, Yekuno Amlak deposed the dynasty and restored a Solomonic line. That transition created the political framework later known as Abyssinia."
    },
    {
        "name": "Abyssinia",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Ethiopia"
            }
        ],
        "upgradesFrom": [
            "Zagwe"
        ],
        "category": "Major",
        "description": "Abyssinia denotes the Solomonic Ethiopian state from 1270 to the 19th century. Yekuno Amlak claimed descent from the Aksumite kings and expanded royal authority over Amhara, Tigray, and Shewa. The court relied on the Ethiopian Orthodox Tewahedo Church and the Geʽez literary tradition. Abyssinia fought the Muslim sultanates of Ifat and Adal. The campaigns of Ahmad ibn Ibrahim al-Ghazi in 1529–1543 devastated the highlands until joint Ethiopian and Portuguese forces reversed his gains. Oromo migrations reshaped demography and military organization.\n\nJesuit missions in the 16th–17th centuries culminated in Emperor Susenyos’s short-lived conversion to Catholicism. Fasilides restored Orthodoxy and founded Gondar as a capital. The 17th–18th centuries saw castle building, mural painting, and codification of court ritual. From the 1760s the Zemene Mesafint fractured central power among regional nobles. Warfare among Tigray, Gojjam, and Shewa magnates persisted until Kassa Hailu prevailed as Tewodros II in 1855, inaugurating modern state consolidation."
    },
    {
        "name": "Ethiopia",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Ethiopia"
            }
        ],
        "upgradesFrom": [
            "Abyssinia"
        ],
        "category": "Major",
        "description": "Modern Ethiopia took shape under Tewodros II, who pursued centralization, new armaments, and judicial change. Yohannes IV defended the state against Egyptian and Mahdist wars. Menelik II expanded the empire to the south and east, founded Addis Ababa, and began modernization. In 1896 Ethiopian forces defeated Italy at Adwa, securing international recognition and treaty revision. Haile Selassie advanced state reform and issued constitutions in 1931 and 1955. Italy invaded in 1935. Occupation lasted to 1941, when Allied operations and Ethiopian resistance restored independence.\n\nPostwar policy combined development with assertive diplomacy; Addis Ababa became headquarters of the Organization of African Unity in 1963. Economic strain and unrest culminated in the 1974 revolution. The Derg abolished the monarchy, nationalized land, and fought insurgencies; repression and famine followed. The EPRDF seized power in 1991 and created a federal republic. Eritrea achieved independence in 1993. Growth accelerated in the 2000s, with major infrastructure and the Grand Ethiopian Renaissance Dam. Since 2018, political opening and conflict have coincided, including peace with Eritrea and the 2020–2022 Tigray war. Ethiopia remains central to African Union affairs."
    },
    {
        "name": "Berbers",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Morocco"
            }
        ],
        "category": "Major",
        "description": "The Berbers (Amazigh\/Imazighen) are the indigenous peoples of the Maghreb, from the Atlantic to the Siwa Oasis. Archaeology traces deep roots through the Iberomaurusian (c. 20,000–9,000 BCE) and Capsian (c. 9,000–4,000 BCE) cultures. A humid Sahara supported pastoralists; after aridification c. 3000 BCE, transhumant herding and oasis settlements expanded. Proto-Berber languages spread across the Atlas and coast. Communities built megaliths, carved rock art, and adopted metallurgy in the first millennium BCE.\n\nPhoenician and Carthaginian contact produced emporia at Lixus, Tingis, and Sala. Berber chieftains formed kingdoms such as Numidia and Mauretania, known for cavalry and light infantry. Caravan routes linked oases across the Sahara. Libyco-Berber scripts appeared, and elites engaged in Mediterranean trade. Religious life blended local cults with Punic and later Roman forms. These social and economic structures underpinned the rise of classical Mauretania and framed the later Islamic conquests and dynasties."
    },
    {
        "name": "Mauretania",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Morocco"
            }
        ],
        "upgradesFrom": [
            "Berbers"
        ],
        "category": "Major",
        "description": "Mauretania was a Berber kingdom of the western Maghreb, stretching from the Atlantic to the Mulucha River. The Mauri elite interacted with Carthage and Rome. Bocchus I allied with Rome in the Jugurthine War (112–105 BCE). Under Juba II (r. c. 25 BCE–23 CE), a Roman client, the realm adopted Hellenistic arts and administrative norms. Juba II and Cleopatra Selene promoted urban development and maritime trade.\n\nIn 40 CE, after the assassination of Ptolemy of Mauretania, Rome annexed the kingdom and created Mauretania Tingitana (capital Tingis) and Caesariensis (capital Caesarea). Volubilis, Lixus, and Sala Colonia prospered with olive cultivation, fish-salting, and new roads. Latin, Punic, and Berber languages coexisted; Christianity spread by late antiquity. From the 5th century, Vandal and later Byzantine control held mainly along coasts, while Berber federations dominated the interior. These formations preserved autonomy and military capacity that shaped early Islamic expansion and later Almoravid and Almohad states."
    },
    {
        "name": "Almohad",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Morocco"
            }
        ],
        "upgradesFrom": [
            "Mauretania"
        ],
        "category": "Major",
        "description": "The Almohad movement arose among Masmuda Berbers of the High Atlas in the early 12th century. Ibn Tumart preached strict monotheism and moral reform; his disciple Abd al-Mu’min built a state that seized Marrakesh in 1147 and replaced the Almoravids. The Almohad Caliphate unified most of the Maghreb and al-Andalus, projecting power from Seville to Tunis. It centralized authority, restructured taxation, and fielded capable armies and fleets.\n\nRulers such as Ya‘qub al-Mansur patronized scholars and builders. Major monuments include the Koutoubia Mosque, the Giralda, and the Hassan Tower. Administrative centers grew at Marrakesh, Rabat, and Seville; commerce linked Maghrebi ports with Iberia and the eastern Mediterranean. After defeat at Las Navas de Tolosa (1212), the state fragmented. In Morocco the Marinids, then Wattasids and Saadians, succeeded them, while Hafsids took Ifriqiya. Almohad institutions and urban growth set conditions for the later rise of the Alawi rulers."
    },
    {
        "name": "Alawi",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Morocco"
            }
        ],
        "upgradesFrom": [
            "Almohad"
        ],
        "category": "Major",
        "description": "Also known as the Alaouite Dynasty, the Alawi house emerged in the Tafilalt oasis during the 17th century, claiming sharifian descent. Moulay al-Rashid unified much of Morocco by 1666. His successor Moulay Isma‘il (1672–1727) consolidated power with a standing army, forts, and a new capital at Meknes. The state secured frontiers against Ottoman Algeria and Iberian enclaves and negotiated treaties with England, France, and the Dutch Republic. Privateering and commerce linked Atlantic and Mediterranean ports to interior markets.\n\nEighteenth-century rulers balanced tribal coalitions and urban elites. Sidi Mohammed ben Abdallah founded Essaouira to channel foreign trade. In the 19th century, defeats at Isly (1844) and in the Tetuan War (1859–60) exposed military weakness. Sultan Hassan I pursued administrative and military reform amid rising European influence. The Madrid (1880) and Algeciras (1906) conferences codified foreign privileges. Mounting crises led to the 1912 Treaty of Fes and the French and Spanish protectorates, under which the dynasty persisted as the sovereign institution."
    },
    {
        "name": "Morocco",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Morocco"
            }
        ],
        "upgradesFrom": [
            "Alawi"
        ],
        "category": "Major",
        "description": "Morocco entered the 20th century under French and Spanish protectorates (1912–1956). Resistance included the Rif War led by Abdelkrim al-Khattabi (1921–1926). Sultan Mohammed V’s support for independence led to his exile in 1953 and return in 1955. The kingdom regained sovereignty in 1956, incorporating Tangier and later Ifni (1969). Hassan II reigned from 1961, centralizing authority and facing unrest and coup attempts. The Green March (1975) asserted claims over Western Sahara; conflict with the Polisario Front produced a 1991 ceasefire that remains unresolved.\n\nSince 1999, King Mohammed VI has pursued cautious political opening and economic modernization. A truth commission reviewed past abuses. The 2011 constitution expanded parliamentary powers and recognized Amazigh as an official language. Infrastructure projects include Tanger-Med port, Al Boraq high-speed rail, and renewable energy complexes such as Noor Ouarzazate. Automotive, aerospace, and phosphate industries anchor exports; tourism and agriculture remain vital. Foreign policy emphasizes ties with the EU and United States, return to the African Union (2017), and regional mediation. Contemporary challenges include youth employment, water stress, and the Western Sahara question, alongside rapid urban growth and social programs."
    },
    {
        "name": "Nok",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Nigeria"
            }
        ],
        "category": "Major",
        "description": "Active between about 1000 BCE and 300 CE in the Jos Plateau and Kaduna regions of present-day Nigeria, the Nok culture is known for early ironworking and a striking terracotta tradition. Excavations at sites such as Taruga attest to bloomery smelting by the first millennium BCE. Settlement mounds yield fragments of coil-built terracottas with elaborate headdresses and perforated eyes, alongside grinding stones, tuyeres, and iron tools.\n\nNok communities farmed pearl millet and exploited oil palm, supplemented by hunting and limited cattle keeping. They sat within savanna–forest trade corridors that moved stone, ores, and finished goods. Ceramic styles and iron technology show internal development with broad regional links rather than direct ancestry to later states. By the third century CE many sites were abandoned, likely due to shifting rainfall, soil depletion, or social reorganization. The technical base and craft specialization of Nok set a precedent for later iron economies in the Middle Niger and forest zones."
    },
    {
        "name": "Ghana",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Nigeria"
            }
        ],
        "upgradesFrom": [
            "Nok"
        ],
        "category": "Major",
        "description": "The Ghana Empire (Wagadu) emerged among Soninke speakers in the upper Senegal–Niger region by the sixth century CE. Its kings, styled Kaya Maghan, ruled from a capital recalled as Koumbi Saleh, a dual town with a royal quarter and a Muslim mercantile quarter. The state taxed trans-Saharan caravans moving gold, salt, and textiles between the Sahel and Maghrib, drawing revenue from the Bambuk goldfields and from market duties.\n\nIslam spread among traders and parts of the court while indigenous law and ritual framed kingship. Cavalry and fortified settlements anchored authority over tributary provinces. Contacts with the Almoravids in the eleventh century were significant, but their role in the empire’s decline is contested. Environmental stress, trade realignments, and pressure from Sosso polities eroded power in the twelfth century. By the early thirteenth century Ghana fragmented, creating the political landscape on which Sundiata and the Mandinka built the Mali Empire."
    },
    {
        "name": "Mali",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Nigeria"
            }
        ],
        "upgradesFrom": [
            "Ghana"
        ],
        "category": "Major",
        "description": "Founded in the early thirteenth century by Sundiata Keita after victory over the Sosso at Kirina, the Mali Empire united Mandinka lineages and secured the upper and middle Niger. A council of nobles and appointed governors (farbas) oversaw provinces. Control of the Bure and Bambuk goldfields, salt from Taghaza, and customs on river and desert routes financed a standing army and garrisons.\n\nUnder Mansa Musa (r. c. 1312–1337), Mali projected power across the Sahel. His pilgrimage to Cairo and Mecca established diplomatic ties and patronage for mosques, madrasas, and scholars in cities such as Timbuktu and Gao. Djenné and Timbuktu flourished as nodes of trade and Islamic learning, with manuscript culture rooted in Maliki jurisprudence. From the mid-fourteenth century, succession disputes, Tuareg and Mossi raids, and Songhai expansion weakened central control. Timbuktu fell to the Tuareg in the 1430s, then to Songhai in 1468. Mali persisted as a reduced kingdom into the seventeenth century before Bamana pressures reshaped the middle Niger."
    },
    {
        "name": "Songhai",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Nigeria"
            }
        ],
        "upgradesFrom": [
            "Mali"
        ],
        "category": "Major",
        "description": "The Songhai Empire consolidated power in the fifteenth century after centuries of Gao’s intermittent independence under Mali. Sunni Ali (r. 1464–1492) expanded control with cavalry and a river fleet, capturing Timbuktu in 1468 and Djenné in 1473 to secure the Niger’s trade. He subdued Tuareg raiders, checked Mossi incursions, and integrated diverse territories through provincial governors. His successor Askia Muhammad (r. 1493–1528) restructured taxation, standardized measures, and expanded Islamic administration. Timbuktu became a renowned center of Maliki law and scholarship, with manuscript collections at Sankore and private libraries. Songhai armies extended influence into Hausaland, Agadez, and the western Sudan, tying Sahelian agriculture to Saharan commerce. After 1550, succession disputes, Moroccan musketeers, and shifting trade patterns eroded authority. The Moroccan invasion of 1591 shattered central rule, but successor states across Niger and Hausaland preserved commercial systems and Islamic scholarship that bridged Songhai’s legacy into later northern Nigerian polities."
    },
    {
        "name": "Nigeria",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Nigeria"
            }
        ],
        "upgradesFrom": [
            "Mali"
        ],
        "category": "Major",
        "description": "In the centuries following Songhai’s decline, the Niger basin sustained dynamic states and networks. Hausa city-states such as Kano, Katsina, and Zaria prospered as textile and craft centers, linking Saharan caravans with southern products, while Kanem-Bornu controlled Lake Chad and projected cavalry power under rulers like Idris Alauma. In the southwest, Yoruba kingdoms including Oyo and Ife developed cavalry, palace systems, and town confederacies, while Benin expanded in forested zones with bronze casting and long-distance trade. The Sokoto jihad (1804–1808) established a vast caliphate governing northern Nigeria under Islamic law, while Niger Delta city-states like Bonny and Calabar grew wealthy on palm oil exports after the abolition of the slave trade. British annexation of Lagos in 1861 and inland campaigns consolidated colonial rule, and amalgamation in 1914 created Nigeria as a single unit. Independence in 1960 was followed by republican government, coups, and the Biafra civil war (1967–1970). Oil revenues after 1973 accelerated urbanization but entrenched corruption and regional disparity. Since the return of civilian rule in 1999, Nigeria has remained Africa’s most populous state, a major oil producer, and a global hub of media and culture, while facing persistent insurgencies and infrastructural challenges."
    },
    {
        "name": "Hopewell",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "Canada"
            }
        ],
        "category": "Major",
        "description": "The Hopewell tradition flourished in the Ohio and Great Lakes regions c. 100 BCE–500 CE. Communities built earthen mounds and vast geometric earthworks used for mortuary rites and periodic gatherings. Long-distance exchange moved obsidian from the Rockies, copper from the Great Lakes, mica from Appalachia, and marine shells inland. Dispersed hamlets relied on riverine fisheries, foraging, and small gardens. Craft specialists produced fine ceramics, carved stone pipes, and copper ornaments that circulated within ritual gift systems.\nThe tradition waned after the 5th century because of social reorganization and climate variability. Its earthworks and travel corridors remained embedded in the landscape. Later Algonquian- and Iroquoian-speaking peoples in the St. Lawrence and upper Great Lakes encountered these sites and reused interior routes that linked forests to the coasts."
    },
    {
        "name": "Algonquin",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "Canada"
            }
        ],
        "upgradesFrom": [
            "Hopewell"
        ],
        "category": "Major",
        "description": "The Algonquin (Anicinàbeg) are an Algonquian-speaking people centered on the Ottawa River watershed. Before European contact, they practiced seasonal mobility between riverine fishing sites, hunting territories, and sugar bushes. Birchbark canoes, wigwams, and durable hide technologies supported efficient travel. They operated as intermediaries along north–south routes between the St. Lawrence, the Laurentian Shield, and James Bay, tapping older Woodland exchange corridors.\nFrench explorers met Algonquin leaders in the early 1600s. Alliances with Wendat and the French drew them into warfare with the Haudenosaunee. Epidemics, displacement, and the fur trade reshaped communities in the 17th–18th centuries. In the 19th century, timber extraction and settlement pressed into the Ottawa valley; missions and schools altered lifeways. Unlike many Plains and Subarctic nations, most Algonquin groups did not sign the Numbered Treaties. Contemporary communities in Quebec and Ontario pursue land claims and self-government, including the Algonquin of Ontario process, while reviving language and stewardship on the Kichi Sìbì."
    },
    {
        "name": "Iroquois",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "Canada"
            }
        ],
        "upgradesFrom": [
            "Algonquin"
        ],
        "category": "Major",
        "description": "The Haudenosaunee (Iroquois) Confederacy formed in the late precontact era, uniting the Mohawk, Oneida, Onondaga, Cayuga, and Seneca under the Great Law of Peace; the Tuscarora joined in the early 18th century. Longhouse villages, fortified towns, and maize–bean–squash agriculture anchored a dense population in what is now New York and southern Ontario. In the 17th century they fought the Beaver Wars against Algonquin- and Wendat-allied groups, then balanced Dutch, French, and English interests through diplomacy such as the Covenant Chain.\nThe American Revolution split councils; British-aligned nations migrated to Upper Canada and settled along the Grand River and Bay of Quinte. The 19th–20th centuries brought land cessions, pressures on traditional governance, and missionary schools, yet confederacy institutions persisted. In the late 20th century, land-rights actions by Mohawk and other nations asserted treaty and title claims. Today Haudenosaunee communities straddle the US–Canada border, maintain councils, and engage in cross-border trade, cultural renewal, and legal negotiations."
    },
    {
        "name": "Cree",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "Canada"
            }
        ],
        "upgradesFrom": [
            "Iroquois"
        ],
        "category": "Major",
        "description": "The Cree (Nêhiyawak, including Swampy, Woodland, and Plains divisions) are an Algonquian-speaking people whose early heartland lay around James and Hudson Bays. After 1670, ties with the Hudson’s Bay Company accelerated westward expansion as trappers, hunters, and middlemen. Plains Cree adopted horses and participated in bison economies and pemmican trade, allied at times with Assiniboine and Métis and contending with Blackfoot nations. James Evans adapted syllabics for Cree in the 1840s, enabling rapid literacy.\nNumbered Treaties (notably 4, 6, 8) and the reserve and residential school systems reshaped communities in the 19th–20th centuries. The 1885 crisis involved leaders such as Big Bear. Modern agreements mark a major turn: the James Bay and Northern Quebec Agreement (1975) and subsequent accords created the Cree Nation Government and regional co-management in Eeyou Istchee. Today Cree nations span Quebec to Alberta, assert language vitality, and negotiate roles in forestry, mining, and energy. Court-backed rights, impact-benefit agreements, and cultural education frame contemporary governance."
    },
    {
        "name": "Canada",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "Canada"
            }
        ],
        "upgradesFrom": [
            "Cree"
        ],
        "category": "Major",
        "description": "Canada formed through French and British imperial phases and later federation. New France grew from 16th–18th century fisheries and the St. Lawrence fur trade, built on alliances with Innu, Algonquin, Wendat, and later Cree networks. Britain gained the colony in 1760; the Quebec Act and Loyalist migrations shaped early institutions. Confederation in 1867 joined Ontario, Quebec, New Brunswick, and Nova Scotia, followed by westward expansion, the Canadian Pacific Railway, and treaty-making tied to prairie settlement. The Indian Act and residential schools imposed coercive assimilation.\nCanada developed parliamentary autonomy through the Statute of Westminster (1931), fought in both World Wars, and patriated its Constitution with the Charter of Rights (1982). Multicultural and bilingual policies, the creation of Nunavut (1999), and court decisions on Aboriginal rights reframed governance. The Truth and Reconciliation Commission (2015) and UNDRIP implementation guide current policy. Today Canada is a G7 economy balancing resource development, climate commitments, and immigration with Indigenous self-government and land claims involving Haudenosaunee, Algonquin, Cree, and many others."
    },
    {
        "name": "Ciboney",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "Cuba"
            }
        ],
        "category": "Major",
        "description": "The Ciboney, identified by Spanish sources as Guanahatabey in western Cuba, were preceramic foragers whose lifeways span the Caribbean Archaic Age into early colonial times. Archaeology places their core in Pinar del Río, Isla de la Juventud, and adjacent coasts. They lived in small, mobile bands, exploited marine shallows, and left extensive shell middens and cave occupations. Toolkits were dominated by lithic flakes and shell implements. Pottery and intensive agriculture are absent from their sites.\n\nFrom the late first millennium BCE, ceramic-bearing agriculturalists of Arawakan origin reached Cuba. In the west the Ciboney persisted in ecological niches and maintained distinct traditions. Some groups were absorbed by incoming villagers; others retreated to less accessible coasts. At European contact they still occupied parts of western Cuba, but disease, displacement, and labor drafts led to their rapid decline. Their deep coastal knowledge informed later Cuban subsistence and place-names."
    },
    {
        "name": "Arawak",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "Cuba"
            }
        ],
        "upgradesFrom": [
            "Ciboney"
        ],
        "category": "Major",
        "description": "Arawak is a linguistic and cultural horizon that expanded from the Orinoco basin into the Antilles during the Late Ceramic Age (roughly 500 BCE–800 CE). In Cuba, Arawakan settlers established villages across the east and center of the island. They introduced pottery traditions, manioc-based horticulture, and large dugout canoes suited to inter-island travel. Material culture includes griddles for cassava processing, stone celts, and shell ornaments.\n\nSettlement growth and lineage leadership produced more complex village networks. Exchange moved lithic raw materials and prestige goods across islands. In Cuba these communities met and interacted with older foraging groups. Over centuries, insular Arawakan populations generated distinct island identities. In the Greater Antilles this process culminated in the Taíno, whose chiefdoms dominated the archipelago on the eve of European arrival and shaped Cuba’s eastern cultural landscape."
    },
    {
        "name": "Taíno",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "Cuba"
            }
        ],
        "upgradesFrom": [
            "Arawak"
        ],
        "category": "Major",
        "description": "The Taíno were the dominant Late Ceramic Age societies of the Greater Antilles, including eastern Cuba, by c. 1200–1500 CE. They organized into ranked chiefdoms (cacicazgos) with hereditary leaders, regional ceremonial centers, and networks of tribute and alliance. Settlements featured plazas, ball courts, and engineered fields. Subsistence combined manioc agroforestry, fishing, and hunting. Cotton weaving, carved zemis, and wooden canoes indicate specialized crafts and long-distance movement.\n\nColumbus encountered Taíno communities in 1492–93. Spanish conquest, disease, forced labor, and relocations caused a demographic collapse within decades. Nonetheless, Indigenous lineages, knowledge of crops and navigation, and town sites endured in altered forms. In Cuba, survivals were strongest in the east, where Taíno-descended people mixed with Africans and Europeans in frontier and maroon settings. Their agricultural and nautical practices fed into colonial economies and informed creole society that followed."
    },
    {
        "name": "Cuba (Renaissance)",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "Cuba"
            }
        ],
        "upgradesFrom": [
            "Taíno"
        ],
        "category": "Major",
        "description": "Spanish conquest of Cuba began in 1511 under Diego Velázquez, who founded Baracoa, Santiago, and Havana as administrative and military centers. Indigenous communities were rapidly reduced by disease, forced labor, and resettlement, though survivors contributed crops, skills, and local knowledge to colonial society. By the mid-sixteenth century, Cuba served as a provisioning and transit point for fleets bound between Spain and the Americas, with Havana’s harbor fortified to guard treasure convoys. African slavery expanded to sustain cattle ranching, tobacco, and later sugar cultivation, producing a plantation economy and maroon communities in frontier zones. Repeated corsair raids prompted fortifications such as El Morro, while Havana grew into a key Atlantic port. By the eighteenth century, intensified sugar and tobacco exports tied Cuba more closely to global markets, and large slave imports altered demographics. Bourbon reforms strengthened defenses and administration, while creole elites, smallholders, and enslaved populations shaped a society that bridged Indigenous, African, and European influences on the eve of the independence wars."
    },
    {
        "name": "Cuba (Modern)",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "Cuba"
            }
        ],
        "upgradesFrom": [
            "Cuba (Renaissance)"
        ],
        "category": "Major",
        "description": "Modern Cuba emerged from protracted wars of independence. The Ten Years’ War (1868–78) weakened slavery and colonial authority. The War of 1895, led by José Martí, Máximo Gómez, and Antonio Maceo, ended with U.S. intervention in 1898. A republic formed in 1902 under the Platt Amendment, repealed in 1934. Sugar monoculture, U.S. investment, and cyclical crises shaped the early republic. Political upheavals culminated in Batista’s dominance and the 1959 revolutionary victory.\n\nAfter 1959 the state nationalized key sectors, carried out agrarian reform, and ran a nationwide literacy campaign. Alignment with the USSR brought industrial aid, oil, and a guaranteed sugar market. Cuba deployed troops and doctors abroad and joined the Non-Aligned Movement. The 1990s Special Period followed Soviet collapse, with severe contraction and limited market openings. The 2010s saw gradual economic reforms, a U.S. rapprochement (2014–16), and renewed sanctions thereafter. A new constitution (2019) recognized private enterprise; MSMEs expanded from 2021 amid currency unification, pandemic shocks, and energy shortages. Biotech developed notable vaccines and therapies, tourism recovered unevenly, and emigration rose. The one-party system endures, with periodic protests and ongoing adjustment to global and regional shifts."
    },
    {
        "name": "Olmec",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "Mexico"
            }
        ],
        "category": "Major",
        "description": "The Olmec culture flourished on the Gulf Coast of Mexico, mainly in modern Veracruz and Tabasco, c. 1600–400 BCE. Major centers included San Lorenzo, La Venta, and Tres Zapotes. Rulers built earthen platforms and pyramids and commissioned colossal basalt heads. Complex iconography, including jaguar-human motifs, spread widely. Engineers modified river courses and constructed drainage systems at San Lorenzo. Long-distance exchange moved jadeite, obsidian, and marine shells through Mesoamerica.\nPossible early writing appears on the Cascajal block, and calendrical and ballgame traditions are evident. Political organization likely evolved from chiefly polities to early states. La Venta’s ceremonial core with a great pyramid anchors a broad ritual landscape. By c. 400 BCE major centers declined, likely due to environmental change and shifting trade and power. Many religious concepts, artistic canons, and elite practices persisted in later Mesoamerican cultures, which adapted Olmec precedents to new social orders."
    },
    {
        "name": "Maya",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "Mexico"
            }
        ],
        "upgradesFrom": [
            "Olmec"
        ],
        "category": "Major",
        "description": "Maya civilization developed across the Yucatán Peninsula, the Guatemalan Petén, and the Chiapas and highland zones. Preclassic roots reach to the first millennium BCE. The Classic period (c. 250–900 CE) saw powerful city-states such as Tikal, Calakmul, Palenque, and Copán. Maya scribes used a logosyllabic script now largely deciphered. Stelae and buildings record dynastic histories and warfare. Astronomers tracked Venus and eclipse cycles. Mathematicians used place value and zero. Builders raised pyramids, palaces with corbelled vaults, and causeways. Farmers managed milpa fields, terraces, and reservoirs.\nAfter c. 800–900 CE many southern lowland cities declined due to political fragmentation, warfare, and climatic stress. Power shifted to northern and western centers, including Chichén Itzá and later Mayapán. Spanish incursions began in the early 16th century. Conquest was protracted; the Itza capital fell in 1697. Maya languages, ritual, and community life endure. Contemporary Maya communities maintain resilient identities while engaging regional markets, tourism, and national politics."
    },
    {
        "name": "Toltec",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "Mexico"
            }
        ],
        "upgradesFrom": [
            "Maya"
        ],
        "category": "Major",
        "description": "The Toltec flourished in central Mexico c. 900–1150 CE, after the decline of Teotihuacan. Their capital at Tollan (Tula, Hidalgo) covered a large urban zone with pyramids, colonnaded halls, and ballcourts. The best-known structures are the stone warrior columns on Pyramid B. Artistic programs stress militarized elites, feathered serpents, and jaguar and coyote imagery. Workshops produced fine obsidian tools, metal ornaments, and ceramic effigies.\nToltec influence reached far, with shared styles and cults visible across the Basin of Mexico and into Yucatán. Iconographic ties with Chichén Itzá suggest interaction, though the direction and mechanisms remain debated. Tribute networks and alliances sustained the polity. Drought, internal conflict, and incursions from the north contributed to fragmentation by the 12th century. Later central Mexican elites treated “Toltec” as a term for master craftsmen and exemplary rulers. Aztec nobles traced lineages to Tollan to legitimize power and ritual authority."
    },
    {
        "name": "Aztec",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "Mexico"
            }
        ],
        "upgradesFrom": [
            "Toltec"
        ],
        "category": "Major",
        "description": "The Mexica (Aztec) established Tenochtitlan on Lake Texcoco c. 1325. After victory over Azcapotzalco in 1428 they formed the Triple Alliance with Texcoco and Tlacopan. Expansion under Itzcoatl, Moctezuma I, and Ahuitzotl created a large tributary empire. Chinampa agriculture, aqueducts, and dikes sustained dense urban life. Tlatelolco’s market linked regional trade. Education in calmecac and telpochcalli trained elites and commoners. Priests maintained complex ritual calendars and state cults centered on Huitzilopochtli and Tlaloc.\nThe capital’s Templo Mayor saw repeated expansions and major ceremonies. Poetry, codices, and fine featherwork flourished. Alliance warfare, strategic marriages, and vassal governors maintained control. In 1519–1521 Spanish-led forces, allied with Tlaxcala and other enemies of the empire, besieged and captured Tenochtitlan amid devastating epidemics. The city became the seat of the Viceroyalty of New Spain. Imperial institutions and labor systems were reshaped under colonial rule while Nahua communities adapted and persisted."
    },
    {
        "name": "Mexico",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "Mexico"
            }
        ],
        "upgradesFrom": [
            "Aztec"
        ],
        "category": "Major",
        "description": "Modern Mexico emerged from the collapse of the Aztec Empire and three centuries of colonial rule. The independence struggle began in 1810 and ended in 1821. An initial empire gave way to a republic. The 19th century saw federalist–centralist conflict, war with the United States (1846–48), liberal Reform, and French Intervention. Under Porfirio Díaz (1876–1911) railways and export growth expanded with rising inequality. The Revolution (1910–1920) produced the 1917 Constitution and a new state. Lázaro Cárdenas advanced land reform and nationalized oil in 1938.\nThe 20th century combined one-party dominance with industrialization and urban growth. Cultural life produced muralism and notable literature and film. Economic crises in the 1980s led to market reforms and deeper North American integration under NAFTA in 1994. Competitive elections brought alternation in 2000. Since the mid-2000s security challenges and human-rights concerns have intensified. Today Mexico is a diversified upper-middle-income economy within USMCA, with strong manufacturing, major universities, and active civil society, alongside persistent inequality, corruption, and environmental stress."
    },
    {
        "name": "Mogollon",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "USA"
            }
        ],
        "category": "Major",
        "description": "The Mogollon tradition emerged in the uplands of what is now New Mexico, Arizona, and northern Mexico by at least 200 BCE and persisted to about 1400–1450 CE. Communities shifted from pithouse hamlets to multiroom masonry pueblos, cultivated maize, beans, and squash, and practiced dry farming with check dams and small irrigation works. Distinctive brownware developed into Mimbres black-on-white pottery (ca. 1000–1150), known for geometric and faunal imagery and technical control. Villages joined exchange networks with Hohokam and Ancestral Puebloan spheres, sharing ideas on architecture, kivas, and ritual.\n\nAfter 1100 climate variability and social reorganization led to aggregation at defensible mesa-top sites and eventual depopulation of many valleys. Populations moved north and east toward the upper Rio Grande and Zuni–Hopi regions, contributing people and practices to later Pueblo polities. The Mogollon legacy endures in ceramic traditions, masonry techniques, and agricultural strategies adapted to the semi-arid Southwest."
    },
    {
        "name": "Pueblo",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "USA"
            }
        ],
        "upgradesFrom": [
            "Mogollon"
        ],
        "category": "Major",
        "description": "Ancestral Puebloan societies developed from Basketmaker foundations during the first millennium CE. From 850–1150 the Chacoan system constructed great houses, engineered roads, and created precise architectural alignments; Mesa Verde cliff communities peaked in the 1200s. After 1300 populations consolidated along the Rio Grande, at Zuni, and on the Hopi Mesas, building plaza-oriented towns with kivas, terrace fields, and water-harvesting works. Pottery, weaving, and ritual calendrics showed high specialization and regional variation.\n\nSpanish intrusion in the 16th–17th centuries brought missions and tribute demands. The Pueblo Revolt of 1680 expelled colonists for over a decade. A negotiated reconquest after 1692 preserved discrete pueblos with land grants and councils. Through Mexican and U.S. rule, Pueblo communities maintained self-government and agriculture, and produced influential ceramics and mural traditions. Today 19 Pueblos in New Mexico, along with Hopi and Zuni, retain languages, ceremonial cycles, and legal sovereignty, stewarding ancestral sites that incorporate Mogollon and Chacoan legacies."
    },
    {
        "name": "Apache",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "USA"
            }
        ],
        "upgradesFrom": [
            "Pueblo"
        ],
        "category": "Major",
        "description": "Southern Athabaskan speakers entered the Southwest between the 13th and 15th centuries, forming Western Apache, Chiricahua, Mescalero, Jicarilla, and Lipan groups. They organized in mobile local groups, practiced seasonal hunting and gathering, dry farming in some areas, and long-distance trade. After the 17th century they adopted the horse, reshaping logistics, warfare, and exchange with Spanish and Pueblo settlements. Raiding and alliance-making functioned within a flexible political economy adapted to rugged terrain and variable climate.\n\nSpanish, Mexican, and later United States campaigns targeted Apache autonomy. From the 1850s to 1886 U.S. military pressure ended most armed resistance; prominent leaders included Cochise and Goyaałé (Geronimo). Reservations were established at San Carlos, White Mountain, Mescalero, and Jicarilla. In the 20th and 21st centuries Apache nations developed forestry, ranching, gaming, and tourism, while revitalizing language and ceremonial life, including the Na’ii’ees coming-of-age ceremony. Contemporary governments exercise sovereignty, manage natural resources, and collaborate on heritage protection with neighboring Pueblos and federal institutions."
    },
    {
        "name": "United States (Enlightenment)",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "USA"
            }
        ],
        "upgradesFrom": [
            "Apache"
        ],
        "category": "Major",
        "description": "The British North American colonies drew on Enlightenment thought to justify independence in 1776 and to frame republican institutions. The Constitution of 1787 established separation of powers, federalism, and enumerated rights. Scientific societies, surveying, and public education advanced as state projects. The Land Ordinances created the Public Land Survey System and standardized settlement. Early industry and finance grew under Hamilton’s programs, while slavery and Native dispossession remained unresolved contradictions.\n\nTerritorial expansion followed. The Louisiana Purchase (1803), Adams–Onís (1819), annexation of Texas (1845), and the Mexican–American War ended with the Treaty of Guadalupe Hidalgo (1848), transferring the Southwest. Federal Indian policy combined trade regulation with military and treaty power, setting the stage for later reservation systems. Exploration by the Corps of Discovery and military topographical surveys mapped routes that would carry railroads, settlers, and new conflicts into Apache and Pueblo homelands."
    },
    {
        "name": "United States (Modern)",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "USA"
            }
        ],
        "upgradesFrom": [
            "United States (Enlightenment)"
        ],
        "category": "Major",
        "description": "Industrialization transformed the United States in the late 19th century. Railroads, steel, and corporate finance integrated national markets. The Civil War preserved the Union and abolished slavery, though Reconstruction’s gains were curtailed by Jim Crow. Western expansion brought allotment under the Dawes Act (1887), reservation confinement, and boarding schools that targeted Native cultures. The Progressive Era pursued regulation and conservation; the National Park Service formed in 1916. World Wars I and II accelerated manufacturing, science, and federal capacity.\n\nPost-1945 the country led the Cold War, built the interstate system, and expanded higher education and research, including spaceflight. Federal Indian policy shifted from Termination toward Self-Determination after 1975, enabling tribal governance and economic development. The Civil Rights Movement, immigration reforms, and later technology revolutions reshaped society and the Southwest. Today the United States is a diversified service and technology economy facing inequality, infrastructure and immigration challenges, and climate impacts. It recognizes tribal sovereignty in law, partners with Pueblo and Apache nations on resource management and heritage, and preserves archaeological landscapes through federal, state, and tribal stewardship."
    },
    {
        "name": "Taquara",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Brazil"
            }
        ],
        "category": "Major",
        "description": "The Taquara (Taquara-Itararé Tradition) occupied the Southern Brazilian Plateau from c. 400 CE to the early colonial period. Archaeology documents pit houses on upland ridges, circular or oval village plans, and corrugated or brushed ceramics. Toolkits include polished stone axes and projectile points. Subsistence combined small-scale horticulture with intense exploitation of the Araucaria angustifolia pine forests. Seasonal movements tracked nut harvests and deer ranges. Fire management and selective clearing created mosaic landscapes.\nContacts linked the highlands to coastal and riverine groups through exchange of lithics, ornaments, and possibly maize varieties. The tradition aligns with ancestors of Southern Jê speakers (Kaingang, Xokleng). As Tupi-Guarani groups expanded along lowlands after 1000 CE, Taquara communities held upland refuges and negotiated shifting frontiers. Many sites remained occupied into early colonial times, when disease and missionization disrupted settlement patterns. Taquara legacies persist in Southern Jê social geography and forest-use knowledge."
    },
    {
        "name": "Kuhikugu",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Brazil"
            }
        ],
        "upgradesFrom": [
            "Taquara"
        ],
        "category": "Major",
        "description": "Kuhikugu names a cluster of large pre-Columbian settlements near the headwaters of the Xingu River (Upper Xingu, Mato Grosso), occupied mainly c. 1000–1600 CE. Excavations and remote sensing reveal planned towns with central plazas, palisades, radiating roads and bridges, raised fields, fish weirs, and extensive terra preta soils. The network supported several tens of thousands of inhabitants. A managed forest-farm mosaic sustained manioc cultivation, arboriculture, and rich fisheries.\nRegional interaction stitched Kuhikugu into wider Amazonian exchange circuits that reached the Atlantic and southern highlands. After the sixteenth century, epidemics and slave raiding precipitated sharp demographic decline and reorganization. Spatial layouts and ritual geographies documented ethnographically among Upper Xingu peoples echo aspects of the earlier system, indicating strong cultural continuities. The engineered landscape of Kuhikugu now anchors debates on Amazonian urbanism, showing durable anthropogenic forests and waterworks rather than untouched wilderness."
    },
    {
        "name": "Tupinambá",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Brazil"
            }
        ],
        "upgradesFrom": [
            "Kuhikugu"
        ],
        "category": "Major",
        "description": "At European contact in the sixteenth century, the Tupinambá occupied long stretches of Brazil’s Atlantic seaboard, including parts of today’s Bahia and the southeast. They cultivated manioc in shifting fields, built large palisaded villages, and moved by canoe along lagoons and estuaries. Warfare followed strict norms, and ritual anthropophagy formed part of conflict resolution and cosmology. Old Tupi served as a lingua franca in coastal trade with Europeans and neighboring peoples.\nFrench traders forged alliances with Tupinambá factions, provoking the Tamoio wars against the early Portuguese colony. Campaigns led by Mem de Sá and allied Indigenous groups broke these coalitions. Smallpox and forced resettlement into mission aldeias followed. Many communities were absorbed or displaced, yet Tupinambá identities endured. In Bahia, descendants reasserted territorial rights in the twenty-first century, gaining federal recognition of Indigenous lands. Featherwork, barkcloth, and ceremonial knowledge have seen revival within these communities."
    },
    {
        "name": "Guaraní",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Brazil"
            }
        ],
        "upgradesFrom": [
            "Tupinambá"
        ],
        "category": "Major",
        "description": "The Guaraní, a major Tupi-Guarani branch, expanded along the Paraná, Paraguay, and Uruguay river basins between the first millennium CE and European contact. Village clusters practiced intensive horticulture of manioc and maize, complemented by fishing and hunting. River corridors and the Peabiru trail network linked the Atlantic coast to the interior. Prophetic movements seeking the Land Without Evil structured migrations and alliances. Music, long-distance canoe travel, and trade in yerba mate shaped regional influence.\nFrom 1609 the Jesuit reducción system reorganized Guaraní populations into planned towns across the Upper Paraná. These communities developed militias, printed music, schools, and large-scale yerba mate production, forming a powerful frontier society until the 1767 expulsion of the Jesuits and the Guaraní War (1754–56). After imperial partition, Guaraní lands were divided among Brazil, Paraguay, and Argentina. Guaraní remains a national language in Paraguay and a regional lingua franca. Today, Guaraní groups, including the Guarani-Kaiowá, lead land-rights campaigns and cultural revitalization across southern Brazil."
    },
    {
        "name": "Brazil",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Brazil"
            }
        ],
        "upgradesFrom": [
            "Guaraní"
        ],
        "category": "Major",
        "description": "Portugal established a colony in 1500. The sugar economy, Indigenous slavery, and the Atlantic slave trade structured the sixteenth and seventeenth centuries. Dutch occupations in the Northeast (1630–1654) catalyzed fortification and sugar innovation. Gold discoveries in Minas Gerais after the 1690s shifted wealth inland and spurred roads and towns. Pombaline reforms tightened metropolitan control. The court’s transfer to Rio de Janeiro in 1808 opened ports and institutions. Independence came in 1822 under an empire that expanded by coffee, railways, and immigration. Slavery ended in 1888; the Republic followed in 1889.\nThe twentieth century brought Vargas-era industrial policy, Petrobras and steel, Brasília’s construction, and military rule (1964–1985). Democracy returned with the 1988 Constitution. The Real Plan (1994) stabilized inflation. Growth in the 2000s rode commodities, agribusiness, and Embraer’s aerospace. Corruption probes, recession, and polarized politics marked the 2010s. Contemporary Brazil is a G20 economy with deep inequality and world-scale biodiversity. Pre-salt oil, biofuels, and fintech sit beside Amazon conservation and Indigenous land demarcation debates. Elections in the 2020s reset climate and social policy while keeping fiscal constraints and infrastructure needs at the center."
    },
    {
        "name": "Chinchorro",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Chile"
            }
        ],
        "category": "Major",
        "description": "The Chinchorro were preceramic fisher-hunter-gatherers of the Atacama Desert coast, active c. 7000–1500 BCE. They occupied shores from southern Peru to northern Chile, clustering near Arica and the Camarones Valley. Their economy relied on maritime foraging: fish, shellfish, sea mammals, and seabirds. They used reed rafts, nets of plant fiber, harpoons, and bone hooks. Camps and cemeteries show long-term coastal settlement and seasonal mobility.\n\nThe Chinchorro developed the world’s earliest artificial mummification, beginning before 5000 BCE. Black and red mummy techniques used skin removal, reed supports, clay masks, and mineral pigments. Mortuary care extended to adults, children, and infants, indicating broad social concern. Material exchange with highland groups moved obsidian and pigments along the coast–Andes corridor. The tradition waned after the mid 2nd millennium BCE as new coastal lifeways and later ceramic cultures appeared, but their mortuary innovations shaped the deep cultural record of northern Chile."
    },
    {
        "name": "Mapuche",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Chile"
            }
        ],
        "upgradesFrom": [
            "Chinchorro"
        ],
        "category": "Major",
        "description": "Mapuche communities consolidated in south-central Chile during the Late Pre-Contact period, c. 600–1500 CE. They organized into patrilineal lof grouped in aillarehue and regional butalmapu. Leaders (lonko) coordinated ritual and defense; in war, a toqui could centralize command. Subsistence combined maize, potatoes, quinoa, and beans with hunting and riverine gathering. Settlements featured thatched rucas; fortifications (pukara) guarded passes and river crossings. Mapudungun flourished as a lingua franca across diverse local identities such as Picunche, Lafkenche, and Huilliche.\n\nIn the late 15th century Mapuche halted Inca expansion at the Maule frontier. Contact with the Andes brought new crops, weaving patterns, and metalworking knowledge, adapted to local needs. This political and military flexibility set the baseline for later resistance to Europeans. When Spaniards entered the region in the 1540s, they encountered populous and mobile chiefdoms able to assemble large contingents and to negotiate or fight as circumstances required."
    },
    {
        "name": "Arauco",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Chile"
            }
        ],
        "upgradesFrom": [
            "Mapuche"
        ],
        "category": "Major",
        "description": "Arauco denotes the colonial frontier zone of the Arauco War between Spanish Chile and Mapuche polities, centered between the Biobío and Toltén rivers, c. 1550–1650. Spanish incursions founded cities such as La Imperial, Valdivia, Villarrica, and Osorno. Mapuche counteroffensives under toquis like Lautaro, Caupolicán, and later Pelantaro destroyed most southern cities after the disaster of Curalaba (1598). Mounted warfare, rapid signaling, and fortified strongpoints frustrated sustained conquest.\n\nThe conflict produced a negotiated frontier. The Treaty of Quillín (1641) acknowledged Mapuche autonomy south of the Biobío and established periodic parlamentos to regulate trade, ransoms, and peace. A cross-border economy grew in cattle, textiles, iron goods, and captives. Jesuit missions operated intermittently, while Spanish authority consolidated north of the frontier and in Chiloé. The Arauco system endured into the 18th century, shaping a distinct diplomatic culture and constraining colonial expansion until the era of Bourbon reforms and independence."
    },
    {
        "name": "Chile (Enlightenment)",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Chile"
            }
        ],
        "upgradesFrom": [
            "Arauco"
        ],
        "category": "Major",
        "description": "During the Enlightenment and late colonial era, c. 1700–1825, Mapuche polities maintained de facto sovereignty through diplomacy and commerce. Regular parlamentos, including Negrete (1726) and subsequent assemblies, set terms for peace, trade, and mission activity. Mapuche elites expanded a cattle and horse economy tied to markets in Concepción, Valdivia, and across the Andes. Firearms, metal tools, and textiles circulated widely, while kin alliances knit together butalmapu-level politics.\n\nBourbon officials sought tighter control with forts and roads, yet relied on negotiation after each campaign. The Jesuit expulsion in 1767 altered mission networks but not frontier autonomy. After 1810, republican Chile continued treaty-making, most notably the Parlamento of Tapihue (1825), which recognized Mapuche territorial integrity. Increasing settler pressure and state colonization plans in the 1840s–1850s eroded this balance, setting conditions for the nineteenth-century occupation of Araucanía and the reduction of Mapuche lands into scattered reservations."
    },
    {
        "name": "Chile (Modern)",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Chile"
            }
        ],
        "upgradesFrom": [
            "Chile (Enlightenment)"
        ],
        "category": "Major",
        "description": "Chile emerged as an independent republic in 1818 after the Wars of Independence led by Bernardo O'Higgins and José de San Martín. A stable conservative order in the mid-19th century built institutions, codified law, and expanded education. Expansion southward culminated in the occupation of Araucanía (1861–1883), which dismantled Mapuche autonomy. Victory in the War of the Pacific (1879–1883) added nitrate-rich provinces, financing railways, ports, and urban growth. The parliamentary republic (1891–1925) faced labor unrest and cycles of boom and bust.\n\nThe 20th century brought copper dominance, social reform, and political polarization. The state nationalized major copper mines in 1971. A military coup in 1973 installed Augusto Pinochet’s dictatorship, marked by repression and market liberalization. Democracy returned in 1990 with a negotiated transition and sustained growth under export-led policies. Since 2006, student movements and the 2019 social uprising have pressed for equity and institutional change. Constitutional reform efforts advanced but faced repeated plebiscite setbacks in 2022 and 2023. Today Chile is an OECD member with strong macroeconomic management, a leading copper and lithium sector, and ambitious renewable energy plans, while debates over pensions, inequality, and indigenous rights continue."
    },
    {
        "name": "Tumaco",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Colombia"
            }
        ],
        "category": "Major",
        "description": "The Tumaco–La Tolita cultural tradition flourished along the Pacific lowlands of southern Colombia and northern Ecuador, roughly 300 BCE to 600 CE. Communities occupied mangrove estuaries and river mouths, building mound centers and craft workshops near Isla de La Tolita. Tumaco artisans developed advanced ceramic sculpture and metalwork, including sophisticated sintering of platinum with gold and tumbaga. They produced masks, figurines, and fine ornaments that circulated widely.\nMaritime and riverine exchange linked Tumaco settlements to interior Andean valleys. Salted fish, marine shell, and metals moved inland, while highland goods returned to the coast. Tumaco networks and coastal technologies formed a durable corridor later used by highland cultures such as Nariño groups. Environmental change and sociopolitical shifts led to reorganization after 500 CE, but craft repertoires and exchange patterns persisted in successor societies."
    },
    {
        "name": "Nariño",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Colombia"
            }
        ],
        "upgradesFrom": [
            "Tumaco"
        ],
        "category": "Major",
        "description": "The Nariño cultural sphere occupied the high valleys straddling today’s southern Colombia and northern Ecuador, c. 800–1500 CE. It featured dense hilltop settlements, terraced slopes, and ridge-field agriculture adapted to cold Andean climates. Nariño potters developed Pasto-style negative-painted ceramics and modeled effigies. Metallurgists worked gold-copper alloys into pectorals and ritual items. Trade routes bound the highlands to the Pacific coast, channeling shell, salt, and metals between Tumaco-descended coastal groups and interior communities.\nNariño chiefdoms interacted with neighboring Quillacinga and Pasto polities and resisted Inca advances near Rumichaca in the late 15th century. Political organization remained segmented, with fortified nodes controlling passes and market sites. At Spanish arrival, these highland networks still managed cross-ecological exchange, providing a bridge between older coastal traditions and the later Muisca-dominated uplands farther north."
    },
    {
        "name": "Muisca",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Colombia"
            }
        ],
        "upgradesFrom": [
            "Nariño"
        ],
        "category": "Major",
        "description": "The Muisca occupied the Altiplano Cundiboyacense of the Eastern Cordillera, c. 600–1537 CE. They formed two major confederations under the zipa (Bacatá) and the zaque (Hunza), supported by dense agricultural communities. Farmers used drainage canals and raised fields on the Bogotá savanna and cultivated maize, tubers, and cotton. Salt production at Zipaquirá and Nemocón, emerald extraction in Muzo, and fine gold-tumbaga work underpinned a specialized economy. Regular markets and tribute flows integrated craft specialists and long-distance trade.\nReligious centers combined ancestor veneration with solar-lunar astronomy; the observatory at El Infiernito and the Lake Guatavita gilding ritual later fed the El Dorado narrative. Spanish incursions (1537–1540) dismantled confederation authority and folded the territory into the New Kingdom of Granada. Muisca survivals persisted in language loans, settlement patterns, salt exploitation, and metallurgy that influenced colonial craft production."
    },
    {
        "name": "Carib",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Colombia"
            }
        ],
        "upgradesFrom": [
            "Muisca"
        ],
        "category": "Major",
        "description": "Cariban-speaking groups expanded across the Orinoco basin, Guianas, and Lesser Antilles between roughly 1000 and 1500 CE, with enclaves extending into what is now Colombia. In the Andean foothills and intermontane valleys, Carib-affiliated peoples such as the Pijao and Panche contested frontiers with Chibchan and Arawakan neighbors and later with Spaniards. They excelled at riverine mobility, large dugout canoes, and cassava processing, using griddles, presses, and detoxification techniques that supported populous villages.\nContact-era conflicts were intense in the Magdalena and Tolima regions. Spanish campaigns in the 16th and 17th centuries, disease, and missionization fragmented many polities, though some lowland Cariban communities endured in the Amazonian margins (e.g., Carijona). Carib warfare, exchange networks, and botanical knowledge—curare preparation, fiber weaving, featherwork—shaped frontier dynamics into the colonial period and left enduring cultural enclaves that survive in contemporary Colombia."
    },
    {
        "name": "Colombia",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Colombia"
            }
        ],
        "upgradesFrom": [
            "Carib"
        ],
        "category": "Major",
        "description": "Colonial New Granada emerged from the conquest of Muisca and neighboring polities after 1537. The Audiencia of Bogotá and later the Viceroyalty structured extraction of gold, salt, and agricultural surpluses while integrating Andean, Caribbean, and Pacific routes first built by indigenous networks. Bourbon reforms, the 1781 Comuneros Revolt, and Atlantic ideas fostered crisis. Independence wars (1810–1819) created Gran Colombia, which fragmented by 1830. Nineteenth-century Colombia cycled through centralist and federalist constitutions, civil wars, and coffee-led export growth. The 1886 constitution consolidated a central state; the Thousand Days’ War (1899–1902) and Panama’s separation followed.\nTwentieth-century Colombia urbanized and diversified into coffee, oil, coal, and manufacturing. La Violencia (1948–1958) and the National Front shaped mid-century politics. From the 1960s, insurgencies and drug cartels drove internal conflict. The 1991 Constitution expanded rights and decentralization. A 2016 accord with FARC reduced conflict, while ELN talks continue. Today Colombia is a middle-income democracy with major biodiversity, expanding infrastructure on both coasts, and growing cultural industries. Ongoing challenges include rural reform, substitution of illicit economies, and implementing transitional justice."
    },
    {
        "name": "Caral-Supe",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Peru"
            }
        ],
        "category": "Major",
        "description": "Caral-Supe, also known as the Norte Chico civilization, flourished in the Supe and adjacent valleys of coastal Peru c. 3000–1800 BCE. It developed one of the earliest urban traditions in the Americas. Major centers such as Caral had platform mounds, sunken circular plazas, and formal residential zones. The economy combined irrigated agriculture with intensive fishing supported by cotton nets. Cotton and food moved between coastal and inland communities through stable exchange networks. Monumental building used shicra bag fill and well planned terraces. Flutes and other instruments attest to organized ritual. Knotted strings found on site may indicate early record-keeping. Long-distance items such as marine shells and exotic stones circulated. Although ceramics were absent, textile production and irrigation engineering were advanced. Caral-Supe established enduring Andean patterns of communal labor, canal management, and valley-centered polities that later cultures on the south coast and highlands adapted to local environments."
    },
    {
        "name": "Nazca",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Peru"
            }
        ],
        "upgradesFrom": [
            "Caral-Supe"
        ],
        "category": "Major",
        "description": "Nazca culture dominated the southern Peruvian coast c. 100 BCE–800 CE. Its core lay in the Nazca and Ica valleys, with Cahuachi as a major ceremonial center. Agriculture relied on river floodplains and subterranean puquio aqueducts that tapped groundwater. Communities coordinated maintenance of canals and galleries to stabilize production in an arid zone. Nazca artisans produced polychrome ceramics and fine textiles with complex iconography. On the pampas, geoglyphs were laid out as lines, trapezoids, and large biomorphs. These were created by clearing desert pavement and were used for processions and ritual observation. Political power was segmented among valley groups linked by pilgrimage and exchange. Environmental shocks, including El Niño events and river downcutting, stressed settlements after 500 CE. By the eighth century, Cahuachi waned, populations shifted, and influences from highland polities entered the region. Coastal traditions nevertheless provided techniques and routes that facilitated later Middle Horizon interaction."
    },
    {
        "name": "Tiwanaku",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Peru"
            }
        ],
        "upgradesFrom": [
            "Nazca"
        ],
        "category": "Major",
        "description": "Tiwanaku was a highland metropolis and polity centered near Lake Titicaca, flourishing c. 500–1000 CE. Its urban core featured the Akapana platform, Kalasasaya, and sunken courts with fine ashlar masonry. Iconography and stone portals such as the Gate of the Sun projected a state cult that spread across the south-central Andes. Agricultural success rested on raised fields (waru waru), canalized wetlands, and llama caravans that moved staples and copper across ecological tiers. Tiwanaku established colonies and enclaves in valleys such as Moquegua, integrating coastal and highland resources. There is no evidence of writing, but administrative control operated through ritual, feasting, and craft specialization. Tiwanaku coexisted with the Wari state to the north, defining the Andean Middle Horizon. Prolonged drought after 1000 CE undermined raised-field productivity and led to political fragmentation. Its masonry styles, agricultural knowledge, and myths persisted among post-Tiwanaku kingdoms and informed later Inca ideology."
    },
    {
        "name": "Inca",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Peru"
            }
        ],
        "upgradesFrom": [
            "Tiwanaku"
        ],
        "category": "Major",
        "description": "The Inca formed the imperial state of Tawantinsuyu in the thirteenth to sixteenth centuries, with Cusco as capital. Expansion under Pachacuti, Topa Inca Yupanqui, and Huayna Capac created a multiethnic empire linked by the Qhapaq Ñan road system, bridges, and way stations. Administration used a decimal hierarchy, mit'a labor drafts, storehouses, and quipus for information management. Agricultural terraces, qollqa granaries, and irrigation secured surpluses across vertical ecological zones. State religion centered on the Sun cult and veneration of royal mummies. Stone architecture at Sacsayhuamán, Ollantaytambo, and Machu Picchu displayed precise joinery and planned urban layouts. Resettlement (mitmaqkuna), alliances, and garrisons maintained order. A civil war between Huáscar and Atahualpa weakened the realm before the Spanish invasion of 1532. Pizarro captured and executed Atahualpa, took Cusco, and ended independent rule by 1533, though resistance at Vilcabamba lasted to 1572. Inca language, community organization, and agricultural systems endured within colonial and republican Peru."
    },
    {
        "name": "Peru",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Peru"
            }
        ],
        "upgradesFrom": [
            "Inca"
        ],
        "category": "Major",
        "description": "Peru entered the Spanish imperial sphere in the sixteenth century. The Viceroyalty of Peru, established in 1542 with Lima as seat, organized mining, tribute, and forced labor regimes. Bourbon reforms restructured administration in the eighteenth century, provoking uprisings such as the Túpac Amaru II rebellion. Independence was declared in 1821 and secured at Ayacucho in 1824. The nineteenth century saw the guano export boom, railway building, fiscal crisis, and defeat in the War of the Pacific, after which Peru ceded Tarapacá and later recovered Tacna. The twentieth century featured the rise of APRA, military rule under Velasco Alvarado with agrarian reform, and internal conflict against Shining Path and MRTA. Alberto Fujimori’s presidency brought an autogolpe, counterinsurgency, and later prosecution. Since 2000 Peru has experienced macroeconomic growth driven by mining and agro-exports, poverty reduction, and persistent inequality. Recent years brought political volatility, corruption investigations, and protests. Contemporary Peru manages environmental conflicts, decentralization, and heritage conservation while expanding infrastructure and tourism."
    },
    {
        "name": "Xia",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "China"
            }
        ],
        "category": "Major",
        "description": "The Xia are traditionally regarded as the earliest Chinese dynasty, dated to roughly the 21st–16th centuries BCE in the middle Yellow River basin. Their historicity is debated, but many scholars link the dynasty to the Erlitou culture, which shows palatial platforms of rammed earth, bronze-working, and organized craft production. Legend places Yu the Great at the dynasty’s origin, credited with flood control projects that enabled stable agriculture and early state formation. No deciphered writing survives from this period, but material remains point to emerging urban hierarchies and regional exchange networks. The Xia–Shang transition is seen in the rise of more extensive bronze ritual systems and fortified centers. Later Chinese political ideology traced core institutions to this formative age, framing a precedent for dynastic rulership and hydrological management."
    },
    {
        "name": "Han",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "China"
            }
        ],
        "upgradesFrom": [
            "Xia"
        ],
        "category": "Major",
        "description": "The Han dynasty (206 BCE–220 CE) unified China after the Qin collapse and built a durable imperial framework. Emperor Gaozu established stable institutions; Emperor Wu expanded the realm into the Hexi Corridor, the Tarim Basin, northern Vietnam, and commanderies in Korea, enabling Silk Road exchange. The state adopted Confucian ideology, codified law, standardized coinage, and managed key monopolies on salt and iron. Innovations included papermaking, improved iron metallurgy, the seismograph, hydraulic engineering, and a refined calendar. Historical writing reached a high point with Sima Qian. The dynasty was interrupted by Wang Mang’s Xin regime (9–23 CE) but restored as Eastern Han (25–220). Mounting factionalism, peasant uprisings such as the Yellow Turban revolt, and warlord competition ended Han rule, leading to the Three Kingdoms era. Han administrative norms and cultural synthesis shaped later dynasties."
    },
    {
        "name": "Ming",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "China"
            }
        ],
        "upgradesFrom": [
            "Han"
        ],
        "category": "Major",
        "description": "Founded by Zhu Yuanzhang in 1368, the Ming dynasty restored native rule after the Yuan. Early consolidation under the Hongwu and Yongle emperors saw capital shifts between Nanjing and Beijing, construction of the Forbidden City, repair of the Grand Canal, and reinforcement of the northern defenses that became the best-known Great Wall segments. Admiral Zheng He’s expeditions (1405–1433) projected maritime reach into the Indian Ocean. The Ming economy grew through urbanization, commercialized agriculture, and a silver-based monetary regime linked to global trade. Printing and literati culture flourished, and Jingdezhen porcelain achieved worldwide demand. Fiscal strain, climatic stress during the Little Ice Age, internal rebellions, and frontier pressures eroded stability. In the 1640s Li Zicheng’s rebellion and Manchu intervention ended Ming rule, opening the way for the Qing conquest."
    },
    {
        "name": "Qing",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "China"
            }
        ],
        "upgradesFrom": [
            "Ming"
        ],
        "category": "Major",
        "description": "The Qing dynasty, founded by the Manchus, crossed the Great Wall in 1644 and built a multiethnic empire. Under the Kangxi, Yongzheng, and Qianlong emperors, the state integrated Mongolia, Xinjiang, Tibet, and Taiwan, and governed through the banner system, a refined bureaucracy, and the mature civil examination regime. The High Qing era saw population growth, agrarian expansion, global silver inflows, and accomplishments in art, scholarship, and legal codification. From the late eighteenth century, unrest and external pressures mounted. The Opium Wars and unequal treaties opened treaty ports and constrained sovereignty. The Self-Strengthening Movement built arsenals, shipyards, and telegraphs while preserving imperial institutions. Defeat by Japan in 1895 and failed reform attempts, including the Hundred Days and the New Policies, weakened the regime. The 1911 Revolution ended the dynasty, and the last emperor abdicated in 1912."
    },
    {
        "name": "China",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "China"
            }
        ],
        "upgradesFrom": [
            "Qing"
        ],
        "category": "Major",
        "description": "The Republic of China replaced the Qing in 1912. After a warlord period, the Nationalist government reunified much of the country in 1928. The Second Sino‑Japanese War (1937–1945) devastated industry and population. Civil war resumed, and in 1949 the People’s Republic of China (PRC) was founded on the mainland, while the ROC continued on Taiwan. Early PRC policies included land reform, collectivization, and Soviet‑style industrialization. The Great Leap Forward caused severe famine, and the Cultural Revolution disrupted education and governance. From 1978, reform and opening introduced market mechanisms, Special Economic Zones, and foreign investment. Rapid industrialization, urbanization, and infrastructure expansion followed, including high‑speed rail and large‑scale energy projects. China joined the WTO in 2001 and advanced in spaceflight, digital platforms, and manufacturing. Recent decades brought poverty reduction, environmental policy shifts, carbon‑reduction pledges, and global economic initiatives such as the Belt and Road. China is a leading world economy with significant scientific output and military modernization. Taiwan developed separately with industrial growth and democratic institutions, shaping ongoing cross‑strait dynamics."
    },
    {
        "name": "Harappan",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "India"
            }
        ],
        "category": "Major",
        "description": "The Harappan, or Indus Valley Civilization, flourished across the Indus and Ghaggar-Hakra systems c. 2600–1900 BCE, with antecedents from c. 3300 BCE. Major urban centers included Mohenjo-daro, Harappa, Dholavira, and Lothal. Cities followed orthogonal street plans, used baked-brick architecture, and maintained covered drainage and standardized weights. Artisans worked copper-bronze, faience, shell, and carnelian. Trade reached across the Arabian Sea to Oman and Mesopotamia; Lothal’s dockyard suggests maritime capacity.\n\nAn undeciphered script occurs on seals and tablets. Evidence for palaces or large temples is limited; storage and craft precincts indicate complex urban management. Agriculture produced wheat, barley, millets, and cotton; zebu cattle were prominent. After c. 1900 BCE, urban systems contracted, with regional Late Harappan traditions and population shifts eastward. Aridification and river reorganization are leading explanations for decline. Cultural continuities persisted in craft techniques, weights, and agricultural practices into later northern Indian cultures."
    },
    {
        "name": "Maurya",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "India"
            }
        ],
        "upgradesFrom": [
            "Harappan"
        ],
        "category": "Major",
        "description": "The Maurya Empire (c. 322–185 BCE) unified much of South Asia under Chandragupta Maurya, who built a court at Pataliputra with guidance attributed to Chanakya. A large standing army, provincial governors, and a road network sustained control. Megasthenes reported on the court, indicating diplomatic exchanges with Hellenistic polities. Fiscal policy relied on land revenue, state forests, and regulated trade; punch-marked silver coins circulated widely.\n\nUnder Ashoka (r. c. 268–232 BCE), the state issued rock and pillar edicts in Prakrit (Brahmi, Kharosthi) and in Greek-Aramaic in frontier zones. The edicts promoted dhamma, administrative ethics, and welfare measures. Missions supported the spread of Buddhism to Sri Lanka and beyond. Monumental pillars and stupas mark Mauryan-era projects. After Ashoka, imperial cohesion ebbed; by 185 BCE the dynasty ended, followed in the Gangetic core by the Shungas. The Mauryan legacy includes the first subcontinental-scale polity and the earliest dated South Asian inscriptions."
    },
    {
        "name": "Gupta",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "India"
            }
        ],
        "upgradesFrom": [
            "Maurya"
        ],
        "category": "Major",
        "description": "The Gupta Dynasty (c. 320–550 CE) consolidated a northern Indian empire under Chandragupta I, Samudragupta, and Chandragupta II. Administration combined hereditary offices with tributary polities. Gold coinage with refined die work circulated among courts and guilds. Sanskrit culture flourished; royal patronage supported poets such as Kalidasa and scholastic centers linked to later Nalanda.\n\nInnovation advanced in mathematics and astronomy. Aryabhata computed pi to notable precision, described trigonometric functions, and modeled planetary motion. Place-value decimal numeration and a dot or small circle for zero are attested in this milieu. Metallurgy achieved high corrosion resistance, exemplified by the Delhi iron pillar. Temple and sculpture styles established durable North Indian canons. From the late fifth century, Huna incursions and regional fragmentation eroded central authority. Gupta political structures dissolved, but artistic and scientific norms persisted in successor states and transregional scholarship."
    },
    {
        "name": "Mughal",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "India"
            }
        ],
        "upgradesFrom": [
            "Gupta"
        ],
        "category": "Major",
        "description": "The Mughal Empire (1526–1857) was founded by Babur after Panipat and consolidated by Akbar through flexible alliances and a graded mansabdari system. Revenue administration under Todar Mal standardized land assessment (zabt) and integrated cash taxation with expanding agrarian output. Persian served as the administrative language while courts promoted a Persianate-Indo vernacular culture. Textile, indigo, and metalware exports linked the empire to Indian Ocean and Central Asian trade.\n\nArchitecture and arts reached a high point: Fatehpur Sikri’s urban ensemble, the Red Forts of Agra and Delhi, and Shah Jahan’s Taj Mahal. Painting workshops developed naturalistic styles; gardens followed charbagh principles. Akbar pursued sulh-i kull, while later rulers varied in policy. After 1707, fiscal-military strain, Maratha and Sikh expansion, and Nader Shah’s 1739 raid weakened the center. East India Company influence advanced via Bengal revenue rights (1765) and subsidiary alliances. The 1857 uprising ended with the deposition of Bahadur Shah Zafar and formal British annexation."
    },
    {
        "name": "India",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "India"
            }
        ],
        "upgradesFrom": [
            "Mughal"
        ],
        "category": "Major",
        "description": "Modern India emerged from late colonial rule and the nationalist movement. The Indian National Congress (1885) organized constitutional agitation, then mass politics under M. K. Gandhi. Independence and Partition came in 1947. The Republic adopted a democratic constitution in 1950, with universal franchise, fundamental rights, and federal reorganization along linguistic lines. Early policy mixed planning with land reform and state-led industrialization; the Green Revolution raised grain output. India tested nuclear devices in 1974 and 1998.\n\nEconomic liberalization in 1991 opened markets, accelerated growth, and expanded services, especially information technology. ISRO developed launch vehicles and planetary missions, including Mars Orbiter (2014) and Chandrayaan‑3 (2023). India pursues nonalignment-derived strategic autonomy, maintains a large military, and engages in regional and global forums, including a G20 presidency in 2023. Persistent challenges include inequality, infrastructure gaps, environmental stress, and communal tensions. The country remains a populous federal democracy with a diversified economy and growing scientific and industrial capacity."
    },
    {
        "name": "Jōmon",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "Japan"
            }
        ],
        "category": "Major",
        "description": "The Jōmon period spans roughly 14,000–300 BCE. Communities lived in pit dwellings and practiced a broad-spectrum economy of fishing, shellfish gathering, hunting, and nut processing. They produced some of the world’s earliest pottery, marked with cord impressions, and developed lacquerwork. Shell middens, obsidian quarries, and jade ornaments show regional exchange networks. Ritual is visible in dogū figurines and stone circles. Later phases adopted small-scale cultivation of millet and buckwheat, with possible dry-field rice in the south. Forest management and seasonal mobility supported relatively dense coastal settlements. Distinct regional styles formed in Tōhoku, Kantō, Chūbu, and Kyūshū. By the first millennium BCE contacts with the continent increased. New populations and techniques entered via Korea. These changes prepared the ground for irrigated rice agriculture, bronze and iron tools, and deeper social stratification. The transition defines the move into the Yayoi horizon."
    },
    {
        "name": "Yayoi",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "Japan"
            }
        ],
        "upgradesFrom": [
            "Jōmon"
        ],
        "category": "Major",
        "description": "The Yayoi period, traditionally c. 300 BCE–250 CE, marks the spread of irrigated rice farming from the Korean peninsula into northern Kyushu and Honshu. Bronze and iron tools, new weaving methods, and stilted granaries arrived via migration and diffusion. Settlements grew larger, often with moats and palisades, and social ranking became clear. Ritual bronze items such as dotaku bells and continental-style weapons show elite display. Population rose as rice agriculture expanded floodplains. Warfare intensified; defensive sites and mass burials are common. Chinese chronicles describe Wa societies and a ruler, Queen Himiko, in the 3rd century. Trade linked Kyushu to Han and Wei China and to Korean states. Multiple polities competed and allied across western Japan. In this landscape one center expanded its influence. The process led into the Kofun age and the rise of the Yamato polity."
    },
    {
        "name": "Yamato",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "Japan"
            }
        ],
        "upgradesFrom": [
            "Yayoi"
        ],
        "category": "Major",
        "description": "The Yamato polity formed in the Kofun and Asuka periods, c. 3rd–7th centuries CE. Monumental burial mounds indicate a ruling coalition centered in the Nara Basin. Governance used lineage groups (uji) and rank titles (kabane) to manage tribute and labor. Contacts with Korea and China brought writing, Buddhism, and models of centralized law. Prince Shotoku advanced court institutions and diplomacy with Sui China. The Taika reforms of 645 and later codes, culminating in the Taiho Code of 701, created a ritsuryo state with land registers, provincial offices, and tax quotas. Temple construction such as Horyu-ji marked new religious patronage. Metalworking, horse culture, and irrigation improved military capacity and agriculture. The court extended authority into Kyushu and eastern Honshu, though regional powers persisted. A permanent capital was established at Nara in the early 8th century. Institutions from this era underpinned later Heian culture and the medieval rise of warrior rule that ended in Tokugawa unification."
    },
    {
        "name": "Edo",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "Japan"
            }
        ],
        "upgradesFrom": [
            "Yamato"
        ],
        "category": "Major",
        "description": "The Edo period (Tokugawa shogunate), 1603–1868, secured long internal peace after civil war. The shogun ruled from Edo and controlled daimyo through alternate attendance and castle laws. A formal order of samurai, peasants, artisans, and merchants structured society. Agricultural expansion, village compacts, and flood control raised yields. Edo, Osaka, and Kyoto became major cities. Commercialization created national markets, rice exchanges, and proto-industry in textiles, paper, and sake. Cultural life grew in kabuki, bunraku, haiku, and ukiyo-e. Foreign contacts narrowed under sakoku, yet Dutch trade at Nagasaki sustained rangaku in medicine and astronomy. Fiscal strains, famines, and protests stressed the regime. Reform cycles alternated between austerity and growth. Western gunboat diplomacy from 1853 forced treaty ports and exposed political rifts. The shogunate collapsed in 1868, opening the path to a modernizing imperial government."
    },
    {
        "name": "Japan",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "Japan"
            }
        ],
        "upgradesFrom": [
            "Edo"
        ],
        "category": "Major",
        "description": "From the Meiji Restoration in 1868, Japan pursued rapid modernization. Domains were abolished, conscription and national schooling introduced, and railways, telegraph, and factories built. The state fostered heavy industry through zaibatsu. Victory in the Sino-Japanese War and Russo-Japanese War expanded influence; Korea was annexed in 1910. Interwar years saw party cabinets and social unrest, then military ascendancy. War in China from 1937 and the Pacific War ended in 1945 with defeat and atomic bombings. The U.S. occupation enacted land reform, civil liberties, and the 1947 constitution. Postwar growth from the 1950s to 1980s made Japan a leader in autos, electronics, and shipbuilding. The 1990s asset bubble collapse brought stagnation. Since 2000, policy has sought revitalization while addressing aging and low fertility. Japan remains a major economy, a technology and cultural exporter, and a key U.S. ally. Recent decades include the 2011 earthquake and Fukushima crisis, defense reform debates, and expanded regional security partnerships."
    },
    {
        "name": "Ban Chiang",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "Siam"
            }
        ],
        "category": "Major",
        "description": "Ban Chiang is a prehistoric archaeological culture centered on the Khorat Plateau of northeastern Thailand, with its type-site in Udon Thani Province. Occupation spans the Late Neolithic through the Iron Age, roughly 1500 BCE to the early centuries CE. Excavations reveal early wet rice agriculture, domesticated cattle and pigs, and distinctive red painted ceramics. Mortuary assemblages include shell and stone beads, bronze ornaments, and socketed tools, indicating skilled casting and household metalworking.\n\nBronze appears by the second to first millennium BCE, followed by iron. Local production used bivalve molds and alloy recipes suited to ornaments and utilitarian blades. Exchange networks linked Ban Chiang communities to the Mekong basin and coastal routes. Materials such as cowrie, marine shell, and exotic stones reached inland cemeteries. Funerary practice shifted over time from flexed to extended burials with rich grave goods. The Ban Chiang sequence documents the emergence of village complexity in Mainland Southeast Asia and a durable technological base later societies inherited."
    },
    {
        "name": "Raktamaritika",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "Siam"
            }
        ],
        "upgradesFrom": [
            "Ban Chiang"
        ],
        "category": "Major",
        "description": "Raktamaritika, often identified with Sanskrit Raktamrttika, is the Red Earth polity known to Chinese sources as Chi Tu. It flourished between the 2nd and 7th centuries CE on the northeast Malay Peninsula and lower Kra Isthmus, controlling ports on the Gulf of Thailand. Its rulers managed maritime routes linking India, the Malay world, and the lower Chao Phraya. Trade involved beads, camphor, aromatic woods, gold, and iron, carried by regional shipping and foreign merchants.\n\nEpigraphic and art historical traces point to early Buddhist patronage and Indic cultural forms circulating through its harbors. Mon and Khmer spheres to the north felt these currents, which fed into the Dvaravati cultural zone. The Red Earth network preceded Tai state formation yet helped shape the religious and commercial environment that later Sukhothai and Ayutthaya exploited. By the late 7th century it was eclipsed as Srivijaya rose and as inland centers consolidated power along the Chao Phraya basin."
    },
    {
        "name": "Sukhothai",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "Siam"
            }
        ],
        "upgradesFrom": [
            "Raktamaritika"
        ],
        "category": "Major",
        "description": "Sukhothai emerged in the early 13th century as Tai elites consolidated power in the upper Chao Phraya basin amid the retreat of Khmer authority. The dynasty founded by Si Inthrathit expanded under Ramkhamhaeng, who organized a mandala of dependent mueang across the Ping, Yom, and Nan valleys. Court patronage favored Sri Lankan Theravada Buddhism, which reshaped monastic organization and material culture. City planning used earthen walls, moats, and reservoirs that stabilized agriculture.\n\nA literate court produced inscriptions in a Thai script linked to Ramkhamhaeng’s reign. Kilns at Si Satchanalai and Sukhothai exported high fired stoneware known as Sangkhalok across Mainland and Island Southeast Asia. After the mid 14th century, Sukhothai’s autonomy waned as Ayutthaya expanded. By 1438 the polity was integrated as a major province under Ayutthayan princes, with its religious centers and craft industries continuing to supply manpower, ceramics, and cultural forms. Sukhothai’s administrative templates and monastic links endured inside the larger Siamese state."
    },
    {
        "name": "Ayutthaya",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "Siam"
            }
        ],
        "upgradesFrom": [
            "Sukhothai"
        ],
        "category": "Major",
        "description": "Ayutthaya was founded in 1351 on an island at the confluence of the Chao Phraya tributaries. It grew into the dominant power of central Mainland Southeast Asia until its fall in 1767. The kingdom absorbed Sukhothai’s territories, reorganized administration under the sakdina hierarchy, and fielded armies through corvée and tributary duties. King Trailok instituted durable central offices. King Naresuan secured independence after the Burmese invasions of the late 16th century.\n\nThe capital developed into a cosmopolitan entrepôt. Chinese junks, Malay and Persian merchants, Portuguese and later Dutch, English, and Japanese communities operated licensed quarters. Court diplomacy reached Mughal India, Japan, and Bourbon France, notably during King Narai’s reign. Rice exports, forest goods, and ceramics financed palatial and monastic construction, while law, ritual, and chronicles were systematized.\n\nAyutthaya fought recurrent wars with Lan Na, Lan Xang, Cambodia, and Burma. The Konbaung Burmese sack in 1767 destroyed the capital, but elite lineages, artisans, archives, and religious relics were evacuated or rebuilt. Thonburi and then Bangkok governments reconstituted institutions on Ayutthayan models, ensuring strong continuity in law, administration, and culture within the Siamese polity."
    },
    {
        "name": "Siam",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "Siam"
            }
        ],
        "upgradesFrom": [
            "Ayutthaya"
        ],
        "category": "Major",
        "description": "Siam survived the 1767 catastrophe by rapid reunification under Thonburi (1768–1782) and consolidation by the Chakri dynasty at Bangkok from 1782. Early reigns restored monastic orders, codified Ayutthayan jurisprudence in the Three Seals Law of 1805, and secured frontiers against Burma, Laos, and Cambodia. The Bowring Treaty of 1855 and related accords opened trade and constrained tariffs, while Kings Mongkut and Chulalongkorn pursued administrative centralization, abolition of corvée and slavery, legal and fiscal reform, and the building of telegraph, railways, and modern schools. Territorial concessions in Laos, Cambodia, and the Malay states preserved independence between British and French empires.\n\nThe 1932 revolution ended absolute monarchy and introduced constitutional rule. The country adopted the name Thailand in 1939, briefly reverted to Siam in 1945, and readopted Thailand in 1949. World War II alignment with Japan was followed by a US oriented Cold War posture. Export led growth transformed the economy after the 1960s, with manufacturing, agribusiness, and tourism leading. The 1997 Asian financial crisis spurred regulatory change. Politics since 2006 have seen repeated polarization and coups, yet the constitutional monarchy endures. Thailand is a founding member of ASEAN and a regional manufacturing and logistics hub."
    },
    {
        "name": "Iceni",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "Britain"
            }
        ],
        "category": "Major",
        "description": "The Iceni were a Late Iron Age people of eastern Britain, centered in modern Norfolk and north Suffolk. Before Rome they minted distinctive gold and silver coins and produced fine torcs, seen in the Snettisham hoards. Their society was led by regional elites and linked to Belgic and North Sea trade.\n\nAfter the Roman invasion of 43 CE, the Iceni became a client kingdom under Prasutagus. On his death, Roman seizures and abuses triggered the revolt led by Boudica in 60–61. The uprising destroyed Colchester, London, and St Albans before defeat by Suetonius Paulinus. Rome then reorganized the region as the civitas of the Iceni, with its center at Venta Icenorum near Caistor St Edmund. Over the next centuries, rural estates, pottery industries, and roads integrated the area into Roman Britain’s economy and administration."
    },
    {
        "name": "Anglo-Saxon",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "Britain"
            }
        ],
        "upgradesFrom": [
            "Iceni"
        ],
        "category": "Major",
        "description": "After Rome’s withdrawal in the early 5th century, migrants from the Angles, Saxons, and Jutes settled across lowland Britain, including former Iceni lands. By the 7th century, kingdoms such as Northumbria, Mercia, and Wessex dominated. Missionaries from Rome and Ireland converted rulers and founded bishoprics. New monasteries fostered learning and art, as at Lindisfarne and Canterbury. Old English law codes, poetry, and charters recorded rulership and landholding.\n\nViking raids and settlements reshaped politics. Alfred of Wessex built fortified burhs and a fleet, stabilizing resistance. His successors reconquered the Danelaw and standardized administration through shires and hundreds. In 927, Athelstan achieved a single kingship of the English. Tenth‑century reforms strengthened coinage and royal justice. The 11th century saw prosperity, but crisis followed renewed Scandinavian claims. The defeat at Hastings in 1066 ended Anglo‑Saxon rule and opened the way for Norman transformation."
    },
    {
        "name": "Norman",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "Britain"
            }
        ],
        "upgradesFrom": [
            "Anglo-Saxon"
        ],
        "category": "Major",
        "description": "The Norman Conquest of 1066 imposed a new elite on England and reoriented the realm toward northern France. William I confiscated lands and granted them to Norman followers, creating a tightly held feudal aristocracy. Stone castles and Romanesque churches altered the landscape. The Domesday Survey of 1086 assessed wealth and obligations with unusual precision.\n\nRoyal government expanded. The chancery issued writs in Latin, and the exchequer refined fiscal oversight. Ecclesiastical reform aligned English church structures with continental practice. Under William II and Henry I, royal justice and itinerant courts developed. Anglo‑Norman culture blended French, Latin, and English, while the peasantry bore heavy dues. Wales was pressed by marcher lords, and the conquest of Ireland began in 1169 under Norman magnates, later under Angevin kings. Dynastic crisis in 1135–1154 exposed the limits of baronial power. The accession of Henry II in 1154 initiated wider Plantagenet rule on Norman foundations."
    },
    {
        "name": "England",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "Britain"
            }
        ],
        "upgradesFrom": [
            "Norman"
        ],
        "category": "Major",
        "description": "Under the Plantagenets, the Kingdom of England evolved durable institutions. Magna Carta (1215) constrained royal authority. Common law, juries, and the eyre circuit structured justice. Parliament emerged from thirteenth‑century assemblies of nobles, prelates, and towns. War with France shaped taxation, the navy, and strategy during the Hundred Years’ War. The Black Death transformed demography and labor. The Wars of the Roses (1455–1487) ended with Tudor consolidation.\n\nThe Tudors centralized rule and broke with Rome. The English Reformation created a national church and redirected monastic wealth. Maritime ventures expanded under Elizabeth I, laying bases for later empire. The Stuarts faced fiscal and religious conflict, producing civil wars, a republic, and restoration. The Glorious Revolution of 1688 secured parliamentary supremacy and a Bill of Rights. Scientific and literary culture flourished around the Royal Society and the printing trade. In 1707, union with Scotland created the Kingdom of Great Britain."
    },
    {
        "name": "Britain",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "Britain"
            }
        ],
        "upgradesFrom": [
            "England"
        ],
        "category": "Major",
        "description": "Formed in 1707, the Kingdom of Great Britain unified England and Scotland; in 1801 it became the United Kingdom with Ireland. Rapid industrialization from the late eighteenth century created coal, iron, and textile heartlands, powered by steam. Engineers and entrepreneurs built canals, railways, and global shipping networks. Naval strength underpinned victories against Napoleonic France and secured far‑flung trade. Parliament reformed representation, expanded the franchise, and abolished the slave trade (1807) and slavery (1833).\n\nIn the twentieth century, Britain fought two world wars, developed radar and codebreaking, and founded the welfare state and National Health Service. Decolonization after 1945 reshaped global ties; the Commonwealth offered a new framework. Immigration from Europe, the Caribbean, South Asia, and Africa altered society and culture. Devolution created legislatures in Scotland, Wales, and Northern Ireland, where the 1998 Good Friday Agreement ended most conflict. After joining the European Communities in 1973, the UK left the EU in 2020. Today Britain is a service‑led economy with strengths in finance, life sciences, and creative industries, facing challenges of productivity, regional inequality, and constitutional debate."
    },
    {
        "name": "Celts",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "France"
            }
        ],
        "category": "Major",
        "description": "The Celts were diverse Iron Age peoples of central and western Europe, rooted in Late Bronze Age traditions. The Hallstatt culture (c. 800–450 BCE) and La Tène culture (c. 450–50 BCE) define their archaeology. They farmed mixed crops and livestock, mined salt and iron, and maintained long-distance trade networks that linked the Atlantic to the Mediterranean. Hillforts and oppida dominated key landscapes. Metalworkers produced fine weapons, harness, and personal ornaments. Chariotry, clientage, and warrior elites shaped society. Druids maintained oral law and ritual.\n\nCeltic groups expanded into Iberia, Gaul, Britain, Ireland, northern Italy, the Balkans, and Anatolia, where Galatia formed. They interacted with Greeks, Etruscans, and Romans as traders and mercenaries. Many communities minted coinage and adopted writing via Greek and Latin scripts. Roman conquest transformed most continental regions, but languages and traditions endured in Ireland, Britain, and Armorica. In Gaul, these foundations framed the later history of the Gauls."
    },
    {
        "name": "Gauls",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "France"
            }
        ],
        "upgradesFrom": [
            "Celts"
        ],
        "category": "Major",
        "description": "The Gauls were Celtic-speaking societies of Iron Age and early Roman Gaul, spanning much of present-day France, Belgium, and parts of Switzerland and northern Italy. Tribal polities such as the Aedui, Arverni, and Sequani formed alliances and rivalries. Oppida like Bibracte and Avaricum anchored craft production and exchange. Trade through Massalia moved wine, ceramics, and metals. Local mints issued coinage. Artisans excelled in smithing, glassworking, and fine bronzes.\n\nRoman expansion reshaped the region. Julius Caesar campaigned from 58 to 50 BCE, defeating Vercingetorix at Alesia after setbacks at Gergovia. Southern Gallia Narbonensis had already been organized as a province. Under the empire, roads, cities, and sanctuaries multiplied. Lugdunum became a major administrative and minting center. Latin spread while Gallo-Roman identities formed. Christianity took hold by the third and fourth centuries. Prosperous provincial elites integrated into imperial structures, creating the social and economic base that the Franks would later inherit."
    },
    {
        "name": "Franks",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "France"
            }
        ],
        "upgradesFrom": [
            "Gauls"
        ],
        "category": "Major",
        "description": "The Franks arose along the Rhine in late antiquity, serving as federates under Rome before establishing rule in Gaul. Clovis I unified much of northern Gaul by 511 and allied the dynasty with Catholic bishops. Merovingian power relied on royal estates and assemblies but waned as mayors of the palace dominated. Charles Martel restructured cavalry levies, and his son Pippin III claimed the crown in 751 with papal backing. Under Charlemagne, the Carolingian Empire stretched across western Europe, promoted the Carolingian Renaissance, and fostered administrative literacy. The empire fractured in the ninth century, with West Francia forming the basis of the French kingdom. Capetian kings from 987 gradually extended their domain through conquest and marriage, while Gothic cathedrals and universities marked cultural life. Conflicts with England culminated in the Hundred Years’ War, ending in 1453 with French victory. By the sixteenth century, France confronted internal religious wars, Habsburg rivalry, and participation in the Thirty Years’ War, emerging as a leading continental power."
    },
    {
        "name": "France (Kingdom)",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "France"
            }
        ],
        "upgradesFrom": [
            "Franks"
        ],
        "category": "Major",
        "description": "From the later Valois and Bourbon dynasties, France consolidated as a centralized monarchy. The sixteenth century saw both Renaissance culture and violent conflict between Catholics and Huguenots, ending with the Edict of Nantes (1598). Bourbon rulers strengthened fiscal systems, standing armies, and overseas trade. Under Louis XIII and his minister Richelieu, France expanded its role in the Thirty Years’ War, while Louis XIV embodied absolutism at Versailles, waged wars of expansion, and enforced Catholic uniformity after revoking the Edict of Nantes. His successors inherited a complex bureaucracy, colonial possessions in the Americas and Asia, and mounting debt from near-constant warfare. Eighteenth-century intellectual life was shaped by the Enlightenment, as salons and publications debated reason, rights, and state reform. Fiscal crisis, social tensions, and defeat in the Seven Years’ War sharpened calls for change. By 1789, monarchy and aristocracy faced collapse, as revolution overthrew the Bourbon state and laid foundations for modern France."
    },
    {
        "name": "France (Modern)",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "France"
            }
        ],
        "upgradesFrom": [
            "France (Kingdom)"
        ],
        "category": "Major",
        "description": "Modern France was forged by the Revolution and Napoleonic reforms. The First Republic mobilized mass armies and recast law and property. Napoleon Bonaparte centralized administration through prefectures, stabilized finance with the Banque de France, and promulgated the Civil Code. After 1815 the Restoration and July Monarchy balanced crown and public life. The 1848 revolution created universal male suffrage and the Second Republic. The Second Empire accelerated railways and urban redesign under Haussmann.\n\nDefeat in 1870 created the Third Republic. It built secular schools, expanded colonial rule in Africa and Indochina, and faced the Dreyfus Affair. France endured the Western Front in 1914–1918 and emerged victorious but scarred. In 1940 the state collapsed before Germany. Vichy governed part of the country while the Resistance and Free French fought on. Liberation in 1944 restored republican institutions and social insurance.\n\nThe Fourth Republic rebuilt the economy, launched European integration, and struggled with decolonization. The Fifth Republic from 1958 strengthened the presidency and developed independent nuclear forces. Postwar industry produced the TGV, Airbus, and Ariane. Since the 1990s France has deepened EU ties, adopted the euro, and faced globalization, migration, and terrorism. A nuclear sector shapes energy policy. Culture, science, and heritage remain central to national influence."
    },
    {
        "name": "Germanic",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "Germany"
            }
        ],
        "category": "Major",
        "description": "The Germanic peoples emerged from the Nordic Bronze Age and early Iron Age cultures of Scandinavia and northern Germany. By the first millennium BCE, the Jastorf culture marked a coherent material horizon and a distinct Proto-Germanic language community. Longhouses, ironworking, and boat use supported mixed farming and maritime trade. The amber routes linked the Baltic to the Mediterranean.\n\nContact with Celts and then Rome intensified from the second century BCE. Groups such as the Cimbri and the Teutones moved south and fought Rome. Roman authors, including Tacitus, described social structures based on assemblies, warrior elites, and customary law. The runic script appeared in the second century CE. In the Roman and Migration periods, Germanic groups expanded across continental Europe and Britain. These movements produced new identities, including Goths, Vandals, and Saxons. Their political experiments, legal customs, and martial skills shaped Late Antiquity and laid foundations for early medieval polities."
    },
    {
        "name": "Goths",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "Germany"
            }
        ],
        "upgradesFrom": [
            "Germanic"
        ],
        "category": "Major",
        "description": "The Goths formed an East Germanic grouping known archaeologically through the Wielbark culture near the lower Vistula. By the third century CE they moved toward the Black Sea and built the Chernyakhov cultural zone. They organized as Tervingi and Greuthungi and pressed the Roman Danube frontier. The defeat of a Roman army at Adrianople in 378 marked a turning point.\n\nUnder Alaric, Visigothic forces entered Italy and sacked Rome in 410. A Visigothic kingdom developed from Toulouse to Hispania and issued the Codex Euricianus. Catholic conversion in 589 integrated Hispania with wider Latin Christendom. The Ostrogoths ruled Italy under Theoderic the Great from Ravenna and balanced Roman administration with Gothic military authority. Justinian’s wars ended their kingdom by 553, though Gothic communities persisted, including in Crimea. Gothic law, foederati arrangements, and mobile heavy cavalry influenced post-Roman statecraft."
    },
    {
        "name": "Teutonic Order",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "Germany"
            }
        ],
        "upgradesFrom": [
            "Goths"
        ],
        "category": "Major",
        "description": "The Teutonic Order was a German military-hospital brotherhood founded in Acre around 1190 and recognized as a military order in 1198. After brief activity in Transylvania, the Order accepted Duke Konrad of Masovia’s invitation and launched the Prussian Crusade from the 1230s. It subdued Old Prussian groups, built a dense castle network, and planted towns with Magdeburg law. Marienburg served as the capital. Trade flowed through Hanseatic ports, while a clerical-knightly elite ruled a monastic state.\n\nThe Order fought Poland-Lithuania and suffered a decisive defeat at Tannenberg\/Grunwald in 1410. The Thirteen Years’ War led to the Second Peace of Thorn in 1466. Royal Prussia passed to the Polish Crown, and the remaining Order held lands as a Polish fief. In 1525 Grand Master Albert secularized the Prussian branch as the Duchy of Prussia. The Livonian branch collapsed by 1561. These transformations opened the path to Hohenzollern rule."
    },
    {
        "name": "Prussia",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "Germany"
            }
        ],
        "upgradesFrom": [
            "Teutonic Order"
        ],
        "category": "Major",
        "description": "The Duchy of Prussia arose in 1525 from the secularization of the Teutonic Order’s Prussian lands by Albert of Brandenburg-Ansbach. In 1618 it entered personal union with the Hohenzollern Electorate of Brandenburg. The Great Elector Frederick William forged a fiscal-military state, promoted religious refugees, and built a standing army. In 1701 Elector Frederick crowned himself King in Prussia at Königsberg.\n\nFrederick II modernized administration, law, and agriculture and made Prussia a great power through the Silesian Wars and the Seven Years’ War. After 1806, the Stein–Hardenberg reforms abolished serfdom and reorganized the state and army. The 1815 settlement added the Rhineland and Ruhr, enabling industrial growth. Prussia led the Zollverein and defeated Austria in 1866, creating the North German Confederation. In 1871, after victory over France, Prussia engineered German unification under Hohenzollern leadership, transferring primacy to the new empire while retaining dominant influence."
    },
    {
        "name": "Germany",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "Germany"
            }
        ],
        "upgradesFrom": [
            "Prussia"
        ],
        "category": "Major",
        "description": "The German Empire (1871) unified diverse states under Prussian leadership. Rapid industrialization followed, centered in the Ruhr and Saxony. Bismarck built social insurance and balanced great-power diplomacy. Defeat in 1918 ended the monarchy. The Weimar Republic saw cultural innovation and severe crises. The Nazi dictatorship seized power in 1933, launched aggressive war, and carried out genocide. Germany’s defeat in 1945 brought occupation and partition.\n\nIn 1949 the Federal Republic of Germany formed in the west and the German Democratic Republic in the east. West Germany experienced the Wirtschaftswunder, anchored itself in NATO and the European Communities, and pursued social market policies. Ostpolitik reduced tensions. The 1989 revolution and 1990 unification restored a single state. Germany adopted the euro, hosts the European Central Bank, and drives EU policy. It built an export economy based on engineering, chemicals, and autos. Recent decades feature the Energiewende, digitalization efforts, and a security “Zeitenwende” after 2022. Germany is a federal parliamentary democracy with a central role in European integration."
    },
    {
        "name": "Vinca",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "Yugoslavia"
            }
        ],
        "category": "Major",
        "description": "The Vinča culture (c. 5700–4500 BCE) occupied the central Balkans, with large tell settlements along the Danube and Morava, centered at Vinča–Belo Brdo near modern Belgrade. Communities built dense houses on timber platforms. They practiced mixed farming, with cattle, pigs, and emmer, and managed long-distance exchange in obsidian, Spondylus shell, and copper ores. Vinča potters produced burnished wares and anthropomorphic figurines with standardized motifs. Incised sign systems appear on pottery and figurines; their function remains debated, but they show complex marking practices. Vinča sites yield early evidence for copper metallurgy in Europe, including smelting and casting.\n\nPopulation densities were high for Neolithic Europe. Settlement hierarchies and craft specialization grew across phases A–D. Around the late fifth millennium BCE the system unraveled, likely due to resource stress, social competition, and shifting trade routes. Cultural elements fed into the subsequent Balkan Copper Age networks that bridged the Carpathian Basin and the Aegean."
    },
    {
        "name": "Thracian",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "Yugoslavia"
            }
        ],
        "upgradesFrom": [
            "Vinca"
        ],
        "category": "Major",
        "description": "The Thracians were an Indo-European constellation of tribes in the eastern Balkans from the Late Bronze Age through the Roman era. The Odrysian Kingdom (5th–3rd centuries BCE) unified much of Thrace between the Danube, Balkan Mountains, and the Aegean. Thracian elites engaged with Achaemenid Persia, classical Greek cities, and Macedon. Rich tumulus burials at Kazanlak, Sveshtari, and Panagyurishte display advanced goldsmithing, cavalry gear, and ritual architecture. Thracian infantry and horsemen served as mercenaries across the Mediterranean.\n\nThrace was contested by Philip II and Alexander, then absorbed into Hellenistic spheres. Rome established the provinces of Thracia and Moesia in the 1st century CE, integrating Thracian soldiers into auxiliary units and municipal life. The Thracian language persisted into late antiquity but eventually disappeared under Latin, Greek, and later Slavic layers. Material culture and toponyms survived in the medieval Balkans. The region’s road network, mining districts, and urban layouts shaped subsequent Bulgarian and Byzantine administration."
    },
    {
        "name": "Bulgaria",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "Yugoslavia"
            }
        ],
        "upgradesFrom": [
            "Thracian"
        ],
        "category": "Major",
        "description": "The Bulgarians formed a medieval state south of the Danube in 681 under Khan Asparuh, after alliances of Bulgar groups with Slavic communities. The First Bulgarian Empire challenged Byzantium for centuries, winning recognition and territory. Khan Krum reformed law and administration. Christianization under Boris I (864) anchored the church and diplomacy. Simeon I (893–927) oversaw a cultural apex, with Preslav and Ohrid schools developing Old Church Slavonic and the literary standards that led to the Cyrillic script. Bulgaria became a Slavic liturgical center for Eastern Europe. Old Church Slavonic and Cyrillic spread into Serbia, Rus', and Wallachia.\n\nByzantium conquered the realm in 1018. The Second Bulgarian Empire arose in 1185 under the Asen brothers, with capitals at Tarnovo and Preslav. Kaloyan defeated the Latin Empire at Adrianople (1205). Ivan Asen II expanded trade along the Danube and the Aegean routes and issued stable coinage. Monastic culture, wall painting, and law codes flourished. Ottoman expansion ended the empire by 1396. Bulgarian elites and church structures survived under Ottoman rule, setting conditions for the later National Revival, schooling in Church Slavonic and modern Bulgarian, and the emergence of autonomous ecclesiastical institutions."
    },
    {
        "name": "Serbia",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "Yugoslavia"
            }
        ],
        "upgradesFrom": [
            "Bulgaria"
        ],
        "category": "Major",
        "description": "Serbia’s medieval heritage under the Nemanjić dynasty (12th–14th centuries) provided legal and ecclesiastical frameworks that endured Ottoman rule. The Patriarchate of Peć and monastic networks maintained Serbian liturgy, law, and education. In 1804 the First Serbian Uprising under Karađorđe established a revolutionary administration in Šumadija. After setbacks, the Second Uprising (1815) led by Miloš Obrenović secured autonomy within the Ottoman Empire. A charter in 1830 recognized Serbian self-government and church independence. The Civil Code of 1844, new schools, and printing presses fostered modernization. The Belgrade–Niš railway opened in 1884.\n\nInternational recognition came at the Congress of Berlin (1878). Serbia became a kingdom in 1882. Constitutional competition between the Obrenović and Karađorđević dynasties shaped politics. Expansion during the Balkan Wars (1912–1913) reunited Kosovo and parts of Macedonia with Serbia. By 1914 the state fielded a modern army and administration. Serbian institutions and cadres would frame the creation of a South Slavic state after the First World War."
    },
    {
        "name": "Yugoslavia",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "Yugoslavia"
            }
        ],
        "upgradesFrom": [
            "Serbia"
        ],
        "category": "Major",
        "description": "Yugoslavia emerged in 1918 as the Kingdom of Serbs, Croats, and Slovenes, uniting South Slavic lands under the Karađorđević dynasty. It pursued land reform, railway construction, and tariff protection, but struggled with federal arrangements and ethnic disputes. Renamed the Kingdom of Yugoslavia in 1929, it adopted royal dictatorship, then limited constitutionalism. Axis powers invaded in 1941. Resistance coalesced around the Partisans who formed a federal vision at AVNOJ in 1943. The Socialist Federal Republic of Yugoslavia took shape in 1945 under Josip Broz Tito. It broke with Stalin in 1948, pioneered worker self-management, and co-founded the Non-Aligned Movement in 1961. Industrial growth, mass electrification, and the Adriatic tourism sector integrated republics with shared infrastructure.\n\nAfter Tito’s death in 1980, debt, inflation, and constitutional paralysis eroded cohesion. Between 1991 and 1995 the federation dissolved through wars in Croatia and Bosnia. A reduced Federal Republic of Yugoslavia (Serbia and Montenegro) persisted until 2003, followed by the State Union and peaceful Montenegrin independence in 2006. Kosovo declared independence in 2008. Today, successor states pursue EU and NATO paths at different speeds, cooperate in trade and energy, and manage legacies through regional initiatives and international justice."
    },
    {
        "name": "Kemet",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Egypt"
            }
        ],
        "category": "Major",
        "description": "Kemet denotes the Nile Valley civilization from predynastic communities to the Late Period. Unified c. 3100 BCE under a divine kingship, it developed hieroglyphic writing, a centralized bureaucracy, and monumental stone architecture. Old Kingdom pyramid complexes and Middle Kingdom irrigation and legal reforms anchored state power. New Kingdom armies projected rule into Nubia and the Levant, while temples at Karnak and Luxor integrated cult, economy, and record-keeping. Mathematics, medicine, and calendar astronomy advanced in service of administration and ritual.\n\nAgriculture organized around the Nile flood sustained dense settlement and craft specialization. The state managed labor corvée, grain storage, and long-distance trade for copper, timber, and incense. From the 1st millennium BCE, Libyan, Kushite, Assyrian, and Persian dynasties ruled at times, yet priestly estates and local elites preserved institutional continuity. After Alexander’s conquest in 332 BCE, Macedonian rule framed the transition to the Hellenistic Ptolemaic kingdom, which retained Egyptian cult and tax structures while reshaping them under Greek elites."
    },
    {
        "name": "Ptolemaic",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Egypt"
            }
        ],
        "upgradesFrom": [
            "Kemet"
        ],
        "category": "Major",
        "description": "Founded by Ptolemy I after Alexander’s death, the Ptolemaic Kingdom (323–30 BCE) governed Egypt as a Hellenistic monarchy centered on Alexandria. The court patronized scholarship at the Mouseion and Library, advanced koine Greek administration, and cultivated syncretic royal cult with Egyptian priesthoods. State monopolies managed papyrus, oil, and textile production; coinage reforms and irrigation works increased revenues and grain exports across the Mediterranean.\n\nGreek settler garrisons and cleruchic land grants secured the countryside, while temples remained key fiscal nodes. Revolts by Egyptian subjects and rival claimants, especially in the 2nd century BCE, weakened cohesion. Diplomatic ties with Rome deepened as Seleucid competition and dynastic strife grew. The Rosetta decree (196 BCE) exemplifies bilingual governance balancing Greek and Egyptian elites. Cleopatra VII’s alliance with Julius Caesar and Mark Antony failed after Actium (31 BCE). In 30 BCE Octavian annexed Egypt as an imperial domain, integrating its wealth and scribal systems into the Roman economy and administration."
    },
    {
        "name": "Ayyubid",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Egypt"
            }
        ],
        "upgradesFrom": [
            "Ptolemaic"
        ],
        "category": "Major",
        "description": "Established by Salah al-Din (Saladin) in 1171 after ending the Fatimid caliphate, the Ayyubid dynasty reoriented Egypt to Sunni orthodoxy and Syrian politics. Cairo became a base for campaigns against Crusader states. The dynasty took Jerusalem in 1187, negotiated truces with European monarchs, and fortified the Red Sea routes. The Cairo Citadel, madrasas, and hospitals reflected new patronage patterns and juristic networks.\n\nThe Ayyubids employed Kurdish and Turkic commanders and large contingents of mamluk troops. They fostered trade with Yemen and Nubia, while maintaining Nile taxation and iqta’ grants. After Saladin’s death, the realm fragmented among relatives ruling in Cairo, Damascus, and Aleppo. Egyptian rulers remained pivotal due to grain revenues and fleet resources. In 1250, palace and field regiments deposed the last Ayyubid sultan in Egypt, establishing Mamluk rule. Ayyubid branches survived in Syria for a decade, but Mongol pressure and Egyptian dominance shifted leadership of the eastern Mediterranean to Cairo."
    },
    {
        "name": "Mamluk",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Egypt"
            }
        ],
        "upgradesFrom": [
            "Ayyubid"
        ],
        "category": "Major",
        "description": "The Mamluk Sultanate (1250–1517) arose from elite military households. The Bahri regime of Kipchak mamluks stabilized Egypt, repelled the Mongols at Ayn Jalut in 1260, and expelled the last Crusader strongholds by 1291. Iqta’-funded cavalry, a disciplined barracks system, and control of pilgrimage and caravan routes underpinned power. Cairo grew into a hub linking Mediterranean, Red Sea, and Indian Ocean trade, taxing spices and sugar.\n\nFourteenth-century plague waves reduced population yet spurred new endowments and urban rebuilding. Monumental architecture, such as the complexes of Sultan Qalawun and Sultan Hasan, expressed piety and state authority. The later Burji dynasty of Circassian mamluks faced fiscal strain, Tamerlane’s devastation of Syria, and Portuguese diversion of the spice trade around Africa. Administrative adaptation could not offset revenue loss and gunpowder disparities. Ottoman armies defeated the sultanate at Marj Dabiq (1516) and Ridaniyya (1517). The sultanate ended, though Mamluk beys continued to wield influence under Ottoman suzerainty, setting conditions for later reformist rule."
    },
    {
        "name": "Egypt",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Egypt"
            }
        ],
        "upgradesFrom": [
            "Mamluk"
        ],
        "category": "Major",
        "description": "After the Ottoman conquest, Egypt remained an imperial province where Mamluk beys contended for power. The French expedition (1798–1801) disrupted this order. Muhammad Ali seized authority in 1805, building a conscript army, schools, and factories. Cotton monoculture, irrigation, and monopolies funded expansion into Sudan, the Hijaz, and Syria until European pressure curtailed ambitions in 1840. The Khedivate (from 1867) pursued railways and the Suez Canal (opened 1869), but debt triggered British occupation in 1882. Nationalist agitation led to nominal independence in 1922 and a limited constitutional monarchy.\n\nThe Free Officers ended the monarchy in 1952. Under Gamal Abdel Nasser, Egypt nationalized the canal, built the Aswan High Dam, and advanced land reform and import substitution; defeat in 1967 reshaped policy. Anwar Sadat won ground in 1973, signed peace with Israel, and opened the economy. Hosni Mubarak oversaw stability and gradual privatization amid demographic growth. The 2011 uprising led to a brief Islamist presidency and the rise of Abdel Fattah el-Sisi in 2013. Contemporary Egypt emphasizes state-led infrastructure, energy projects, and security partnerships, while managing Nile water diplomacy and a diversified, service-led economy anchored by the canal and remittances."
    },
    {
        "name": "Elam",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Iran"
            }
        ],
        "category": "Major",
        "description": "Elam was a Bronze and early Iron Age civilization in southwestern Iran, centered on Susa and Anshan. It emerged by the late third millennium BCE and interacted with Sumer, Akkad, and Babylon through trade, diplomacy, and war. Rulers such as Shutruk-Nahhunte campaigned in Mesopotamia and carried prestigious monuments to Susa. Elamite kingship often took a federated form, and the Elamite language maintained its own script traditions, including Linear Elamite and later Akkadian cuneiform.\n\nElam built monumental complexes such as Chogha Zanbil, advanced bronze metallurgy, and produced fine textiles. Despite Assyrian and Babylonian pressures, Elamite polities persisted into the sixth century BCE. Cyrus II incorporated Elam in 539 BCE; Elamite remained an administrative language of the early Achaemenid chancery. Elamite religious, artistic, and bureaucratic elements helped shape the emerging imperial Persian order."
    },
    {
        "name": "Persia",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Iran"
            }
        ],
        "upgradesFrom": [
            "Elam"
        ],
        "category": "Major",
        "description": "The Achaemenid Empire arose under Cyrus II (c. 550 BCE), who unified Persis and Media and conquered Lydia and Babylonia. Darius I expanded to Egypt and the Indus and regularized imperial governance. The state created satrapies, built the Royal Road, standardized weights and coinage (the daric), promoted qanat irrigation, and used Aramaic and Elamite in its chancery. Monumental centers at Pasargadae, Susa, and Persepolis expressed a composite imperial art and administration.\n\nThe empire managed diverse populations with local autonomy under centralized oversight. It fought the Greek city-states in the early fifth century BCE and later faced internal rivalries. Alexander of Macedon overthrew it in 330 BCE, but Achaemenid institutions endured under Seleucid and Parthian rule. The Achaemenid synthesis integrated Elamite traditions and set durable models for taxation, roads, archives, and frontier policy that later Iranian states adapted."
    },
    {
        "name": "Sasanian",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Iran"
            }
        ],
        "upgradesFrom": [
            "Persia"
        ],
        "category": "Major",
        "description": "The Sasanian Empire (224–651 CE) replaced the Arsacid Parthians when Ardashir I consolidated power in Fars and seized Ctesiphon. It built a centralized monarchy allied to a structured Zoroastrian clergy, codified taxation and law, and fostered urban growth. Shapur I defeated Rome and captured Emperor Valerian. Khosrow I carried out fiscal and military reforms, patronized philosophy and medicine, and strengthened frontier defenses from the Caucasus to the Gulf.\n\nSasanian Iran was a Silk Road power with refined silverwork, stucco, and textiles. The academy and hospital at Gundeshapur became a conduit for Greek, Indian, and Persian learning. Prolonged wars with Byzantium, plague, and internal strife weakened the state after Khosrow II’s peak. Arab-Muslim armies ended the empire by 651. Sasanian administrative practice, court culture, and law shaped early caliphal governance and the Persianate traditions of the Islamic era."
    },
    {
        "name": "Safavid",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Iran"
            }
        ],
        "upgradesFrom": [
            "Sasanian"
        ],
        "category": "Major",
        "description": "The Safavid dynasty (1501–1736) reestablished a centralized Iranian monarchy and made Twelver Shi‘ism the state creed, a defining shift for later Iran. Shah Ismail I captured Tabriz and claimed the shahanshah title. The state balanced Turkic Qizilbash elites with a ghulam corps and Persian bureaucrats. Under Shah Abbas I, the army was reorganized, Isfahan became the capital, and trade routes and caravanserais were secured. Diplomacy with Europe and regulation of the silk trade integrated Iran into early modern commerce.\n\nSafavid Iran produced a major architectural and artistic flowering: the Naqsh-e Jahan complex, urban boulevards, carpets, ceramics, and manuscript arts. The dynasty fought the Ottomans and Uzbeks for frontiers in the Caucasus and Khorasan. Fiscal strain, court factionalism, and provincial revolts led to decline. Isfahan fell to Afghan forces in 1722. Nader Shah restored territorial integrity but ended Safavid rule, opening an era of shifting dynasties."
    },
    {
        "name": "Iran",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Iran"
            }
        ],
        "upgradesFrom": [
            "Safavid"
        ],
        "category": "Major",
        "description": "The modern Iranian state formed after the Safavid collapse through Afsharid and Zand interludes and the Qajar dynasty (1796–1925). Qajar Iran navigated Anglo-Russian rivalry, granted concessions, and saw the Tobacco Protest (1891–92) and the Constitutional Revolution (1905–11), which created a parliament and basic law. Reza Shah Pahlavi (1925–41) centralized authority, built railways, standardized law, and expanded education. Mohammad Reza Shah pursued oil-backed industrialization; the 1951 nationalization under Mossadegh and the 1953 coup reshaped politics. The White Revolution accelerated social change. The 1979 Islamic Revolution ended the monarchy and established the Islamic Republic.\n\nThe Iran–Iraq War (1980–88) devastated the economy but entrenched state institutions. Postwar governments rebuilt industry, expanded petrochemicals, and developed missiles, drones, and a nuclear program. Sanctions and fluctuating oil prices constrained growth and spurred import substitution. The 2015 JCPOA briefly eased tensions; a U.S. withdrawal in 2018 renewed sanctions. Iran projects regional influence through allied groups and maintains active diplomacy. Society is urbanized and educated, with major cinema, literature, and tech sectors and a global diaspora. Elections and civil activism coexist with clerical oversight and internal security control. Protests in 2009 and 2022–23 signaled ongoing debates over governance and social policy."
    },
    {
        "name": "Sumer",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Iraq"
            }
        ],
        "category": "Major",
        "description": "The Sumerians formed the earliest urban civilization in southern Mesopotamia during the 4th–3rd millennia BCE. City-states such as Uruk, Ur, Lagash, and Eridu developed canal irrigation, temple economies, and stratified governance under lugal kings and priestly elites. They devised cuneiform script on clay tablets, cylinder seals, and sexagesimal mathematics used for accountancy, metrology, and early astronomy. Monumental ziggurats, standardized brickwork, and craft industries supported long-distance trade with Dilmun, Magan, and Meluhha. Law and kingship ideology appear in the Code of Ur-Namma and royal hymns; epic tradition coalesced around Gilgamesh. Reforms by rulers like Urukagina and administrative tablets from the Third Dynasty of Ur document centralized labor and taxation. After the Akkadian conquest and later Gutian interlude, Sumerian culture persisted in scholarship and cult until the early second millennium BCE, forming the intellectual substrate of later Akkadian and Babylonian traditions."
    },
    {
        "name": "Babylon",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Iraq"
            }
        ],
        "upgradesFrom": [
            "Sumer"
        ],
        "category": "Major",
        "description": "Babylonian civilization consolidated in central-southern Mesopotamia during the Old Babylonian period (c. 2000–1595 BCE), reaching a peak under Hammurabi. His legal stele codified royal jurisprudence, property rules, and penalties, while canals and fortifications anchored the capital’s authority. Kassite kings then stabilized Babylonia for four centuries, integrating provincial cults and land grants. The Neo-Babylonian revival (626–539 BCE) under Nabopolassar and Nebuchadnezzar II restored imperial power. Major works included the Ishtar Gate, processional way, and the Etemenanki ziggurat; the city became a preeminent urban center. Military campaigns reshaped the Levant, including the 586 BCE capture of Jerusalem and deportations. Babylonian scholars advanced mathematics, astral diaries, and omen compendia that influenced Hellenistic science. The empire fell to Cyrus II in 539 BCE, yet Babylon remained a key administrative and religious hub under Achaemenid and later rulers, preserving learned traditions curated by temple communities."
    },
    {
        "name": "Abbasid",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Iraq"
            }
        ],
        "upgradesFrom": [
            "Babylon"
        ],
        "category": "Major",
        "description": "The Abbasid Caliphate seized power in 750 and founded Baghdad in 762 as its capital on the Tigris. The court fostered a cosmopolitan elite and a fiscal-bureaucratic state that coordinated provinces from Khurasan to the Maghrib. The translation movement and the Bayt al-Hikma created a dense scholarly milieu. Algebra and astronomical tables were systematized by al-Khwarizmi; physicians such as al-Razi advanced clinical method; philosophers and litterateurs developed adab and kalam. Paper manufacturing, book markets, and waqf endowments scaled education and urban institutions. Maritime and caravan trade linked the Gulf to India, East Africa, and China.\n\nFrom the ninth century, civil wars, the mihna, and the Zanj and Qarmatian crises eroded central control. Buyid and then Seljuk military protectors dominated Baghdad, even as the city remained an intellectual pole. Provincial dynasts held de facto autonomy, while the caliphate retained ritual authority. The Mongol sack of 1258 ended Baghdad’s Abbasid regime; successor caliphs survived in Mamluk Cairo with ceremonial claims, while the scholarly corpus and urban crafts endured in dispersed centers."
    },
    {
        "name": "Baghdad Vilayet",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Iraq"
            }
        ],
        "upgradesFrom": [
            "Abbasid"
        ],
        "category": "Major",
        "description": "The Baghdad Vilayet emerged under the Ottoman Vilayet Law of 1864, formalized in 1869 from the earlier Baghdad Eyalet. It covered the Tigris corridor around Baghdad, with sanjaks such as Baghdad, Karbala, and Diwaniya; Basra and Mosul were administered separately. Tanzimat reforms introduced cadastral surveys, conscription, provincial councils, and new courts. Midhat Pasha’s governorship (1869–1872) promoted telegraph lines, steam navigation on the Tigris, agricultural colonization, and attempts to regularize tribal taxation. Infrastructure projects, including canal repair and the Hindiyya barrage works, aimed to control flooding and expand cultivation.\n\nBy the late nineteenth century, European consuls, missionary schools, and Ottoman-German rail ambitions increased external influence. Ottoman authority fluctuated beyond the river towns, where sheikhly networks mediated state power. During the First World War, British-Indian forces advanced from the Gulf, occupied Baghdad in 1917, and dismantled Ottoman administration. The vilayet framework gave way to British military rule and, soon, to the Mandate-era consolidation of an Iraqi state."
    },
    {
        "name": "Iraq",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Iraq"
            }
        ],
        "upgradesFrom": [
            "Baghdad Vilayet"
        ],
        "category": "Major",
        "description": "The modern state of Iraq formed from the former Ottoman vilayets after the 1920 British occupation and League of Nations Mandate. The Hashemite Kingdom gained formal independence in 1932. Coups and army politics culminated in the 1958 revolution and a republican order. The Ba’athists took power in 1968; Saddam Hussein ruled from 1979, centralizing security institutions and the oil economy. The Iran–Iraq War devastated industry and finances. The 1990 Kuwait invasion triggered the 1991 Gulf War and sanctions. State capacity eroded while education and health declined.\n\nIn 2003 a US-led coalition overthrew the regime. A new constitution in 2005 created a federal parliamentary system and recognized the Kurdistan Region. Insurgency and sectarian conflict peaked in 2006–2007. The Islamic State captured Mosul in 2014; Iraqi forces and allies retook major cities by 2017. Iraq remains a major OPEC producer with recurring protests over services, corruption, and jobs. Politics revolve around coalition governments, militia influence, and federal–regional bargaining. Recovery focuses on rebuilding, diversifying beyond oil, and adapting to water scarcity and climate stress across the Tigris–Euphrates basin."
    },
    {
        "name": "Assyria",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Syria"
            }
        ],
        "category": "Major",
        "description": "Assyrian denotes the Middle and Neo-Assyrian polities (c. 1400–612 BCE) that projected power into the Levant. From Tiglath-pileser I onward, Assyrian armies campaigned along the Euphrates and Orontes. Under Tiglath-pileser III, Shalmaneser V, and Sargon II, Aram-Damascus, Hamath, and other Syrian states were annexed. Provinces such as Hatti and Arpad were created, linked by roads and relay stations. The empire employed iron weapons, advanced siegecraft, and mass deportations to integrate elites and labor.\n\nAssyrian rule standardized Aramaic as a chancery language and spread administrative templates later used by Achaemenids and Hellenistic rulers. Monumental art, libraries, and hydraulic works at capitals like Nineveh influenced western Syria through garrisons and governors based in cities such as Aleppo. After the fall to a Median-Babylonian coalition in 612–609 BCE, Assyrian provincial frameworks and the Aramaic lingua franca endured. These set conditions in which later Macedonian and Seleucid authorities could organize northern Syrian urban networks."
    },
    {
        "name": "Seleucia",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Syria"
            }
        ],
        "upgradesFrom": [
            "Assyria"
        ],
        "category": "Major",
        "description": "Seleucid rule arose from the partition of Alexander’s empire. Seleucus I Nicator secured Babylonia in 312 BCE and built a Hellenistic monarchy spanning Anatolia to Iran. In Syria he and his successors founded or refounded cities, notably Antioch on the Orontes, Apamea, Laodicea, and Seleucia Pieria. These cities anchored military settlement and trade. The dynasty fought the Ptolemies in the Syrian Wars and briefly regained a Levantine coastline under Antiochus III.\n\nThe court minted abundant silver tetradrachms, patronized scholarship at Antioch, and maintained road corridors between Mesopotamia and the Mediterranean. Civic institutions blended Greek urban forms with local elites. From the mid-2nd century BCE internal struggles, Roman arbitration, and regional revolts weakened the regime. Pompey annexed Syria as a Roman province in 64–63 BCE. Hellenistic urban grids, coinage standards, and municipal traditions persisted. Antioch remained a governing center into the Roman and later Byzantine periods, bridging to the late antique landscape inherited by early Islamic rulers."
    },
    {
        "name": "Umayyad",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Syria"
            }
        ],
        "upgradesFrom": [
            "Seleucia"
        ],
        "category": "Major",
        "description": "The Umayyad Caliphate (661–750 CE) made Damascus its capital and administered a transcontinental empire. Muʿawiya I consolidated Syrian tribal forces and a navy. Successors extended rule from the Iberian Peninsula to Central Asia. The regime reorganized diwans, introduced bilingual then Arabic-only administration, and reformed coinage. Monumental works included the Great Mosque of Damascus and the Dome of the Rock at Jerusalem. Roads, ribats, and a barid postal network linked provinces to Damascus.\n\nCivil conflict, fiscal strains, and frontier pressures followed under later caliphs. The Marwanid line stabilized parts of the state but could not contain Abbasid opposition. In 750 Abbasid forces took Damascus; the center of gravity shifted to Iraq. In Syria, garrison towns, estates, and irrigation projects endured, and many administrative cadres continued in service. Umayyad statecraft, urban renovation, and the spread of Arabic in chancery and liturgy defined the early Islamic character of Bilad al-Sham and set precedents for later dynasties."
    },
    {
        "name": "Damascus Eyalet",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Syria"
            }
        ],
        "upgradesFrom": [
            "Umayyad"
        ],
        "category": "Major",
        "description": "The Damascus Eyalet was an Ottoman province from 1516 until mid-19th century administrative reforms. After the conquest from the Mamluks, the Porte confirmed urban notables and sufi networks while installing timar-holders and Janissary garrisons. The governor (beylerbeyi) led the annual Hajj caravan to Mecca, provisioning routes across the Syrian Desert. Taxes were farmed to local ayan. Craft guilds and caravan trade linked Damascus with Aleppo, Hama, and the ports of Sidon and Acre.\n\nSeventeenth-century turbulence, Bedouin attacks, and Celali-era migrations altered settlement. In 1831–1840 Egyptian occupation under Muhammad Ali imposed conscription and cadastral surveys. After 1840 Ottoman control resumed. Tanzimat laws reorganized land tenure and courts. The 1864 Vilayet Law replaced the eyalet with the Syria Vilayet centered at Damascus. By the late 19th century railways and steam navigation shifted commerce toward Beirut and Haifa, but Damascus remained a pilgrimage hub and an administrative capital that fed into the late Ottoman reform era."
    },
    {
        "name": "Syria",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Syria"
            }
        ],
        "upgradesFrom": [
            "Damascus Eyalet"
        ],
        "category": "Major",
        "description": "Syria emerged from late Ottoman provinces under the French Mandate after World War I. The short-lived Arab Kingdom of 1920 was followed by the State of Syria under French rule, with borders set apart from Lebanon. Revolts in 1925–1927 and negotiated treaties led to formal independence in 1946. The early republic faced coups and union with Egypt as the United Arab Republic (1958–1961). The Baʿath Party took power in 1963. Hafez al-Assad consolidated an authoritarian republic from 1970, fought Israel in 1973, and accepted Lebanon’s intervention mandate in 1976. The state built irrigation and power projects such as the Tabqa Dam, expanded public education and health, and fostered textiles, fertilizers, and oil.\n\nBashar al-Assad succeeded in 2000. Protests in 2011 escalated into a protracted civil war involving state forces, insurgents, Kurdish-led administrations, ISIS, and foreign militaries. Government regained major cities with Russian and Iranian support; the northeast remains partly autonomous; Idlib hosts opposition factions under Turkish influence. The conflict caused mass displacement, infrastructure loss, and economic contraction under sanctions. Archaeological heritage suffered severe damage. As of the 2020s, the state controls most population centers but faces reconstruction challenges, humanitarian needs, and a stalled political process under UN auspices."
    },
    {
        "name": "Minoan",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Greece"
            }
        ],
        "category": "Major",
        "description": "The Minoan civilization flourished on Crete and nearby islands during the Bronze Age, c. 2000–1450 BCE, with echoes into the 12th century. Palatial centers at Knossos, Phaistos, Malia, and Zakros coordinated a redistributive economy based on maritime trade with Egypt, the Levant, and the Cyclades. Craftsmen produced fine ceramics, metalwork, and sealings; administrators used the still undeciphered Linear A script. Architecture featured multistory complexes, light wells, storerooms, and advanced plumbing. Frescoes depict processions and athletic rituals such as bull-leaping.\n\nNatural disasters and fires punctuated the palatial sequence. The Thera eruption affected networks, though the timing and impact remain debated. After c. 1450 BCE, Mycenaean elites occupied major sites and introduced Linear B for Greek administration. Enduring achievements include Aegean-wide seafaring, complex administrative practices, and an artistic canon that informed later Greek visual culture."
    },
    {
        "name": "Hellenic",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Greece"
            }
        ],
        "upgradesFrom": [
            "Minoan"
        ],
        "category": "Major",
        "description": "The Hellenic world spans the Archaic, Classical, and Hellenistic eras, c. 800–30 BCE. In the Archaic period Greek city-states formed, adopted the alphabet, and founded colonies from the Black Sea to Iberia. Lawgivers such as Solon and Lycurgus shaped civic orders. Panhellenic sanctuaries at Olympia and Delphi fostered shared cults and competition. Hoplite warfare and naval power evolved.\n\nClassical Greece saw the Persian Wars, the rise of Athenian democracy, and Sparta’s rival league. Architecture and sculpture reached canonical forms; the Parthenon and other works anchored a durable aesthetic. Philosophers including Socrates, Plato, and Aristotle systematized ethics, politics, and natural inquiry. Tragedy and comedy matured, while historians like Herodotus and Thucydides created critical narrative.\n\nMacedon unified Greece; Alexander the Great carried Greek arms and culture across the Near East. Hellenistic kingdoms promoted urbanization, scholarship, and exchange. Koine Greek became a lingua franca. Centers such as Alexandria fostered mathematics, astronomy, and medicine through figures like Euclid, Archimedes, and Eratosthenes. Gradual Roman conquest integrated the Greek world into imperial structures."
    },
    {
        "name": "Byzantium (Medieval)",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Greece"
            }
        ],
        "upgradesFrom": [
            "Hellenic"
        ],
        "category": "Major",
        "description": "The Eastern Roman Empire, later known as Byzantium, took shape after the division of the empire in 395 CE, with Constantinople as its capital. Under Justinian I (r. 527–565), the empire briefly reconquered Italy, North Africa, and parts of Spain, while codifying Roman law in the Corpus Juris Civilis. Hagia Sophia and other monumental works reflected state patronage of Christianity, which became the official religion. Successive emperors defended long frontiers against Persians, Avars, and early Islamic caliphates, while maintaining grain supply and gold coinage that underpinned Mediterranean trade. The thematic system linked military service with landholding, sustaining defense and rural settlement. Iconoclasm debates of the eighth and ninth centuries reshaped church and politics until the restoration of icons in 843. By the tenth century, under the Macedonian dynasty, Byzantium expanded into the Balkans and eastern Anatolia, while monasteries and scholars preserved classical texts. This period saw the empire remain a dominant Mediterranean power, balancing Roman traditions with a distinct Orthodox Christian identity."
    },
    {
        "name": "Byzantium (Renaissance)",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Greece"
            }
        ],
        "upgradesFrom": [
            "Byzantium (Medieval)"
        ],
        "category": "Major",
        "description": "From the eleventh century, Byzantium faced mounting pressures. The defeat at Manzikert in 1071 opened Anatolia to Turkish settlement, reducing the empire’s core revenues. The Komnenian emperors stabilized rule through military reforms and diplomacy, but crusader armies traversed and often disrupted imperial territory. The Fourth Crusade’s capture of Constantinople in 1204 fragmented the empire into successor states, with the Latin Empire in the capital and Greek polities at Nicaea, Epirus, and Trebizond. Nicaea recaptured Constantinople in 1261, but the restored empire struggled with diminished resources, internal aristocratic factions, and rising Ottoman power. By the fourteenth century, civil wars and economic decline left Byzantium dependent on Italian maritime republics for trade and defense. The Ottomans steadily encircled the empire, culminating in the siege of 1453, when Constantinople fell to Mehmed II. Byzantine scholars carried classical learning to Italy, shaping the Renaissance. The empire’s fall ended Roman imperial continuity but laid cultural and religious foundations inherited by Greece and Eastern Orthodoxy."
    },
    {
        "name": "Greece",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Greece"
            }
        ],
        "upgradesFrom": [
            "Byzantium (Renaissance)"
        ],
        "category": "Major",
        "description": "After the fall of Constantinople in 1453, most Greek lands came under Ottoman rule. The empire incorporated Byzantine institutions into its provincial framework, with local notables and the Orthodox Patriarchate mediating imperial authority. Coastal areas experienced pirate raids and Venetian-Ottoman wars, while mountain communities retained partial autonomy. Monasteries preserved learning and traditions, and merchants expanded networks across the Mediterranean and Black Sea. Periodic uprisings, such as the Orlov Revolt (1770), revealed both resistance and the limits of foreign support. The Greek Enlightenment of the late eighteenth century, fostered by diaspora intellectuals, laid foundations for nationalism.\n\nThe War of Independence (1821–1829) combined local revolts with international intervention, leading to recognition of the Kingdom of Greece in 1832 under King Otto. Nineteenth-century Greece adopted European legal codes and expanded with the Ionian Islands (1864), Thessaly (1881), and territories gained after the Balkan Wars (1912–1913). Defeat in Asia Minor (1922) brought population exchange with Turkey. Political turbulence followed, including dictatorship, German occupation, and a civil war (1946–1949). Reconstruction, NATO membership (1952), and European integration transformed society. The 1967–1974 military junta collapsed after the Cyprus crisis, ushering in the Third Republic. Greece joined the EU in 1981, adopted the euro in 2001, and weathered the 2009–2018 debt crisis. Today it remains a parliamentary democracy with an economy led by tourism, shipping, and services, active in the Balkans and Eastern Mediterranean."
    },
    {
        "name": "Etruscan",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Italy"
            }
        ],
        "category": "Major",
        "description": "The Etruscan civilization developed in Etruria, between the Arno and Tiber, from the late Bronze Age and early Iron Age (c. 900–500 BCE). It formed a network of city-states organized into a loose league, with urban planning, monumental necropolises, and elaborate religious rites. Etruscan elites controlled metal resources and maritime trade with Greeks and Phoenicians. They pioneered advanced drainage and terracing, road building, and the arch in construction. Artistic production included bronze casting, terracotta sculpture, and bucchero pottery. Their alphabet, adapted from Greek, shaped early Italic literacy.\n\nEtruscan dynasts influenced early Rome; several Roman kings had Etruscan names, and key Roman institutions drew on Etruscan ritual. The civilization declined from the fifth century BCE due to pressure from Gauls, Syracuse, and Carthage at sea, and the steady expansion of Rome on land. By the first century BCE, Etruscan cities were incorporated into the Roman state, yet religious practices, engineering methods, and artistic motifs continued in Roman Italy."
    },
    {
        "name": "Rome",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Italy"
            }
        ],
        "upgradesFrom": [
            "Etruscan"
        ],
        "category": "Major",
        "description": "Rome grew from a Latin city-state on the Tiber to a Mediterranean empire. The monarchy ended in 509 BCE, giving way to the Republic, which forged durable institutions: magistracies, a Senate, popular assemblies, and layered citizenship. Conquest unified Italy and then the wider Mediterranean. Roman law, Latin literature, and a standardized infrastructure of roads, bridges, and aqueducts sustained integration. Concrete construction, urban amenities, and fiscal administration set benchmarks for later polities.\n\nAugustus established the Principate in 27 BCE. The empire managed diverse provinces through municipal self-government and professional armies. Christianity spread and gained imperial support in the fourth century CE. The Western Empire fragmented in the fifth century, but Roman legal norms, Latin, and urban frameworks endured. In Italy, late antique institutions, diocesan boundaries, and road networks shaped medieval polities. Roman cultural capital remained central to European learning, law, and statecraft for centuries."
    },
    {
        "name": "Lombard",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Italy"
            }
        ],
        "upgradesFrom": [
            "Rome"
        ],
        "category": "Major",
        "description": "The Lombards, a Germanic people, entered Italy in 568 and established a kingdom centered on Pavia. Their rule combined royal authority with powerful duchies, notably in Spoleto and Benevento. They contested Byzantine holdings and negotiated with the papacy. The Edictum Rothari (643) codified Lombard law, integrating Germanic customs with Roman legal practice. Monarchs such as Liutprand strengthened royal control, patronized monasteries, and reformed administration.\n\nLombard material culture is marked by distinctive metalwork and stone architecture. Surviving churches and the Tempietto Longobardo at Cividale show a synthesis with local traditions. Frankish conquest in 774 ended the northern kingdom, though Benevento endured into the eleventh century. Lombard aristocracies and legal traditions persisted under Carolingian and later rulers. The name continues in the region of Lombardy, and elements of their law influenced medieval Italian property and inheritance practices."
    },
    {
        "name": "Venice",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Italy"
            }
        ],
        "upgradesFrom": [
            "Lombard"
        ],
        "category": "Major",
        "description": "Venice formed in the lagoon during late antiquity as communities sought security from invasions. It evolved from Byzantine dependency to an autonomous republic under a doge. From the eleventh to fifteenth centuries it built a maritime empire along the Adriatic and into the Aegean, secured routes to the Levant, and expanded after the Fourth Crusade. The Arsenal pioneered mass-production techniques and state-managed shipbuilding. Merchants and patricians developed sophisticated finance, convoys, and notarial systems.\n\nRenaissance Venice became a center of printing, cartography, and glassmaking at Murano. Its diplomacy created the resident ambassador model. The republic survived wars with Genoa and the League of Cambrai, then adapted to Ottoman power by shifting toward overland trades and mainland territories (Terraferma). Napoleonic conquest ended the republic in 1797; Vienna awarded it to Austria in 1815. Venice joined the Kingdom of Italy in 1866. Today the city remains a major cultural and maritime heritage site with a service-based economy and complex lagoon management."
    },
    {
        "name": "Italy",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Italy"
            }
        ],
        "upgradesFrom": [
            "Venice"
        ],
        "category": "Major",
        "description": "The Kingdom of Italy formed in 1861 under the House of Savoy and incorporated Rome in 1870. Unification created a centralized state but left regional disparities. Industrialization accelerated in the North, while the South faced land and labor shortages. Mass emigration reshaped society. Italy fought in World War I on the Entente side. Fascism seized power in 1922, pursued corporatism and imperial war, and fell after military defeat in World War II. A referendum in 1946 established the republic; the 1948 constitution created a parliamentary system.\n\nThe postwar economic boom transformed Italy into a major manufacturer with global strength in machinery, automobiles, fashion, and design. Italy was a founding member of NATO and the European Communities. The 1970s saw social conflict and terrorism; the 1990s corruption probes reconfigured parties. Italy adopted the euro, expanded high-speed rail, and invested in heritage conservation. Challenges include public debt, demographic decline, North–South inequality, and climate adaptation. Italy remains a G7 economy and EU anchor, active in Mediterranean policy, cultural industries, advanced manufacturing, and renewable technologies into the 2020s."
    },
    {
        "name": "Tartessian",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Spain"
            }
        ],
        "category": "Major",
        "description": "Tartessian culture flourished in southwestern Iberia from the ninth to sixth centuries BCE, centered on the lower Guadalquivir and Guadiana basins. It grew through sustained exchange with Phoenician settlements such as Gadir and Huelva. Elite control of silver, copper, and gold from the Río Tinto and Sierra Morena mines supported early urbanization and sanctuaries, including El Carambolo and Cancho Roano. A distinctive Southwest Paleohispanic script appears on stelae and plaques; its language remains controversial.\nBy the mid-sixth century BCE, Tartessian power waned. Carthaginian expansion in the western Mediterranean, shifts in Atlantic tin routes, and internal realignments disrupted established trade. Successor communities in the region, known to the Romans as Turdetani, retained legal traditions and literacy. Tartessian metallurgy, cult sites, and early writing framed later Iberian cultural developments and set the stage for intensified Mediterranean contacts in eastern and southern Iberia."
    },
    {
        "name": "Iberian",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Spain"
            }
        ],
        "upgradesFrom": [
            "Tartessian"
        ],
        "category": "Major",
        "description": "The Iberians occupied the eastern and southeastern coasts and hinterlands of the peninsula from the sixth to first centuries BCE. They formed clustered polities with fortified oppida, controlled valleys and trade routes, and adopted coinage, ironworking, and refined ceramics through contact with Greeks at Emporion and Phoenician-Carthaginian ports. Iberian scripts (northeastern and southeastern) appear on stone, pottery, and coin. Artistic production includes stone sculptures such as the Lady of Elche and the Bicha de Balazote.\nIberian groups fielded skilled cavalry and served as mercenaries in the Punic and Roman armies. The Second Punic War began with the siege of Saguntum, and Roman conquest proceeded region by region. By the first century BCE, Iberian polities were absorbed into Roman Hispania as municipia and colonies. Their urban layouts, agricultural practices, and epigraphic habits shaped the Roman provincial order that followed, while Turdetanian law and literacy persisted in Baetica."
    },
    {
        "name": "Castille",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Spain"
            }
        ],
        "upgradesFrom": [
            "Iberian"
        ],
        "category": "Major",
        "description": "Castille emerged from a Leonese frontier county into an independent kingdom by the eleventh century. Its institutions—fueros, hermandades, and the Mesta (1273)—structured settlement, security, and transhumant pastoralism. Castilian forces captured Toledo in 1085 and, after the union with León in 1230, advanced to Cordoba (1236) and Seville (1248). Alfonso X promoted the Siete Partidas, astronomical and historical compilations, and chancery use of Castilian, which consolidated a royal legal and literary tradition.\nThe late medieval kingdom balanced powerful towns, a tax-negotiating Cortes, and a landed nobility. Crisis in the fourteenth century gave way to institutional consolidation. The dynastic union of Isabella of Castille and Ferdinand of Aragon in 1469 linked crowns while preserving separate laws. Granada fell in 1492, and transatlantic ventures began the same year. Castille provided fiscal capacity, manpower, language, and legal frameworks that became central to the composite Spanish Monarchy and its Atlantic empire."
    },
    {
        "name": "Spain (Kingdom)",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Spain"
            }
        ],
        "upgradesFrom": [
            "Castille"
        ],
        "category": "Major",
        "description": "From the late fifteenth century, Spain projected power across oceans and continents. Columbus’s voyage in 1492 opened Caribbean colonies, followed by the conquests of Mexico and Peru, which supplied immense silver and gold to Seville and later Cádiz. This wealth financed the Habsburg monarchy’s wars in Italy, the Low Countries, and against the Ottomans, even as inflation and repeated bankruptcies strained finances. Under Philip II, Madrid became the administrative capital, the Escorial a dynastic symbol, and the empire spanned from Manila to Mexico City. Seventeenth-century wars with France, England, and the Dutch Republic eroded resources, while plague and demographic contraction deepened decline. Yet Spain remained a cultural power, producing Velázquez, Calderón, and Cervantes, and exporting Catholic missions across the Americas and Asia. The Bourbon dynasty from 1700 pursued centralization, naval revival, and Bourbon Reforms in the colonies, while Enlightenment thinkers promoted science and economic modernization. Napoleon’s invasion in 1808 toppled Bourbon authority, sparking the Peninsular War and independence movements abroad."
    },
    {
        "name": "Spain (Modern)",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Spain"
            }
        ],
        "upgradesFrom": [
            "Spain (Kingdom)"
        ],
        "category": "Major",
        "description": "Nineteenth-century Spain experienced civil conflict and institutional change: the Carlist Wars, liberal and absolutist oscillations, the 1868 revolution, the short-lived First Republic (1873–74), and the Bourbon Restoration. Railways, mining, and commercial law advanced; the Civil Code was promulgated in 1889. The loss of Cuba, Puerto Rico, and the Philippines in 1898 spurred regenerationist critique and educational reform.\nThe twentieth century saw the Primo de Rivera dictatorship, the Second Republic’s social legislation, the Civil War, and Franco’s authoritarian regime. Autarky gave way to the 1959 Stabilization Plan, rapid industrial growth, migration, and mass tourism. After 1975, the democratic Transition produced the 1978 Constitution and an autonomous communities system. Spain joined the European Communities in 1986 and adopted the euro. The economy diversified, with strengths in services, automotive, agri-food, and renewables. High-speed rail expanded, and research capacity grew. The state confronted terrorism, the 2008 financial crisis, and Catalan tensions. Social reforms included same-sex marriage in 2005. In the 2020s, policy focuses on digitalization, energy transition, and inclusive growth."
    },
    {
        "name": "Phoenicia",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Tunisia"
            }
        ],
        "category": "Major",
        "description": "The Phoenicians were a network of Levantine city-states—Tyre, Sidon, Byblos—that expanded across the Mediterranean during the late second and early first millennium BCE. They established trading enclaves and colonies along the North African coast, including Utica (traditionally c. 1100 BCE) and Carthage (traditional date 814 BCE). Their maritime commerce linked tin from the Atlantic, silver from Iberia, and luxury goods to eastern markets. The Phoenician alphabet spread widely and influenced later scripts. Purple dye, glassworking, and fine metalwork were notable crafts. In Ifriqiya, they interacted with Libyco-Berber communities, facilitating urbanization and Iron Age technologies. Political forms remained city-based, governed by councils and magistrates, with cults centered on deities such as Melqart, Astarte, and Baal. This coastal network laid the demographic and institutional foundations for Punic Carthage, which assumed regional leadership as Tyre’s power waned under Assyrian and Babylonian pressure."
    },
    {
        "name": "Carthage",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Tunisia"
            }
        ],
        "upgradesFrom": [
            "Phoenicia"
        ],
        "category": "Major",
        "description": "Carthage emerged from the Phoenician colonial sphere into an independent thalassocracy by the sixth century BCE. Centered on the Gulf of Tunis, it controlled maritime routes, agrarian hinterlands, and a chain of ports from North Africa to Iberia and Sardinia. A mixed constitution balanced suffetes, councils, and popular assemblies. Naval power and commercial treaties underpinned its reach. The Barcid family expanded in Iberia after 237 BCE. Carthaginian agronomy was advanced; Mago’s agricultural treatise was later prized by Romans. Monumental harbors, coinage, and urban planning marked its capital. Religious life featured Punic deities and sanctuaries; scholarship debates the Tophet’s function. Conflict with Greek cities in Sicily culminated in long wars with Rome. The Second Punic War saw Hannibal’s campaign in Italy. Defeat in 202 and destruction in 146 BCE ended the state, but Punic culture persisted under Roman Africa, which recycled Carthage’s strategic site."
    },
    {
        "name": "Aghlabid",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Tunisia"
            }
        ],
        "upgradesFrom": [
            "Carthage"
        ],
        "category": "Major",
        "description": "The Aghlabid Emirate (800–909 CE) ruled Ifriqiya as Abbasid vassals from Kairouan. Founded by Ibrahim ibn al-Aghlab, it stabilized taxation and military administration while granting local autonomy. Emirs expanded irrigation and built major works, notably the Aghlabid basins and the enhancement of the Great Mosque of Kairouan. Maliki jurisprudence flourished under jurists such as Sahnun. Prosperity rested on agriculture, artisan production, and Mediterranean trade.\nFrom 827, Aghlabid fleets began the conquest of Sicily, establishing qasrs and ribats, and launching raids into southern Italy. Palermo became a key base. Internal tensions, Kutama Berber mobilization, and Isma‘ili da‘wa eroded Aghlabid rule. In 909 the Fatimids, backed by the Kutama, overthrew the dynasty. The Aghlabids’ legacies include North African Islamic architecture, naval organization, and the integration of Ifriqiya into central Mediterranean power politics."
    },
    {
        "name": "Maghreb",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Tunisia"
            }
        ],
        "upgradesFrom": [
            "Aghlabid"
        ],
        "category": "Major",
        "description": "The Maghreb, or te Barbary Coast, are the western Islamic lands from Libya to Morocco. In the early modern period it comprised the Ottoman regencies of Tripoli, Algiers, and Tunis, and an independent Morocco under Saadi and then Alaouite dynasties. Power balanced court elites, Janissaries, corsair fleets, tribal confederations, and urban notables. Ports from Salé to Tunis engaged European states through diplomacy, treaties, ransoms, and trade. The 1609 Morisco influx reshaped Moroccan cities and crafts; trans-Saharan routes persisted but declined as Atlantic commerce rose.\nCorsairing, tax farming, and agricultural rents funded regimes. Plagues and droughts caused recurrent crises. Intellectual life included Sufi orders, legal scholarship, and travel writing. European pressure grew through bombardments, blockades, and commercial capitulations. By the nineteenth century fiscal strains and military gaps widened, opening the way to French conquest in Algeria (from 1830) and protectorates in Tunisia (1881) and Morocco (1912). This regional arc framed Tunisia’s modern trajectory."
    },
    {
        "name": "Tunisia",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Tunisia"
            }
        ],
        "upgradesFrom": [
            "Maghreb"
        ],
        "category": "Major",
        "description": "Tunisia evolved from the Husainid beylik into a modern state. Nineteenth-century rulers pursued reforms: Ahmad Bey abolished slavery (1846), reorganized the army, and backed the 1857 Fundamental Pact and the 1861 constitution. Debt crises led to foreign financial control and the 1881 French protectorate. Colonial investment expanded railways, ports, and phosphate mining, while settler agriculture restructured land use. The Tunisia Campaign of 1942–43 marked a major Second World War theater. Nationalists in the Destour and Neo-Destour, allied with the UGTT, achieved independence in 1956. Bourguiba’s republic advanced education, health, and the 1956 Personal Status Code.\nBen Ali’s 1987 takeover brought export-led growth and repression. The 2011 uprising ended his rule and opened a pluralist period, a 2014 constitution, and the 2015 Nobel to the National Dialogue Quartet. Security shocks, COVID-19, and debt weighed on recovery. Since 2021 President Kais Saied has consolidated executive power and adopted a new constitution. Talks with the IMF, EU migration agreements, and regional ties with Algeria and Libya shape policy. Key sectors include phosphates, olive oil, tourism, offshoring, and growing renewables."
    },
    {
        "name": "Buni",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Indonesia"
            }
        ],
        "category": "Major",
        "description": "The Buni culture was an archaeological complex on the north coast of West Java, active from about 400 BCE to the early centuries CE. It is known for fine incised pottery, red‑slipped bowls, pedestalled containers, and spouted jars. Finds of Indian rouletted ware, glass, and carnelian beads indicate sustained trade with South Asia. Settlements clustered along the Citarum delta and the Sunda Strait. People exploited riverine and coastal resources and maintained craft specialization.\n\nBuni ceramics occur at Batujaya, where early brick stupas rose in the 4th–7th centuries CE. The culture bridges late Neolithic and early historic phases in western Java. It provided material and economic bases for later polities, notably Tarumanagara. Its distribution and exchange links foreshadowed the maritime orientation that would define the archipelago. The Buni horizon ends as Indianized courts and script usage took hold, but its production techniques persisted in local pottery traditions."
    },
    {
        "name": "Yavadvipa",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Indonesia"
            }
        ],
        "upgradesFrom": [
            "Buni"
        ],
        "category": "Major",
        "description": "Yavadvipa, a Sanskrit term for Java attested in Indian epics and geographies, marks the island’s emergence in early historic networks from the first millennium CE. Coastal nodes on the north coast engaged Indian and Chinese shipping. Wet‑rice agriculture expanded in the interior. The 5th‑century kingdom of Tarumanagara left Sanskrit‑Pallava inscriptions that record canal works by King Purnawarman and gifts to Brahmins. By the 7th–8th centuries, Kalingga and other courts show Hindu‑Buddhist learning and Old Javanese literacy.\n\nThese polities used Sanskrit titulature, adopted calendrical science, and issued embassies to China. Port settlements such as Sunda Kelapa facilitated trade in pepper, forest products, and rice. The institutional and agrarian foundations created under Yavadvipa’s early kingdoms linked Java to the wider Indian Ocean. They prepared the ground for larger thalassocracies. By the late 7th century, Srivijaya integrated Java’s commerce into a straits‑centered maritime order."
    },
    {
        "name": "Srivijaya",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Indonesia"
            }
        ],
        "upgradesFrom": [
            "Yavadvipa"
        ],
        "category": "Major",
        "description": "Srivijaya was a Malay Buddhist thalassocracy based around Palembang on Sumatra, active from the late 7th to the 13th century. Old Malay inscriptions such as Kedukan Bukit (682) and Talang Tuwo (684) attest to royal expeditions, foundations, and ritual sanctions. The polity controlled the Malacca and Sunda Straits and taxed shipping between India and China. It maintained tributary diplomacy with Tang and Song courts and promoted Malay as a lingua franca of trade.\n\nSrivijaya sustained monastic learning. The monk Yijing studied there in 671 before traveling to Nalanda. The Nalanda copperplate records an endowment by Balaputra of Suvarnadvipa. The court managed a mandala of ports and riverine hinterlands and facilitated spice flows from Maluku. Its naval power deterred rivals, but Chola raids in 1025–1028 damaged key centers. Authority shifted toward Jambi and fragmented under pressure from Javanese expansion and inland Malay polities. By the 13th century the field was open to Singhasari and, later, Majapahit."
    },
    {
        "name": "Majapahit",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Indonesia"
            }
        ],
        "upgradesFrom": [
            "Srivijaya"
        ],
        "category": "Major",
        "description": "Majapahit was a Java‑based state centered at Trowulan, founded in 1293 by Raden Wijaya after the failed Mongol punitive expedition. Under Hayam Wuruk and the patih Gajah Mada (mid‑14th century), it attained a wide network of vassals across Nusantara. The Sumpah Palapa oath framed an agenda to bind ports and spice‑producing islands into tributary and commercial ties. The Nagarakretagama describes its court, provincial administration, and ritual geography.\n\nMajapahit integrated irrigated rice heartlands with maritime commerce through ports such as Tuban and Surabaya. It sponsored literature in Old Javanese, law codes, and brick temple architecture, including the Penataran complex. Diplomacy linked the court to China, Champa, and Siam. Internal conflict, the Paregreg civil war, and the rise of Islamic trading polities eroded cohesion in the 15th century. By the early 16th century Demak and other sultanates absorbed its coastal sphere. Majapahit’s political idioms endured in later Javanese courts and national historiography."
    },
    {
        "name": "Indonesia",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Indonesia"
            }
        ],
        "upgradesFrom": [
            "Majapahit"
        ],
        "category": "Major",
        "description": "Indonesia emerged from early modern colonial structures built by the Dutch East India Company after 1602. Batavia became a hub for spice monopolies, forced contracts, and inter‑island shipping. After the VOC’s dissolution in 1799, the Dutch state consolidated the Netherlands Indies. The Cultivation System (1830–1870) financed the metropole but provoked resistance. The Ethical Policy expanded education and infrastructure. Railways, telegraphs, and plantations tied islands into an integrated economy.\n\nNational awakening accelerated from 1908 with Budi Utomo, Sarekat Islam, and the Youth Pledge of 1928 adopting Bahasa Indonesia. Japanese occupation (1942–1945) mobilized resources and militias. Sukarno and Hatta proclaimed independence on 17 August 1945. The revolution ended with Dutch recognition in 1949. The republic moved from parliamentary rule to Sukarno’s Guided Democracy, then to Suharto’s New Order after 1965, which combined centralized authority with rapid growth and ASEAN leadership. Since 1998, democratic reforms, decentralization, and steady expansion have defined politics. Indonesia is a G20 member with regional influence, diverse industries, and ongoing challenges in inequality, governance, and the environment. Capital relocation to Nusantara is underway."
    },
    {
        "name": "Lapita",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Polynesia"
            }
        ],
        "category": "Major",
        "description": "The Lapita cultural complex flourished in the western and central Pacific c. 1600–500 BCE. Its communities spread from the Bismarck Archipelago through Vanuatu, New Caledonia, and Fiji to Tonga and Samoa. They are known for dentate-stamped ceramics, obsidian exchange, and horticulture based on taro, yam, and breadfruit, supplemented by pigs, dogs, and chickens. Maritime technology included outrigger and double-hulled canoes and flexible sail rigs. Long-distance navigation used stars, swell patterns, and seabird behavior.\nAs Lapita groups reached Remote Oceania, they established the demographic and linguistic base for Proto-Polynesian. Around the first millennium BCE, decorated pottery declined and local plainware or non-ceramic traditions took hold. Settlement of Tonga and Samoa created a core from which later Eastern Polynesian voyaging departed. Lapita achievements include the earliest sustained open-ocean colonization in human history and integrated exchange networks over thousands of kilometers. Their legacy persisted in language, agriculture, and seafaring that underpinned the emergence of Polynesian societies."
    },
    {
        "name": "Samoa",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Polynesia"
            }
        ],
        "upgradesFrom": [
            "Lapita"
        ],
        "category": "Major",
        "description": "Samoa was settled by Lapita-descended voyagers by c. 900–700 BCE and, with Tonga, formed a core Polynesian homeland. After the disappearance of decorated ceramics, Samoan culture emphasized wood, fiber, and stone technologies. The fa'amatai system developed, with matai titleholders leading village councils (fono) and organizing ceremonial exchange, architecture, and land tenure. Contacts with the Tu'i Tonga sphere included alliance, marriage, and occasional conflict. Samoan canoe-building and navigation contributed to the peopling of Eastern Polynesia in the late first and early second millennia CE.\nEuropean contact began in the 18th century. Missionaries arrived in the 1830s. Rival imperial claims led to the 1899 partition into German Samoa and American Samoa. New Zealand occupied German Samoa in 1914; the 1918 influenza pandemic caused catastrophic mortality. The nonviolent Mau movement pressed for self-rule. Western Samoa gained independence in 1962 (renamed Samoa in 1997). Today Samoa is a parliamentary state anchored in the matai system, with a large diaspora, remittance-driven economy, and active climate adaptation policies."
    },
    {
        "name": "Tahiti",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Polynesia"
            }
        ],
        "upgradesFrom": [
            "Samoa"
        ],
        "category": "Major",
        "description": "Tahiti, in the Society Islands, was settled by East Polynesian voyagers around the late first millennium CE. Ariʻi nobility governed through alliances, warfare, and religious authority centered on marae complexes closely linked with the wider Leeward and Windward Society Islands. European contact began with Wallis (1767), Bougainville (1768), and Cook (1769). The London Missionary Society arrived in 1797; Pomare II consolidated the Tahitian Kingdom and adopted Christianity in the early 19th century. Legal codes and literacy spread under royal and missionary influence.\nFrance declared a protectorate in 1842 and annexed the kingdom in 1880, integrating it into what is now French Polynesia. The 20th century brought military infrastructure and, from 1966 to 1996, nuclear testing on Tuamotu atolls, which shaped politics and public health debates. Today Tahiti, with Papeete as the administrative hub, is part of an autonomous French overseas country. The economy relies on services, tourism, public employment, and pearls. Cultural revival in dance, tattoo, and reo Tahiti accompanies ongoing discussions about autonomy, environment, and post-test legacy."
    },
    {
        "name": "Māori",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Polynesia"
            }
        ],
        "upgradesFrom": [
            "Tahiti"
        ],
        "category": "Major",
        "description": "Māori are East Polynesian settlers of Aotearoa New Zealand, arriving c. 1200–1300 CE in multiple waka migrations. Communities adapted horticulture to temperate climates, developed fortified pā, and organized into iwi and hapū. Intensive hunting contributed to moa extinction and reshaped ecosystems. Carving, weaving, and oratory flourished, with knowledge encoded in whakapapa and waiata. First European encounters occurred with Tasman in 1642 and Cook from 1769. The early 19th century saw the Musket Wars and rapid economic change.\nThe Treaty of Waitangi (1840) established British sovereignty, followed by land alienation and wars in the 1860s. The Kingitanga maintained political unity for some iwi. In the 20th century, urban migration and service in world wars were pivotal. The Māori Renaissance from the 1970s advanced language and land claims; the Waitangi Tribunal (1975–) enabled historical settlements. Te reo Māori gained official status in 1987, with kōhanga reo and kura kaupapa supporting revival. Today Māori influence national politics, manage significant tribal economies, and co-govern key resources, while addressing health, housing, and climate resilience."
    },
    {
        "name": "Polynesia",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Polynesia"
            }
        ],
        "upgradesFrom": [
            "Māori"
        ],
        "category": "Major",
        "description": "Polynesia is the Austronesian cultural-linguistic region spanning the triangle bounded by Hawaiʻi, Aotearoa (New Zealand), and Rapa Nui, with archipelagos such as Samoa, Tonga, the Society Islands, the Cooks, and Tuvalu. It emerged from Lapita foundations as communities in Tonga and Samoa developed Proto-Polynesian language and institutions, then expanded eastward and northward c. 800–1300 CE. Shared features include hierarchical chiefdoms, tapu-based regulation, monumental ritual precincts (marae, heiau, ahu), intensive arboriculture, and blue-water voyaging in double-hulled canoes guided by non-instrument navigation.\nAchievements include the settlement of the most remote oceanic islands on Earth, sophisticated wayfinding, agricultural adaptation across diverse ecologies, and distinctive architecture and arts. European contact from the 16th to 18th centuries preceded missionary activity, disease, and colonial partition among Britain, France, the United States, and Chile. The 20th and 21st centuries saw decolonization, self-government in several polities, and cultural resurgence. Inter-island cooperation now includes the Polynesian Leaders Group, and renewed voyaging projects have restored traditional navigation to public life."
    },
    {
        "name": "Sinhala",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Sri Lanka"
            }
        ],
        "category": "Major",
        "description": "The Sinhala ethnocultural tradition formed on the island from a base of Mesolithic communities and Early Iron Age settlers. Later chronicles recount origin legends, but archaeology indicates village agriculture, megalithic burial, and iron metallurgy by the first millennium BCE. An Indo-Aryan Prakrit became dominant in inscriptions from the 3rd-2nd centuries BCE, giving rise to the Sinhala language and script. Theravada Buddhism took root under Mauryan influence, creating monastic networks and literacy. Early irrigation, paddy cultivation, and tank building spread across the Dry Zone. Stone architecture, cave temples, and donor records show a stratified society tied to long-distance trade. The consolidation of this culture under local kings created the conditions for a durable state. Its language, Buddhist institutions, and hydraulic engineering became the core of the Anuradhapura civilization."
    },
    {
        "name": "Anuradhapura",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Sri Lanka"
            }
        ],
        "upgradesFrom": [
            "Sinhala"
        ],
        "category": "Major",
        "description": "The Anuradhapura Kingdom emerged by the 4th century BCE and lasted until the early 11th century CE. Devanampiya Tissa's adoption of Buddhism after contacts with Mauryan missions established the Mahavihara, Abhayagiri, and Jetavana monastic complexes. Massive stupas such as Ruwanwelisaya and Jetavanaramaya marked a new architectural scale. A state-directed hydraulic system integrated reservoirs and canals, including Kala Wewa, Minneriya, and the Yoda Ela. The kingdom minted coins, kept chronicles such as the Dipavamsa and Mahavamsa, and sustained trade with South India, the Roman world, and Southeast Asia. Dynastic cycles and invasions from the Tamil south tested its resilience. From the late 10th century the Chola Empire occupied much of the island. Urban decline and political displacement followed. The royal court shifted east and south, laying the groundwork for restoration at Polonnaruwa."
    },
    {
        "name": "Polonnaruwa",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Sri Lanka"
            }
        ],
        "upgradesFrom": [
            "Anuradhapura"
        ],
        "category": "Major",
        "description": "After expelling the Chola, Vijayabahu I restored royal authority in 1070 and made Polonnaruwa the capital. The reign of Parakramabahu I (1153-1186) marked the peak. He unified factional regions, reorganized the sangha, and rebuilt the hydraulic network. The Parakrama Samudra reservoir and linked tanks stabilized dry-zone agriculture. Imports and exports moved through ports at Mahatittha and other nodes. Stone and bronze art achieved a refined style, seen at Gal Vihara and the Quadrangle. The court intervened in South India and sent expeditions to Myanmar, projecting maritime power. Nissanka Malla sponsored further works but strained resources. From 1215 incursions by Kalinga Magha and internal fragmentation weakened the center. Royal power migrated to Dambadeniya and other inland capitals. The ecological and political pressures pushed the island’s core toward the central highlands, where the Kandyan polity later consolidated."
    },
    {
        "name": "Kandy",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Sri Lanka"
            }
        ],
        "upgradesFrom": [
            "Polonnaruwa"
        ],
        "category": "Major",
        "description": "The Kandyan Kingdom formed in the central highlands by the late 15th century. Its mountain terrain, mobile warfare, and alliance diplomacy enabled it to resist Portuguese and later Dutch coastal powers. Under Vimaladharmasuriya I and Rajasinha II, the court defended independence, negotiated the 1638 treaty with the Dutch, and managed shifting vassal networks. Administration rested on local chiefs (dissavas) and service tenures. The Temple of the Tooth in Kandy anchored royal authority. A monastic revival drew higher ordination from Siam in 1753 under Kirti Sri Rajasinha, reshaping Buddhist learning and art in a distinct Kandyan style. Internal elite rivalries and British expansion eroded autonomy. In 1815 nobles deposed Sri Vikrama Rajasinha and ceded the kingdom by the Kandyan Convention. Uprisings in 1818 and 1848 followed. The fall ended independent kingship but transmitted highland institutions and religious centers into the colonial era."
    },
    {
        "name": "Sri Lanka",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Sri Lanka"
            }
        ],
        "upgradesFrom": [
            "Kandy"
        ],
        "category": "Major",
        "description": "British rule expanded from coastal Ceylon to the interior after 1815. The Colebrooke-Cameron reforms of 1833 centralized administration and opened the economy. Coffee plantations grew and then collapsed after blight; tea, rubber, and coconut replaced them. Indian Tamil labor migration reshaped demographics. A modern press, schools, and railways spread. Political movements achieved Dominion status in 1948. Language policy changes in 1956 and constitutional reforms in 1972 and 1978 altered the state. Ethnic conflict escalated into civil war between the government and the LTTE from 1983 to 2009, with an Indian peacekeeping intervention in 1987-1990. Post-war years brought reconstruction, devolution debates, and human rights scrutiny. The 2004 tsunami and the 2019 Easter attacks tested resilience. Economic growth relied on garments, tea, tourism, ports, and remittances, but debt crises peaked in 2022 and triggered mass protests. Today Sri Lanka pursues fiscal stabilization, social welfare, and reconciliation. It engages India, China, Japan, and multilateral partners, while managing environmental risks and a strategic Indian Ocean location."
    },
    {
        "name": "Hồng Bàng",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Vietnam"
            }
        ],
        "category": "Major",
        "description": "The Hồng Bàng period denotes the legendary formation of Văn Lang under the Hùng kings, traditionally dated to the late third millennium to the late first millennium BCE. Archaeology anchors this era in the Red River basin through the Phùng Nguyên, Đồng Đậu, Gò Mun, and especially Đông Sơn cultures. Communities practiced intensive wet-rice agriculture, riverine transport, weaving, and bronze metallurgy. Đông Sơn bronze drums and weaponry attest to advanced casting and regional exchange across Lingnan and Island Southeast Asia.\n\nSettlement formed clustered chiefdoms tied by kinship and ritual authority. Stilt houses, embankments, and paddy systems adapted to monsoon hydrology. Oral genealogies later preserved in medieval chronicles linked ruling lineages to sacred landscapes. In the late phase, the polity of Âu Lạc emerged with fortified centers such as Cổ Loa, marking a transition to larger-scale organization. This consolidation set the stage for conflict with the kingdom of Nam Việt under Triệu Đà."
    },
    {
        "name": "Triệu Đà",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Vietnam"
            }
        ],
        "upgradesFrom": [
            "Hồng Bàng"
        ],
        "category": "Major",
        "description": "Triệu Đà (Zhao Tuo) founded the kingdom of Nam Việt (Nanyue) after the Qin collapse, circa 204–111 BCE, ruling from Panyu (Guangzhou) over Lingnan and the Red River region. Around 179 BCE his regime absorbed Âu Lạc, bringing the delta into a hybrid order that combined Yue customs with Chinese-style bureaucracy and diplomatic engagement with the Han court. Iron tools, intensified wet-rice cultivation, and cross-Gulf trade expanded under this framework.\n\nIn 111 BCE the Han conquered Nam Việt and reorganized the northern Vietnamese lowlands into commanderies such as Giao Chỉ (Jiaozhi). Written administration, legal norms, and classical education spread alongside local practices. Over subsequent centuries, layered Sino-Viet institutions took root while highland and delta communities maintained distinct lifeways. This longue durée of Chinese rule framed later assertion of autonomy, culminating in 10th-century independence and the formation of Đại Việt under dynasties that included the Lý."
    },
    {
        "name": "Lý",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Vietnam"
            }
        ],
        "upgradesFrom": [
            "Triệu Đà"
        ],
        "category": "Major",
        "description": "The Lý dynasty (1009–1225) consolidated an independent Đại Việt and established a durable state centered on Thăng Long (Hanoi), founded as the capital in 1010. The court developed a centralized bureaucracy, regular taxation, coin minting, and lawmaking. Hydraulic works and dike systems stabilized agriculture in the Red River delta. The Temple of Literature (1070) and Quốc Tử Giám (1076) anchored Confucian education; the first civil service examination was held in 1075.\n\nExternally, the Lý balanced diplomacy with the Song while securing borders through campaigns against Champa and frontier polities. Lý Thường Kiệt’s preemptive expedition and defense along the Như Nguyệt River (1075–1077) checked Song advances. Buddhist institutions shaped court culture, architecture, and arts. Urban craft quarters and long-distance trade grew with regional markets. The dynasty’s administrative and cultural foundations endured into the Trần period and provided the framework later expanded and regularized under the Lê."
    },
    {
        "name": "Lê",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Vietnam"
            }
        ],
        "upgradesFrom": [
            "Lý"
        ],
        "category": "Major",
        "description": "The Lê dynasty chiefly denotes the Later Lê (1428–1789), founded by Lê Lợi after the Lam Sơn uprising expelled Ming occupation. Under Lê Thánh Tông (r. 1460–1497), the state reached a classical high point: the Hồng Đức legal code, a six-ministry central government, provincialization (thừa tuyên), cadastral surveys, and a fully institutionalized civil examination system. Military campaigns dismantled Champa’s power in 1471 and advanced the southward expansion (Nam tiến). Nôm and classical literature flourished; printing from woodblocks spread texts and administrative forms.\n\nFrom 1527 the realm fractured. The Mạc usurpation prompted a Lê Restoration backed by Trịnh lords in the north, while Nguyễn lords ruled the south. The Trịnh–Nguyễn wars (17th century) coexisted with vigorous overseas trade at ports such as Hội An and new contacts with Iberian and Dutch merchants. Jesuits codified romanized Quốc Ngữ in the mid-17th century. Prolonged fiscal and military strains culminated in the Tây Sơn uprisings, the fall of the Later Lê in 1789, and eventual reunification under the Nguyễn, opening paths to 19th-century transformations."
    },
    {
        "name": "Vietnam",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Vietnam"
            }
        ],
        "upgradesFrom": [
            "Lê"
        ],
        "category": "Major",
        "description": "In the 19th century Vietnam, unified under the Nguyễn, confronted French expansion. Treaties from 1862 to the 1880s created the colony of Cochinchina and the protectorates of Annam and Tonkin. Colonial rule reoriented infrastructure, plantations, and commerce while provoking sustained resistance, from Cần Vương networks to reformist and republican movements. The August Revolution of 1945 proclaimed independence; the First Indochina War ended with the 1954 Geneva Accords and a temporary partition.\n\nThe Democratic Republic of Vietnam in the north and the Republic of Vietnam in the south fought the Vietnam War until 1975. Reunification in 1976 formed the Socialist Republic of Vietnam. Postwar reconstruction faced embargoes and regional conflicts. Đổi Mới reforms from 1986 shifted to a market-oriented economy, driving export-led growth, poverty reduction, and urbanization. Vietnam joined ASEAN (1995) and the WTO (2007), and developed manufacturing, electronics, and services. Education access expanded; infrastructure modernized. Current policy manages maritime disputes, climate adaptation in the Mekong and Red River deltas, and governance and innovation agendas within an integrating regional economy."
    },
    {
        "name": "Scythia",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Mongolia"
            }
        ],
        "category": "Major",
        "description": "Scythia was the Greek name for the Pontic–Caspian steppe dominated by Iranian-speaking nomads from roughly the ninth to second centuries BCE. Scythian groups organized as flexible tribal confederations, excelled in mounted archery, and controlled long-distance routes linking the Black Sea to Central Asia. Archaeology reveals kurgan burials with horse gear, composite bows, and fine metalwork, the so‑called Scythian triad. Trade and warfare tied Scythia to Greek colonies on the north Black Sea, the Achaemenid Empire, and forest-steppe communities. Scythian elites mediated grain, slaves, and luxury goods and adopted goldwork styles now famous from burial mounds.\nTheir campaigns against the Achaemenids and alliances with Greek poleis show a diplomacy based on mobility and tribute. From the third century BCE, Sarmatian groups displaced many Scythians from the steppe core. Yet Scythian tactics, pastoral logistics, and political forms set patterns for later nomad polities across Eurasia, shaping the steppe corridor encountered by late antique and medieval powers."
    },
    {
        "name": "Hun",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Mongolia"
            }
        ],
        "upgradesFrom": [
            "Scythia"
        ],
        "category": "Major",
        "description": "The Hun confederation emerged on the Pontic steppe in the late fourth century CE, rapidly absorbing Alans and pressuring Gothic groups into Roman territory. Using composite bows, disciplined cavalry, and a tributary system, Hunnic leaders exploited the fracture lines of late Roman frontier politics. Under Attila (r. 434–453), they extracted subsidies from Constantinople, campaigned across the Balkans, entered Gaul in 451, and reached northern Italy in 452. The confederation fused Turkic, Iranian, and Germanic elements under a mobile command, supported by skilled horse archers and swift operational marches.\nAfter Attila’s death, internal rivalries and subject revolts broke the union at the Battle of Nedao (454). Although their polity dissolved, the Huns accelerated the Great Migration, transformed Danubian power balances, and spread steppe cavalry techniques and diplomatic practices into Europe. Their political model of overlordship, tribute, and delegated rule foreshadowed later steppe empires."
    },
    {
        "name": "Mongol",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Mongolia"
            }
        ],
        "upgradesFrom": [
            "Hun"
        ],
        "category": "Major",
        "description": "The Mongol Empire formed when Temüjin was proclaimed Chinggis Khan in 1206, uniting Mongol and allied Turkic groups of the eastern steppe. Through disciplined decimal organization, a courier relay (yam), systematic censuses, and incorporation of engineers and administrators from conquered realms, it expanded from North China and Central Asia to the Middle East and Eastern Europe. Siege technologies, operational intelligence, and flexible command enabled rapid campaigning and integration of new subjects. Policy favored merit promotion, religious tolerance, and secure caravan routes.\nThe empire promoted a transcontinental exchange often termed the Pax Mongolica. Texts, artisans, and goods moved between China, Iran, and the Mediterranean; so did pathogens, with the mid‑fourteenth‑century plague pandemic spreading along reopened routes. By the 1260s the empire divided into major khanates (Yuan, Ilkhanate, Chagatai, and the Jochid Ulus), yet commercial and diplomatic traffic continued. Mongol institutions framed successor states from the Volga to the Tarim, including the Golden Horde."
    },
    {
        "name": "Golden Horde",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Mongolia"
            }
        ],
        "upgradesFrom": [
            "Mongol"
        ],
        "category": "Major",
        "description": "The Golden Horde, or Jochid Ulus, arose in the 1240s under Batu Khan after campaigns in the Rus’ lands and the Volga region. Its capitals at Sarai on the lower Volga anchored a steppe–riverine economy that taxed trade between the Black Sea, Central Asia, and the forest zone. The Horde ruled Rus’ principalities through tribute and charters (yarlyks), balancing local elites while maintaining steppe military supremacy. Early rulers allied with the Mamluks against the Ilkhanate; Muslim conversion at the court culminated under Özbeg Khan (r. 1313–1341), who made Islam state religion and stabilized coinage and commerce.\nCivil wars after 1359 weakened the polity. Dmitry Donskoy’s victory at Kulikovo (1380) signaled Muscovite resilience, though Tokhtamysh briefly restored authority before Timur’s campaigns (1395) shattered Sarai. The ulus fragmented into successor khanates, including Kazan, Astrakhan, and Crimea. Its institutions shaped Muscovy’s rise, fiscal practices, and cavalry organization, while Black Sea trade networks persisted under Genoese and later Ottoman influence."
    },
    {
        "name": "Mongolia",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Mongolia"
            }
        ],
        "upgradesFrom": [
            "Golden Horde"
        ],
        "category": "Major",
        "description": "From the sixteenth century, Mongol polities reconfigured after the empire’s breakup. Khalkha and Oirat domains consolidated; Tibetan Buddhism spread after Altan Khan’s patronage of the Third Dalai Lama in 1578. The Qing incorporated Khalkha Mongols in 1691, organizing banners and limiting warfare while facilitating regulated trade. Qing rule lasted until 1911, when Outer Mongolia declared independence under the Bogd Khan. After a 1921 revolution supported by Soviet forces, the Mongolian People’s Republic formed in 1924. Collectivization and antireligious campaigns in the 1930s devastated monasteries; victory at Khalkhin Gol (1939) secured borders with Japan. The Republic gained broad recognition in 1945–46 and joined the UN in 1961.\nA peaceful transition in 1990 created a multi‑party parliamentary system and market economy. Since then, mining—especially copper and gold at Oyu Tolgoi—has driven growth alongside volatility. Policy balances Russia and China with “third neighbor” partnerships. Urbanization centers on Ulaanbaatar, with challenges of air pollution, dzud losses, and desertification. Recent initiatives expand rail links, renewable energy, and revival of the traditional script, while pastoralism and the Naadam festival sustain cultural continuity."
    },
    {
        "name": "Tibetan",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Tibet"
            }
        ],
        "category": "Major",
        "description": "After imperial collapse, Tibetan polities fragmented (10th–16th centuries), but intellectual and artistic life expanded. A second diffusion of Buddhism brought teachers from India and Kashmir. New schools arose: Kadam, Sakya, Kagyu, and later Gelug. Monastic estates organized agriculture, pastoralism, and scholastic training. Under Yuan oversight the Sakya school governed much of central Tibet via patron–priest ties, while local aristocracies administered districts. Printing houses at Narthang and other centers produced canonical editions. Gold and copper coinage linked markets to Nepalese trade, and Newar artisans reshaped architecture and sculpture.\n\nAfter 1354 the Phagmodrupa restored central authority, issuing concise law codes and promoting scholastic networks. Later Rinpungpa and Tsangpa houses contested control, fostering patronage of art and ritual. Tashilhunpo monastery (1447) and large debate colleges anchored a rigorous philosophical curriculum. Medical learning matured through compendia and clinical practice. By the 16th century, these developments created the institutional base on which later central governments operated."
    },
    {
        "name": "Zhangzhung",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Tibet"
            }
        ],
        "upgradesFrom": [
            "Tibetan"
        ],
        "category": "Major",
        "description": "Zhangzhung was an early culture and kingdom of western and north-western Tibet, active from the late Bronze Age into the first millennium CE. Its heartlands lay around Mount Kailash and the upper Sutlej. Fortified hill sites, rock art, and metalwork indicate regional polities tied to trans-Himalayan trade with Ladakh, Kashmir, and the Tarim Basin. The Zhangzhung language, non-Tibetic and preserved in later manuscripts and toponyms, shows a distinct cultural substrate. Bon religion developed in this milieu, with ritual, cosmology, and healing traditions that later entered Tibetan learned culture. Political organization appears to have been confederative, balancing local chiefs and ritual elites. In the seventh century Zhangzhung was incorporated into the expanding Tibetan Empire, ending its autonomy but not its influence. Bon textual traditions, calendrics, and elements of ritual practice persisted and were integrated into Tibetan scholastic systems. Archaeological work in Ngari continues to refine the chronology and material culture of Zhangzhung."
    },
    {
        "name": "Yarlung",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Tibet"
            }
        ],
        "upgradesFrom": [
            "Zhangzhung"
        ],
        "category": "Major",
        "description": "The Yarlung dynasty consolidated power in the Yarlung Valley and formed the Tibetan Empire in the 7th–9th centuries. Songtsen Gampo unified central polities, absorbed Zhangzhung, and established diplomatic ties with Nepal and Tang China. Court scholars devised a Tibetan script, enabling royal edicts, tax records, and translation projects. Under Trisong Detsen the court endorsed Buddhism, founded Samye monastery, and sponsored large-scale translation of Indian treatises. Administrative measures created relay stations, census-based taxation, and garrison networks from the Plateau to the Tarim. Treaties with Tang, including the 821–823 agreement recorded on a Lhasa pillar, stabilized frontiers. Ralpacan continued cultural patronage, while Old Tibetan Annals from Dunhuang attest to military campaigns and governance. Following the assassination of Langdarma (c. 842), the empire fragmented into regional regimes. The Yarlung period established the script, lawmaking, and monastic institutions that framed subsequent Tibetan political and intellectual life."
    },
    {
        "name": "Ganden Phodrang",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Tibet"
            }
        ],
        "upgradesFrom": [
            "Yarlung"
        ],
        "category": "Major",
        "description": "The Ganden Phodrang government was established in 1642 when the Fifth Dalai Lama, backed by the Khoshut ruler Güshi Khan, unified Ü and Tsang under a Lhasa-based regime. The Potala Palace and large Gelug monasteries became administrative and scholastic hubs. After Dzungar incursions, Qing forces intervened (1720), installed ambans, and issued regulatory codes in 1751 and 1793 that defined executive roles, tribute, and frontier defense. The state maintained diplomatic and military activity, including wars with Nepal and the 1904 British expedition. With the Qing collapse in 1911–1912, the 13th Dalai Lama reasserted control, introduced a small standing army, minted currency and stamps, and attempted fiscal and legal reforms.\n\nModernizing efforts remained limited in scale. In 1950 PLA forces entered eastern Tibet; the 17-Point Agreement (1951) altered the framework of authority. The 1959 Lhasa uprising ended the government’s rule in Tibet, and leadership continued in exile. The Ganden Phodrang’s legacy includes stable legal-administrative forms, a broad monastic education system, and advances in arts, architecture, and medicine."
    },
    {
        "name": "Tibet",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Tibet"
            }
        ],
        "upgradesFrom": [
            "Ganden Phodrang"
        ],
        "category": "Major",
        "description": "From the 1950s Tibet entered the industrial and contemporary era within the People’s Republic of China. The Tibet Autonomous Region was established in 1965, while large Tibetan populations live in Qinghai, Sichuan, Gansu, and Yunnan. Collectivization and the Cultural Revolution disrupted religious and cultural life. Since the 1980s, monasteries reopened and cultural production revived under regulation. Episodes of unrest occurred in the late 1980s and in 2008. Infrastructure expanded rapidly: the Qinghai–Tibet railway (2006), highways, airports, and power grids linked plateau cities to national markets.\n\nEconomic policy emphasizes construction, services, and energy, with poverty reduction and social services scaling up. Literacy, life expectancy, and access to healthcare improved, while debates continue over language policy and heritage protection. Large nature reserves, including the Qiangtang, target biodiversity and rangeland conservation as climate change alters glaciers and permafrost. Tourism and pilgrimage shape urban growth in Lhasa and Shigatse. Tibetan communities in the diaspora sustain education and publishing, and maintain links to homeland culture. Cross-border trade through Nepal and India has resumed at select corridors. Digital tools and Unicode standards now support Tibetan research, archives, and media."
    },
    {
        "name": "Hittite",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Turkey"
            }
        ],
        "category": "Major",
        "description": "The Hittite kingdom emerged in central Anatolia in the 17th century BCE and consolidated under the Old and later the New Kingdom with its capital at Hattusa. It developed an advanced bureaucratic state using cuneiform, preserving the earliest extensive Indo-European texts, legal codes, festival records, and diplomatic correspondence. The empire expanded across Anatolia and into northern Syria, administering key cities through viceroyalties at Aleppo and Carchemish. It engaged Egypt as a peer power; the aftermath of the Battle of Kadesh produced one of the earliest surviving international treaties. Fortification architecture, road systems, and state cults supported imperial cohesion.\n\nAfter about 1200 BCE the central state collapsed amid regional upheaval, climate stress, and external attacks. Neo-Hittite principalities persisted in southeastern Anatolia and Syria. Hittite legal and diplomatic practices influenced later Near Eastern polities, and the archaeological record at Hattusa, with its archives and city walls, remains a primary source for Bronze Age Anatolia."
    },
    {
        "name": "Pontus",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Turkey"
            }
        ],
        "upgradesFrom": [
            "Hittite"
        ],
        "category": "Major",
        "description": "The Kingdom of Pontus was a Hellenistic state formed on the Black Sea coast of Anatolia around 281 BCE by Mithridates I Ktistes. Its ruling house claimed Achaemenid lineage while adopting Greek urbanism and coinage, creating a mixed Persian and Hellenistic court culture. Capitals shifted from Amasia to the port of Sinope, which anchored Black Sea trade in timber, metals, grain, and enslaved labor. The kingdom extended influence over the Bosporan Kingdom and interior highlands through alliances and garrisons.\n\nUnder Mithridates VI Eupator (120–63 BCE), Pontus challenged Rome across Asia Minor and Greece in the three Mithridatic Wars. Despite early successes, Roman counteroffensives by Sulla, Lucullus, and Pompey dismantled Pontic power. The territory was absorbed into Roman provincial systems (Bithynia et Pontus and related units). Urban networks and Pontic Greek communities endured, feeding into later Byzantine coastal society and the long-standing maritime economy of the Black Sea."
    },
    {
        "name": "Seljuk",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Turkey"
            }
        ],
        "upgradesFrom": [
            "Pontus"
        ],
        "category": "Major",
        "description": "The Seljuk presence in Anatolia followed the Battle of Manzikert in 1071, leading to the Sultanate of Rum with centers at Nicaea and later Konya. The polity integrated Turkic military elites with Persian administrative norms and Islamic jurisprudence. It stabilized routes between Iran, Syria, and the Aegean through fortified caravanserais, bridges, and market regulation. Architectural patronage produced stone mosques, madrasas, and khans marked by monumental portals and geometric ornament.\n\nThe Seljuks of Rum fought Byzantines, Crusader states, and rival Turkish dynasties, gradually assimilating the Danishmendids and other principalities. Scholarly life grew in madrasas tied to Sufi networks and urban guilds. Defeat by the Mongols at Köse Dağ in 1243 brought vassalage to the Ilkhanate and accelerated fragmentation into beyliks. One frontier beylik, led by the Ottoman house near Söğüt, expanded as Seljuk authority receded, transmitting institutions and road systems into the next imperial phase."
    },
    {
        "name": "Ottoman",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Turkey"
            }
        ],
        "upgradesFrom": [
            "Seljuk"
        ],
        "category": "Major",
        "description": "The Ottoman polity arose from a frontier beylik in northwestern Anatolia in the late 13th century. It expanded into the Balkans, absorbed rival Anatolian beyliks, and captured Constantinople in 1453 under Mehmed II. A centralized imperial structure formed around the timar land system, the devshirme-based Janissary corps, and a multilingual chancery. Under Suleiman I, the empire reached legal and territorial high points, extending from Hungary to Iraq and from Algeria to the Red Sea. Monumental architecture by Sinan and a regulated fiscal-military apparatus defined its classical age.\n\nFrom the 17th century, shifts in warfare, trade routes, and provincial autonomy reshaped the state. Reform efforts culminated in the Tanzimat, modern schools, and new legal codes. Nationalist movements and great-power wars eroded holdings in Europe and the Arab provinces. During the First World War, the Committee of Union and Progress aligned with the Central Powers; mass violence, including the 1915 Armenian Genocide, devastated populations. Military defeat and occupation triggered the Anatolian resistance that led to the Turkish Republic, ending the empire in 1922–23."
    },
    {
        "name": "Turkey",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Turkey"
            }
        ],
        "upgradesFrom": [
            "Ottoman"
        ],
        "category": "Major",
        "description": "Founded in 1923 after the War of Independence, the Republic of Turkey pursued state-led modernization under Mustafa Kemal Atatürk. Reforms established secular civil law, the Latin alphabet, universal primary education, and new institutions in industry and public health. Ankara became the capital. A single-party era ended in 1950 with competitive elections. The Cold War aligned Turkey with NATO and spurred infrastructure, urbanization, and migration. Military interventions in 1960, 1971, 1980, and 1997 shaped political life, while Kurdish insurgency and social change tested state capacity.\n\nFrom 2002, the AKP oversaw growth, expanded social services, and EU-aligned legal changes, followed by assertive regional policy and a shift to a presidential system in 2018 after the failed coup attempt of 2016. Major projects in transport and energy, a growing defense industry, and diversified manufacturing define the economy alongside chronic inflation cycles. Foreign policy balances NATO commitments with roles in the Black Sea, Caucasus, and Middle East. Contemporary Turkey is an upper-middle-income, urbanized state with influential media, tourism, and cultural sectors centered on Istanbul, Ankara, and Izmir."
    },
    {
        "name": "Bactria",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Uzbekistan"
            }
        ],
        "category": "Major",
        "description": "Bactria arose on the Oxus and Balkh oasis as a Bronze Age urban zone linked to the Bactria–Margiana Archaeological Complex. By the 6th century BCE it formed an Achaemenid satrapy with irrigated agriculture and metalwork of high quality. Alexander took Bactria in 329–327 BCE and founded colonies. The Greco-Bactrian Kingdom emerged in the 3rd–2nd centuries BCE, striking fine coinage and building cities such as Ai Khanum. Hellenistic rule blended with Iranian and Indian currents and pushed into the Indus. In the 2nd century BCE Yuezhi migrations reshaped the region and led to the Kushan Empire. Bactra (Balkh) remained a key node for trade and Buddhist transmission toward the Tarim and China. The region’s canals, urban craft traditions, and mixed elite culture set the template for later Transoxian centers that Sogdian merchants and Islamic dynasties would inherit."
    },
    {
        "name": "Sogdia",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Uzbekistan"
            }
        ],
        "upgradesFrom": [
            "Bactria"
        ],
        "category": "Major",
        "description": "Sogdia comprised Iranian city-states centered on Samarkand, Bukhara, and Panjikent. It lay between the Syr Darya and Amu Darya and entered written history under the Achaemenids. After Alexander and the Seleucids, local elites adapted to steppe and oasis powers. From the 4th to 8th centuries CE Sogdian merchants dominated Silk Road exchange from Chang’an to Iran. They carried textiles, metals, paper, and horses. The Sogdian script and letters document contracts, religion, and family life. Murals at Panjikent show narrative art of rare detail. Zoroastrianism, Buddhism, Manichaeism, and Church of the East communities coexisted. Turkic kaghanates ruled in the 6th–7th centuries; Tang garrisons followed. Arab conquest in the 8th century began gradual Islamization and political change. The Sogdian language shaped Uyghur writing and Central Asian chancery practice. Commercial networks, urban planning, and crafts passed to early Islamic rulers, preparing the rise of Persianate statehood."
    },
    {
        "name": "Samanid",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Uzbekistan"
            }
        ],
        "upgradesFrom": [
            "Sogdia"
        ],
        "category": "Major",
        "description": "The Samanid dynasty (819–999) consolidated Transoxiana and Khurasan under a Persianate Sunni regime loyal to the Abbasids yet effectively autonomous. Isma‘il ibn Ahmad made Bukhara the capital; Samarkand remained a major center. The court fostered New Persian literature and learning. Rudaki, early epic projects, jurists, and physicians worked under Samanid patronage. The Samanid Mausoleum at Bukhara shows advanced brickwork and proportional design. Silver dirhams circulated from the Islamic world to the Baltic, linking steppe fur and slave trades with Iranian markets. Administration relied on dihqans, Hanafi law, and a tax system that supported irrigation and city walls. Caravan routes to China and the steppe were protected. After internal strains and frontier pressures, the Karakhanids seized Transoxiana in 999, while the Ghaznavids took Khurasan. Samanid institutions and urban culture framed the later Turkic–Persian synthesis in Central Asia."
    },
    {
        "name": "Timurid",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Uzbekistan"
            }
        ],
        "upgradesFrom": [
            "Samanid"
        ],
        "category": "Major",
        "description": "Timur founded his empire in 1370 with Samarkand as capital and Herat as a second center. Campaigns reshaped West and South Asia, from Iran and Iraq to Delhi and Anatolia. The court resettled artisans and scholars to Central Asian cities. Monumental construction followed. Bibi-Khanym Mosque and the Gur-e Amir defined a new architectural scale with glazed tile and ribbed domes. Under Shah Rukh and Gawhar Shad, Herat became a premier arts hub. The Herat school of painting and book arts matured. Alisher Navoi advanced Chagatai literature in the late 15th century. Ulugh Beg established an observatory and produced the Zij-i Sultani, a star catalog of high precision. Administration fused steppe military elites with Persian chancery practice. After succession conflicts, the Uzbeks took Transoxiana by 1500–1507. Timurid cultural models persisted in Central Asia and passed to Mughal India through Babur."
    },
    {
        "name": "Uzbekistan",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Uzbekistan"
            }
        ],
        "upgradesFrom": [
            "Timurid"
        ],
        "category": "Major",
        "description": "Uzbek tribes under Muhammad Shaybani conquered Transoxiana in the early 16th century and founded the Shaybanid state with Bukhara as the main seat. Sunni Hanafi institutions, madrasas, and crafts revived urban life. The Mir-i Arab Madrasa and robust mints marked stable rule. After 1599 the Ashtarkhanid (Janid) line governed Bukhara; separate khanates of Khiva and Kokand rose. The 18th–19th centuries saw caravan trade with Russia, cotton expansion, and internecine wars. Russian conquest in the 1860s–1870s created protectorates in Bukhara and Khiva and annexed Kokand. Reformist Jadids promoted modern schools and print. In 1924 Soviet national delimitation formed the Uzbek SSR. Industrialization, railways, and cotton monoculture followed, along with the Aral Sea disaster. World War II evacuees boosted factories and culture in Tashkent and Samarkand. Independence came in 1991. The Republic of Uzbekistan pursued state consolidation, then economic and legal reforms after 2016. Today it invests in energy, transport corridors, and heritage tourism while managing water, labor, and environmental challenges."
    },
    {
        "name": "Venedi",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Poland"
            }
        ],
        "category": "Major",
        "description": "The Venedi were Iron Age and Late Antiquity peoples recorded by Roman authors around the Baltic–Vistula zone. Tacitus, Pliny, and Ptolemy located them east of the Vistula and along the forest-steppe fringe. Archaeology links their horizon to groups interacting with the Przeworsk and Zarubintsy cultures. Their settlements combined small farmsteads with periodic hillforts that controlled river routes. Economy mixed cereal farming, animal husbandry, and exploitation of bog iron. Long-distance exchange tied them to the Amber Road and to markets on the Black Sea.\n\nEthnic attribution is debated, yet many scholars treat the Venedi as ancestors of early Slavic-speaking communities. Burial customs shifted from cremation to inhumation in Late Antiquity, showing contacts with Germanic and Baltic neighbors. Metalworking and weapon finds indicate organized war bands. By the 5th–6th centuries their population fed into the broader Slavic expansion toward the Elbe, the Danube, and the upper Dnieper."
    },
    {
        "name": "Polans",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Poland"
            }
        ],
        "upgradesFrom": [
            "Venedi"
        ],
        "category": "Major",
        "description": "The Polans were a West Slavic tribal polity centered in the Warta basin of Greater Poland in the 9th–10th centuries. From strongholds at Poznań, Gniezno, and Ostrów Lednicki, they built a network of gords, roads, and fiscal districts. Mieszko I unified neighboring groups, fielded a professional retinue, and engaged with the Ottonian Empire and Bohemia. His baptism in 966 integrated the polity into Latin Christendom and opened episcopal organization.\n\nAround 991 the Dagome iudex text recorded the realm’s frontiers. The Congress of Gniezno in 1000 established an archbishopric and affirmed sovereign standing. Under Bolesław I, coin minting, stone architecture, and expansion toward Silesia and Lesser Poland consolidated a kingdom. The Polans’ institutions, tribute systems, and fortified centers formed the core of the Piast state, which would evolve into the medieval Kingdom of Poland."
    },
    {
        "name": "Poland (Medieval)",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Poland"
            }
        ],
        "upgradesFrom": [
            "Polans"
        ],
        "category": "Major",
        "description": "The medieval Kingdom of Poland emerged from the Piast realm and, after 1138, underwent dynastic fragmentation. Regional principalities promoted colonization under German town law, Cistercian land development, and new agrarian techniques. Mongol raids in 1241 devastated Lesser Poland but did not halt urban growth. Reunification advanced under Władysław I, crowned in 1320. Casimir III (1333–1370) codified law, expanded royal administration, fortified borders, and founded the University of Kraków in 1364. Royal policy confirmed the rights of Jewish communities, renewing the Kalisz privileges.\n\nThe late 14th century brought the Polish–Lithuanian union (1385–1386) and Jagiellonian rule. Victory at Grunwald in 1410 and the Second Peace of Toruń in 1466 reduced the Teutonic Order and integrated Royal Prussia. A representative Sejm developed alongside provincial diets. By the late 15th century Poland was a major Central European monarchy with a literate clergy, growing nobility, and a network of self-governing towns."
    },
    {
        "name": "Poland (Commonwealth)",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Poland"
            }
        ],
        "upgradesFrom": [
            "Poland (Medieval)"
        ],
        "category": "Major",
        "description": "Poland in the Early Modern and Enlightenment era was the Polish–Lithuanian Commonwealth, a nobility republic with elective monarchy and the Sejm. The Warsaw Confederation (1573) established confessional peace. Yet the liberum veto and magnate factions stalled legislation. Mid‑17th‑century wars, including the Swedish “Deluge,” weakened fiscal capacity and depopulated wide areas. John III Sobieski’s victory at Vienna in 1683 slowed Ottoman advances but did not restore institutional balance.\n\nEighteenth‑century reformers pursued renewal under Stanisław August Poniatowski. The Commission of National Education (1773) reorganized schools and curricula. The Cadet Corps trained a modern officer corps. Economic societies promoted manufactures and improved estates. The Constitution of 3 May 1791 strengthened central authority, protected townspeople, and limited serfdom. Foreign intervention, the Targowica Confederation, and the failed Kościuszko Uprising (1794) led to the three Partitions (1772, 1793, 1795). Despite the loss of statehood, Enlightenment institutions and political thought framed later national movements."
    },
    {
        "name": "Poland (Modern)",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Poland"
            }
        ],
        "upgradesFrom": [
            "Poland (Commonwealth)"
        ],
        "category": "Major",
        "description": "After the partitions, Polish lands lay under Russia, Prussia, and Austria. The nineteenth century brought uprisings (1830–31, 1863–64), Russification and Germanization, and autonomy in Austrian Galicia after 1867. Industry grew in Łódź, Upper Silesia, and the Dąbrowa Basin; Galicia pioneered petroleum under Ignacy Łukasiewicz. Despite censorship, a modern intelligentsia emerged.\n\nIndependence returned in 1918 with the Second Republic. Border conflicts ended with Riga (1921). Interwar governments built Gdynia and the Central Industrial Region, reformed education, and advanced aviation. World War II brought occupation, the Holocaust, Katyn, and a vast resistance. Post‑1945 the People’s Republic rebuilt and industrialized within the Soviet bloc. Crises in 1956, 1970, and 1980 produced Solidarity, martial law, and a negotiated transition in 1989.\n\nThe Third Republic liberalized the economy, joined NATO (1999) and the EU (2004), and achieved sustained growth. Science and technology advanced in cryptology, mathematics, and medicine, continuing earlier traditions. Recent years saw infrastructure upgrades, demographic and energy challenges, political polarization and judicial disputes with the EU, large‑scale aid to Ukraine after 2022, and defense modernization."
    },
    {
        "name": "Slavs",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Russia"
            }
        ],
        "category": "Major",
        "description": "Early Slavic communities emerged from Late Bronze and Early Iron Age societies of the East European forest and forest-steppe. Archaeology links them to cultures such as Zarubintsy, Przeworsk, Kiev, and later Prague–Korchak and Penkovka. They practiced mixed farming, kept livestock, and used iron tools. Settlements featured sunken-floor houses and small hillforts. Pottery was handmade with simple forms. Social life centered on kin groups and village assemblies. Metalworking and textile production were widespread.\n\nFrom the fifth to seventh centuries, Slavic groups expanded across Central and Southeastern Europe. They moved along the Vistula, Dnieper, and Danube corridors into the Balkans and toward the Elbe. Dialect diversification produced East, West, and South Slavic branches. Contacts with steppe peoples and Byzantium accelerated military and political change. These communities formed the demographic and cultural base for early medieval polities, including Great Moravia, the First Bulgarian Empire, and, later, the Rus' principalities. Their language and agrarian traditions framed subsequent regional state formation."
    },
    {
        "name": "Antes",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Russia"
            }
        ],
        "upgradesFrom": [
            "Slavs"
        ],
        "category": "Major",
        "description": "The Antes were a sixth–seventh century Slavic confederation recorded by Byzantine authors between the Dniester and lower Dnieper. They are associated with the Penkovka cultural horizon. Leadership combined warlords with councils. Horse gear and light infantry equipment indicate flexible warfare. They raided and also served as foederati for Byzantium, guarding the Danubian frontier under Justinian. Trade and tribute linked them to Black Sea cities.\n\nConflict with the Avar Khaganate shaped their fate. The killing of the envoy Mezamir and campaigns of the 580s–600s weakened the confederation. Around 602 Avar pressure and steppe turbulence dissolved the Antes. Their people merged with neighboring Slavic groups. They contributed to the ethnogenesis of the East Slavs recorded later around the Dnieper. Through migration and assimilation they fed into tribal groupings known in early Rus' sources, providing a bridge between late antique Slavic societies and the political landscape that produced Kievan Rus'."
    },
    {
        "name": "Muscovy",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Russia"
            }
        ],
        "upgradesFrom": [
            "Antes"
        ],
        "category": "Major",
        "description": "The Grand Duchy of Moscow rose in the fourteenth–sixteenth centuries as the leading Rus' principality under Mongol-Tatar overlordship. Its princes consolidated lands through alliance, purchase, and force. Tax-farming for the Horde and control of church revenues strengthened the treasury. Victory at Kulikovo in 1380 and the 1480 standoff on the Ugra River ended dependence on the Horde. Ivan III annexed Novgorod in 1478 and Tver in 1485, and styled himself sovereign of all Rus'. Legal codification in the Sudebnik of 1497 and the pomestie service land system built a service state.\n\nIvan IV assumed the title Tsar in 1547, convened the Stoglav Council in 1551, and founded a permanent streltsy infantry. Conquests of Kazan (1552) and Astrakhan (1556) opened the Volga. Yermak’s campaign began Siberian expansion in the 1580s. The printing press appeared in Moscow in 1564. The Oprichnina and the Livonian War destabilized the realm, leading to the Time of Troubles (1598–1613). The Romanov dynasty restored order, and Muscovy evolved into the Tsardom of Russia."
    },
    {
        "name": "Russia",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Russia"
            }
        ],
        "upgradesFrom": [
            "Muscovy"
        ],
        "category": "Major",
        "description": "The Tsardom and Russian Empire spanned the seventeenth to early twentieth centuries. Early Romanov rulers restored institutions and expanded east to the Pacific, fixing the Sino-Russian border by the Treaty of Nerchinsk in 1689. Peter I built a conscript army and a blue-water navy, founded Saint Petersburg, created the Senate and Table of Ranks, and subordinated the church to the Holy Synod. Victory in the Great Northern War (1700–1721) secured the Baltic, and in 1721 the empire was proclaimed.\n\nCatherine II extended control to the Black Sea, completed partitions of Poland, and advanced administrative reform. The nineteenth century brought defeat in the Crimean War, the 1861 emancipation of the serfs, judicial and zemstvo reforms, and industrialization under Witte. The Trans-Siberian Railway linked the empire. Cultural and scientific life flourished. Military setbacks in 1904–1905 triggered revolution and a State Duma. World War I exhausted the regime. The 1917 revolutions ended the monarchy, and civil war paved the way for the formation of the Soviet Union in 1922."
    },
    {
        "name": "Soviet Union",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Russia"
            }
        ],
        "upgradesFrom": [
            "Russia"
        ],
        "category": "Major",
        "description": "The Union of Soviet Socialist Republics was founded in 1922 after the Bolshevik victory in the civil war. It built a centralized planned economy, nationalized industry, and collectivized agriculture. Rapid industrialization in the 1930s created heavy industry but caused famine and repression. The state survived the 1941–1945 German invasion at immense cost, emerged as a superpower, and established an Eastern European security bloc. It tested a nuclear device in 1949 and led early spaceflight with Sputnik (1957) and Gagarin (1961). Education, science, and defense sectors expanded.\n\nKhrushchev dismantled parts of the terror system and pursued reform. Growth slowed under Brezhnev amid bureaucratic stagnation and the Afghan war. Gorbachev’s perestroika and glasnost loosened controls, triggered nationalist movements, and exposed structural crisis. The USSR dissolved in 1991 into fifteen states. The Russian Federation inherited the UN seat, much of the military, and core industries. Post-Soviet transitions reshaped economies and politics. Soviet infrastructure, research establishments, and cultural memory continue to influence contemporary Russia and other successor states in security, energy, and space cooperation."
    },
    {
        "name": "Caledonia",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Scotland"
            }
        ],
        "category": "Major",
        "description": "Caledonia was the Roman name for northern Britain beyond the Forth–Clyde isthmus. It encompassed diverse Iron Age communities, including the Caledonii and Maeatae. Settlement was dispersed, with hillforts, crannogs, and brochs in some regions. Agriculture, hunting, and metalworking sustained small-scale polities linked by kin and alliance. Contact with Rome intensified in the first and second centuries CE. Agricola’s campaign and the battle of Mons Graupius (c. 83) entered Roman literature, though direct control proved brief. The Antonine Wall marked the northern limit of sustained Roman garrisoning; Hadrian’s Wall remained the longer frontier. Trade moved across the borderlands despite conflict. Archaeology indicates long continuity in material culture, along with adoption of selected Roman goods. Latin and Roman administration never took hold. By Late Antiquity, power coalesced in larger confederations that would later be known from external sources as Pictish. The Roman withdrawal from Britain left the region independent, culturally distinct, and in contact with Ireland and Scandinavia."
    },
    {
        "name": "Picts",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Scotland"
            }
        ],
        "upgradesFrom": [
            "Caledonia"
        ],
        "category": "Major",
        "description": "The Picts emerged in Late Antiquity as northern British confederations recorded by Latin writers from the third century. Their core lay north of the Forth and in the northeast, with Fortriu often prominent. Society combined kin-based lordship with warrior elites and ecclesiastical centers. Conversion progressed from the sixth century through missions linked to Iona and Irish networks. Monasteries, inscribed stones with distinctive motifs, and fine metalwork attest to craft skill and dynastic display. The Picts checked Northumbrian expansion at Nechtansmere (685), shaping the political map of Britain. Naval raiding reached as far as the Irish Sea. Norse attacks and settlement along the northern and western coasts in the ninth century disrupted coastal polities. Under Cináed mac Ailpín (Kenneth MacAlpin) and successors, Pictish and Dál Riatan aristocracies fused, producing the kingdom later called Alba. Language shift toward Gaelic followed among elites, while regional diversity persisted. By the tenth century, Pictish identity had been absorbed into the developing Scottish realm."
    },
    {
        "name": "Scots",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Scotland"
            }
        ],
        "upgradesFrom": [
            "Picts"
        ],
        "category": "Major",
        "description": "The Scots originated as Gaelic-speaking communities centered in Dál Riata in Argyll and Antrim during the early medieval period. Maritime links bound western Scotland and northern Ireland. From the ninth century, the merger of Pictish and Dál Riatan elites produced Alba, ruled by kings who extended authority from the Tay northward and south toward Lothian. Gaelic became dominant at court, while Brittonic, Norse, and later English dialects shaped regional life. Between the eleventh and thirteenth centuries, rulers such as David I introduced feudal tenures, royal burghs, coinage, and reformed monasteries, integrating Scotland into broader European systems. Universities at St Andrews, Glasgow, and Aberdeen anchored learning. The Wars of Independence against England (late thirteenth to early fourteenth centuries) preserved sovereignty under Robert I. The Stewart dynasty consolidated rule, fostered courts of law, and cultivated a Renaissance court under James IV. The Protestant Reformation (1560) reorganized religion along Reformed lines. Union of the Crowns in 1603 linked monarchies while institutions remained distinct."
    },
    {
        "name": "Scotland (Enlightenment)",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Scotland"
            }
        ],
        "upgradesFrom": [
            "Scots"
        ],
        "category": "Major",
        "description": "After the 1707 Acts of Union, Scotland entered a phase of rapid intellectual and economic change. The early eighteenth century saw political upheaval in the Jacobite risings of 1715 and 1745, followed by military pacification, road building, and the integration of Highland and Lowland markets. Urban growth in Edinburgh and Glasgow supported clubs, societies, and universities that fostered the Scottish Enlightenment. David Hume advanced empirical philosophy; Adam Smith analyzed moral sentiments and political economy; Francis Hutcheson, Thomas Reid, and others developed common sense philosophy; James Hutton transformed geology. Physicians, engineers, and printers circulated knowledge through journals and lectures. Agricultural improvement reshaped estates, while commercial expansion connected Glasgow to Atlantic trade. The Edinburgh New Town articulated neoclassical planning. Legal scholarship and education modernized institutions without abolishing the distinct Scots law and church. These reforms and ideas carried into the early Industrial Revolution, shaping Scottish expertise in engineering, medicine, and the sciences across the British Isles and overseas."
    },
    {
        "name": "Scotland (Modern)",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Scotland"
            }
        ],
        "upgradesFrom": [
            "Scotland (Enlightenment)"
        ],
        "category": "Major",
        "description": "Nineteenth-century Scotland industrialized rapidly. Coal, iron, and shipbuilding anchored the Clyde and central belt. Railways, engineering works, and textile towns drew migrants from the Highlands, Ireland, and rural Lowlands. Urban culture expanded through newspapers, mechanics’ institutes, and civic philanthropy. Scotland contributed disproportionately to the British Empire through commerce, missionary work, and technical skill. The First and Second World Wars mobilized industry and manpower, then left restructuring challenges. Postwar decades brought welfare state reforms, new towns, and eventually deindustrialization in the 1970s–1980s. North Sea oil from the 1970s altered the economy and politics. Financial services, universities, life sciences, and creative industries grew, with major investment in renewable energy. Devolution in 1999 restored a Scottish Parliament with powers over domestic policy. An independence referendum in 2014 retained the Union while sustaining constitutional debate. Scotland voted Remain in the 2016 EU referendum, intensifying discussion over its status. Contemporary Scotland balances cultural revival in Gaelic and Scots with diversified, low‑carbon economic goals."
    },
    {
        "name": "Nordic",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Sweden"
            }
        ],
        "category": "Major",
        "description": "The Nordic Bronze Age (c. 1700–500 BCE) defined the prehistory of Scandinavia and the Baltic shores. Communities farmed cereals, raised cattle, and lived in timber longhouses. Elite barrows and stone ship settings signaled hierarchy. Bronze arrived via long-distance exchange; regional smiths produced rapiers, axes, razors, belt plates, and lurs. Petroglyphs, hoards, and sun motifs indicate seasonal rites and a solar cult. Amber moved south to Central Europe and the Mediterranean while metals and styles moved north.\nMaritime skill advanced with plank-built boats and coastal routes that joined Jutland, southern Scandinavia, and the Baltic archipelagos. Shared art styles and durable kin networks spread across the region. Late phases saw climatic cooling and settlement shifts. Technical knowledge, seaborne exchange, and ritual landscapes provided the foundations for Iron Age society in Scandinavia."
    },
    {
        "name": "Norse",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Sweden"
            }
        ],
        "upgradesFrom": [
            "Nordic"
        ],
        "category": "Major",
        "description": "Iron Age Scandinavia (c. 500 BCE–800 CE) formed the Norse cultural matrix. The pre-Roman and Roman Iron Ages brought improved smithing, hillforts, and bog deposits of weapons. Trade with Rome moved amber and furs south and imported glass, silver, and bronzes. The Elder Futhark runic script appeared by the 2nd century CE. The Migration and Vendel periods produced rich boat graves, helmeted elites, and workshops at centers in Uppland and Gotland. Clinker-built hulls and sailing rigs matured.\nLaw assemblies (things), warbands, and cult practice around Odin, Thor, and Freyr coalesced. Tribal polities of the Svear and Götar emerged, with ties across the Baltic. Craft specialization increased in iron, textiles, and wood. These institutions, technologies, and sea lanes set the conditions for the Viking Age’s rapid expansion and the crystallization of Scandinavian kingdoms."
    },
    {
        "name": "Viking",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Sweden"
            }
        ],
        "upgradesFrom": [
            "Norse"
        ],
        "category": "Major",
        "description": "The Viking Age (c. 750–1100 CE) expanded Norse horizons from the North Atlantic to the Black and Caspian Seas. Longships with clinker hulls enabled fast raiding, convoy trade, and colonization. Towns such as Birka, Hedeby, and Kaupang linked craft production to silver circuits; massive dirham hoards on Gotland show east-west exchange. Swedes moved along the Dnieper and Volga, served as Varangians, and connected to Byzantium and the Caliphate. Danes and Norwegians founded settlements in the British Isles, Normandy, Iceland, and Greenland, with brief landfall in North America.\nRunestones, metalwork, and woodcarving defined distinctive art styles. Things codified law; ship burials and chamber graves recorded elite culture. Christianity spread from the late 10th century, reshaping ritual and literacy. Coinage and kingship followed, with royal centers at Sigtuna and elsewhere. The era ended as regional monarchies consolidated power and integrated Scandinavian realms into medieval Europe."
    },
    {
        "name": "Sweden (Kingdom)",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Sweden"
            }
        ],
        "upgradesFrom": [
            "Viking"
        ],
        "category": "Major",
        "description": "After the Viking Age, Swedish monarchs consolidated rule under Christianity, with Uppsala as a royal and ecclesiastical center. In the Middle Ages, Sweden joined the Kalmar Union (1397), but intermittent conflicts with Denmark led to independence in 1523 under Gustav Vasa. He established hereditary monarchy, nationalized church lands during the Reformation, and built a centralized state. By the seventeenth century Sweden emerged as a great power, exploiting Baltic trade and iron exports. Gustavus Adolphus modernized the army and intervened in the Thirty Years’ War, securing territories in Germany and prestige as a Protestant power. Successive wars expanded control over Finland, the Baltic provinces, and parts of Poland. The empire’s reach strained resources, and defeats against Russia, culminating at Poltava in 1709, marked decline. The Great Northern War ended in 1721 with territorial losses and reduced influence. Eighteenth-century Sweden alternated between parliamentary “Age of Liberty” politics and Gustavian monarchy, but defeat in the Napoleonic Wars forced the 1809 constitution and the cession of Finland to Russia."
    },
    {
        "name": "Sweden (Modern)",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Sweden"
            }
        ],
        "upgradesFrom": [
            "Sweden (Kingdom)"
        ],
        "category": "Major",
        "description": "Nineteenth-century Sweden combined constitutional reform (1809) with agrarian change, parish schooling (1842), and large migration to North America. Railways, sawmills, and steelworks drove industrialization. Firms in engineering and electrification emerged; inventors advanced dynamite, separators, and telecommunications. By 1900 an urban industrial society had formed. Universal suffrage arrived in 1921. The labor movement and employers forged the 1938 Saltsjöbaden Agreement. Sweden stayed neutral in both World Wars and built a comprehensive welfare state after 1945.\nPostwar growth produced global brands in vehicles, machinery, and telecom. A banking crisis in the early 1990s led to liberalization and fiscal rules. Sweden joined the European Union in 1995. The 2000s saw a dynamic tech sector and green industrial projects in the north. Migration reshaped demographics and policy. Energy mixes balance hydro, nuclear, and wind while industry develops fossil-free steel. Public debate followed Sweden’s distinct COVID-19 response. Security policy shifted after 2022; Sweden joined NATO in 2024. Today it remains a high-income democracy focused on innovation, welfare, and integration."
    }
]
