[
    {
        "name": "San",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Congo"
            }
        ],
        "city": "Tsodilo",
        "traits": [
            "Agricultural",
            "Diplomatic"
        ],
        "category": "Minor",
        "description": "The San are an ancient hunter-gatherer people of the Kalahari and adjacent regions. Archaeology and oral traditions indicate deep continuity. Rock art at the Tsodilo Hills preserves ritual scenes and game depictions. Subsistence relied on tracking, bow hunting with plant-based poisons, and gathering with digging sticks. Microlithic stone tools and later iron trade items were used. Small mobile bands maintained flexible territories and exchange ties. Click-language families show long linguistic diversity. Contact with Bantu-speaking farmers and later colonial frontiers constrained range but also enabled trade in meat, skins, and information. Ethnographic records document trance healing dances and detailed knowledge of water in grasslands and dunes. Today communities live in Botswana, Namibia, Angola, and South Africa, where land rights and heritage protection are active concerns."
    },
    {
        "name": "Namibia",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Congo"
            }
        ],
        "upgradesFrom": [
            "San"
        ],
        "city": "Windhoek",
        "traits": [
            "Industrious",
            "Cultural"
        ],
        "category": "Minor",
        "description": "Namibia is a southern African state on the Atlantic coast, independent since 1990. The area formed German South West Africa from the 1880s. War with Herero and Nama communities in 1904–08 led to mass death and dispossession. After World War I the League of Nations mandated the territory to South Africa, which imposed segregation and later apartheid laws. Nationalist movements, led by SWAPO, waged a protracted insurgency linked to regional decolonization. United Nations diplomacy produced a ceasefire and supervised elections. Independence was declared in March 1990 under a liberal constitution. Walvis Bay, retained by South Africa, was transferred in 1994. The capital is Windhoek. Major regions include the Namib Desert and the Kalahari margins. Mining, fisheries, ranching, and conservation areas such as Etosha shape the economy."
    },
    {
        "name": "Ziwa",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Congo"
            }
        ],
        "city": "Ziwa",
        "traits": [
            "Religious",
            "Agricultural"
        ],
        "category": "Minor",
        "description": "Ziwa denotes an Early Iron Age cultural horizon in northern Zimbabwe. Communities practiced mixed farming, kept livestock, and smelted iron in small furnaces. Dry-stone enclosures at the Ziwa archaeological site show nucleated settlement and controlled stock movement. Field systems and garden plots indicate soil management in granite and schist landscapes. Pottery forms and metal tools connect the culture to broader Limpopo and Zambezi networks. Radiocarbon dates place occupations between the first millennium CE and the early second. Exchange moved beads, iron, and foodstuffs, while local quarries supplied building stone. Ziwa traditions foreshadow later stoneworking seen at Zimbabwe Plateau centers. The culture marks a shift from foraging dominance to settled agrarian lifeways in the region."
    },
    {
        "name": "Zimbabwe",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Congo"
            }
        ],
        "upgradesFrom": [
            "Ziwa"
        ],
        "city": "Harare",
        "traits": [
            "Scientific",
            "Diplomatic"
        ],
        "category": "Minor",
        "description": "Zimbabwe refers to the medieval Shona polity centered on the Great Zimbabwe complex, active c. 12th–15th centuries. Elite compounds on the Hill Complex and the monumental Great Enclosure used finely coursed dry stone without mortar. Wealth derived from cattle, control of goldfields, and caravan routes to Sofala on the Mozambique coast. Through Swahili intermediaries, bullion and ivory moved into the Indian Ocean trade. Imported glass beads and ceramics occur in higher status contexts. Political authority rested with Shona ruling lineages who used ritual and labor mobilization for construction and defense. By the late 15th century ecological strain, shifting trade nodes, and internal dynamics contributed to decline. Successor states, including Mutapa and Torwa, absorbed people and practices from the core."
    },
    {
        "name": "Swahili",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Ethiopia"
            }
        ],
        "city": "Kilwa",
        "traits": [
            "Commercial",
            "Religious"
        ],
        "category": "Minor",
        "description": "The Swahili were coastal communities and city-states along East Africa from southern Somalia to northern Mozambique. From the 11th century they developed stone towns, Islam, and literacy in Arabic script for chancery and commerce. Kilwa Kisiwani became a dominant node, minting coins and managing the Sofala gold trade from the Zimbabwe Plateau. Dhows used monsoon winds to link harbors with Arabia, Persia, and India. Coral-rag mosques, houses, and tombs attest to urban wealth. Swahili language formed a lingua franca that spread inland with caravan trade in ivory, gold, and later slaves. Portuguese interventions in the 16th century disrupted networks but did not end coastal society. Omani influence grew in the 18th century, shifting power toward Zanzibar."
    },
    {
        "name": "Kenya",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Ethiopia"
            }
        ],
        "upgradesFrom": [
            "Swahili"
        ],
        "city": "Nairobi",
        "traits": [
            "Militaristic",
            "Scientific"
        ],
        "category": "Minor",
        "description": "Kenya is an East African republic whose modern formation accelerated under British rule. The Uganda Railway, built in the 1890s–1901, fixed the site of Nairobi and opened the highlands to settler agriculture. Colonial land alienation and labor controls produced resistance. The Mau Mau uprising of 1952–60 marked a major insurgency in Central Province. Negotiations and reforms led to independence in 1963 under Jomo Kenyatta and the Kenya African National Union. A unitary framework and security legislation shaped early governance. Later decades saw economic diversification, urban growth, and episodic political contention, including the restoration of multiparty competition in the 1990s. Kenya occupies an Indian Ocean frontage with Rift Valley highlands and pastoral rangelands. The capital is Nairobi."
    },
    {
        "name": "Saba",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Ethiopia"
            }
        ],
        "city": "Ma’rib",
        "traits": [
            "Cultural",
            "Agricultural"
        ],
        "category": "Minor",
        "description": "Saba was an ancient South Arabian kingdom centered on Ma’rib. Prosperity rested on control of frankincense and myrrh routes that connected Arabia to the Levant and Mediterranean. The Ma’rib Dam and its canals supported irrigated agriculture and urban stability. Old South Arabian inscriptions record kings, priesthoods, and dedications at temples such as Awam. Monumental walls and gates secured caravan depots. Contacts with Aksum, Nabataea, and Hellenistic polities are visible in imported goods and titulature. By the late first millennium BCE rival kingdoms rose in Yemen, and political hegemony shifted. Himyarite rulers eventually incorporated Sabaean lands. Biblical traditions about the Queen of Sheba preserve a distant memory of the kingdom’s fame."
    },
    {
        "name": "Yemen",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Ethiopia"
            }
        ],
        "upgradesFrom": [
            "Saba"
        ],
        "city": "Sana’a",
        "traits": [
            "Industrious",
            "Militaristic"
        ],
        "category": "Minor",
        "description": "Yemen in the 20th century experienced imperial withdrawal, monarchic rule, republican revolution, and socialist governance. After the Ottoman exit in 1918, the Mutawakkilite Kingdom consolidated authority over North Yemen. A 1962 coup established the Yemen Arab Republic after a civil war that drew Egyptian and Saudi intervention. In the south, British control at Aden ended in 1967, producing the People’s Democratic Republic of Yemen with a Marxist orientation. The two states pursued rival alliances yet shared cultural ties. Negotiations culminated in unification in 1990 with Sana’a as capital and Aden as an economic center. A brief civil war in 1994 confirmed central control. Oil exports, migration, and remittances shaped late-century development."
    },
    {
        "name": "Guanche",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Morocco"
            }
        ],
        "city": "Tenerife",
        "traits": [
            "Scientific",
            "Commercial"
        ],
        "category": "Minor",
        "description": "The Guanche were the indigenous inhabitants of the Canary Islands before Spanish conquest. Linguistic and genetic evidence points to Berber origins with settlement in the first millennium BCE or early CE. Communities lived in caves and stone structures, herding goats and limited crops. Material culture included distinctive pottery, leatherwork, and mummification of selected dead. Island polities were independent, with notable concentrations on Tenerife and Gran Canaria. Europeans arrived in the 14th and 15th centuries seeking slaves, orchil dye, and bases for Atlantic sailing. Prolonged warfare and alliances ended with Castilian control in 1496. Disease, enslavement, and intermarriage reshaped populations. Cultural survivals remain in toponyms, vocabulary, and ritual fragments recorded by early chroniclers."
    },
    {
        "name": "Canarian",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Morocco"
            }
        ],
        "upgradesFrom": [
            "Guanche"
        ],
        "city": "Las Palmas",
        "traits": [
            "Religious",
            "Industrious"
        ],
        "category": "Minor",
        "description": "The Canarian archipelago entered the Spanish Crown during late medieval and early modern expansion. Final conquest of Tenerife in 1496 secured the islands as a strategic Atlantic platform. Ports such as Las Palmas and Santa Cruz served as resupply points for Columbus and later Iberian fleets bound for the Americas and Africa. Sugar plantations drove 16th-century exports using enslaved and migrant labor. Vineyards later produced Malvasia wines for Atlantic markets. From the 18th to 19th centuries cochineal dye became a major commodity until synthetic anilines displaced it. Naval stations and fortifications repelled corsairs and rival powers. The islands linked imperial shipping routes, migration streams, and commodity chains across the Atlantic world."
    },
    {
        "name": "Bafour",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Morocco"
            }
        ],
        "city": "Tichitt",
        "traits": [
            "Militaristic",
            "Commercial"
        ],
        "category": "Minor",
        "description": "The Bafour were early Saharan pastoralists linked to proto-Berber populations in present-day Mauritania. During the classical era they moved seasonally between oases and pastures on the Adrar and Tagant plateaus. Herding of cattle, sheep, and goats supported small mobile communities. Rock art in central Mauritania records domestic stock and hunting scenes. Tumuli and stone cairns indicate formal burial customs and territorial memory. The group participated in regional exchange across the western Sahara. Their speech and material culture contributed to the diffusion of early Berber traits along the desert edge. Increasing aridity drove adjustments in routes and settlement around reliable water points. Later Sanhaja and Zenaga groups inherited parts of this pastoral economy. Archaeological traces remain in cairn fields, grinding stones, and paths linking wells and caravan stops."
    },
    {
        "name": "Mauritania",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Morocco"
            }
        ],
        "upgradesFrom": [
            "Bafour"
        ],
        "city": "Nouakchott",
        "traits": [
            "Agricultural",
            "Cultural"
        ],
        "category": "Minor",
        "description": "Mauritania occupies the Atlantic margin of the western Sahara between the Senegal River and the Adrar highlands. France organized the territory within French West Africa after 1903, building posts along caravan routes and the river. Nouakchott was planned and founded in the late 1950s to replace Saint-Louis as the seat of government. Independence came in 1960 under President Moktar Ould Daddah. The state pursued nation-building across Arab-Berber, Haratine, and southern communities. Iron ore mining at Zouérat and the railway to Nouadhibou shaped the economy. Severe Sahel droughts in the 1970s drove urbanization. Mauritania entered the Western Sahara conflict in 1975 and withdrew in 1979 after internal strain. Coups altered leadership in 1978 and later years. The country adopted a new constitution in 1991 and expanded electoral institutions while managing issues of slavery’s legacy and desertification."
    },
    {
        "name": "Tubu",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Nigeria"
            }
        ],
        "city": "Tibesti",
        "traits": [
            "Diplomatic",
            "Scientific"
        ],
        "category": "Minor",
        "description": "The Tubu are a Saharan people centered on the Tibesti and Borkou regions, with Teda and Daza branches. They specialized in camel pastoralism and caravan work across oases and salt pans. Guides from Tibesti directed traffic between Fezzan, Borkou, and Lake Chad markets. Clan-based governance organized access to water, pastures, and passes. Defensive settlements and refuges in volcanic massifs protected herds and families during raids. Tubu traders carried salt, dates, and livestock along long-distance routes. Contacts linked them to Kanem-Bornu, Tripoli, and Fezzan. Colonial incursions by Ottoman, Italian, and French forces met skilled resistance from mobile fighters who knew the desert well. Despite borders imposed in the twentieth century, kin and trade networks continued to span Libya, Chad, and Niger. Oral histories and place-names document control of oases and caravan trails."
    },
    {
        "name": "Chad",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Nigeria"
            }
        ],
        "upgradesFrom": [
            "Tubu"
        ],
        "city": "N’Djamena",
        "traits": [
            "Commercial",
            "Industrious"
        ],
        "category": "Minor",
        "description": "Chad formed within French Equatorial Africa after 1900, with Fort-Lamy (now N’Djamena) as the administrative center on the Chari River. Colonial policy fostered cotton production and linked the south to river and rail systems. Independence was achieved in 1960 under President François Tombalbaye. National politics reflected deep regional and religious divides between the south, center, and north. Armed conflict began in the late 1960s and intensified into the 1979–1982 civil war. Hissène Habré took power in 1982, and fighting with Libya over the Aouzou Strip continued until 1987. Idriss Déby seized the presidency in 1990. Lake Chad remained a key ecological and economic zone for fishing and irrigation despite declining waters. The capital grew rapidly as drought and insecurity displaced rural populations. Administrative reforms reshaped prefectures into regions late in the century."
    },
    {
        "name": "Takrur",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Nigeria"
            }
        ],
        "city": "Tekrur",
        "traits": [
            "Cultural",
            "Militaristic"
        ],
        "category": "Minor",
        "description": "Takrur was a medieval kingdom on the lower Senegal River, centered in Futa Toro. It emerged by the 9th–10th centuries through riverine agriculture and trans-Saharan exchange. Rulers adopted Islam early and forged ties with Berber scholars and Almoravid leaders. The state prospered from gold and slave trades that linked the Senegal valley to the western Sahara and Maghrib. Takrur’s position brought rivalry with the Ghana Empire and neighboring river polities. Islamic law and taxation shaped court practice and commercial regulation. By the 12th–13th centuries regional power shifted as Almoravid influence waned and new states rose along the coast and interior. The name “Takrur” spread in Arabic sources as a general term for western Sudanic peoples who traveled for trade and pilgrimage. Archaeology notes fortified tells, ironworking, and irrigated floodplain fields."
    },
    {
        "name": "Senegal",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            },
            {
                "type": "region",
                "name": "Nigeria"
            }
        ],
        "upgradesFrom": [
            "Takrur"
        ],
        "city": "Dakar",
        "traits": [
            "Diplomatic",
            "Religious"
        ],
        "category": "Minor",
        "description": "Senegal became a central node of French West Africa, with Dakar designated capital of the federation in the early 20th century. The city developed deep-water docks, rail links, and administrative schools. Blaise Diagne’s 1914 election to the French Parliament marked new legal status for the Four Communes. Groundnut cultivation tied the hinterland to the Dakar–Niger Railway and European markets. After World War II, parties and Sufi brotherhoods shaped mass politics. The Mali Federation formed in 1959 but dissolved in 1960. Senegal declared independence that year with Léopold Sédar Senghor as president and Mamadou Dia as head of government. A presidential system consolidated by 1962 guided a gradualist economic strategy. Education, port services, and administration anchored urban growth. From the late 1980s a low-intensity conflict affected Casamance, while democratic alternation advanced in 2000."
    },
    {
        "name": "Lakota",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "Canada"
            }
        ],
        "city": "Black Hills",
        "traits": [
            "Cultural",
            "Militaristic"
        ],
        "category": "Minor",
        "description": "The Lakota are a Siouan-speaking people who expanded onto the Northern Plains during the 18th century. Adoption of the horse transformed mobility, hunting, and warfare. Firearms acquired through French and later British trade altered tactics and diplomacy. Bands moved west from the upper Mississippi into the Missouri watershed and then toward the Black Hills. Buffalo hunting organized seasonal rounds and intertribal relations. Winter counts recorded key events, migrations, and alliances. The Lakota formed divisions such as Oglala, Hunkpapa, and Miniconjou, each with notable leaders. They negotiated with traders and forts while defending access to grazing and river corridors. Epidemics and shifting trade patterns pressured communities but did not halt consolidation. By the early 19th century the Lakota were a major power on the plains, interacting with U.S. expeditions and claiming Paha Sapa as sacred homeland."
    },
    {
        "name": "Sioux",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "Canada"
            }
        ],
        "upgradesFrom": [
            "Lakota"
        ],
        "city": "Sioux Falls",
        "traits": [
            "Diplomatic",
            "Industrious"
        ],
        "category": "Minor",
        "description": "The Sioux confederation comprises Dakota, Lakota, and Nakota divisions across the Northern Plains. During the 19th century they faced U.S. expansion, treaty making, and military campaigns. The Fort Laramie Treaty of 1868 recognized a large Lakota reservation and hunting rights beyond it. Discovery of gold in the Black Hills led to violations and renewed war. The Great Sioux War of 1876–1877 included the Battle of the Little Bighorn, where allied Lakota, Northern Cheyenne, and Arapaho defeated the 7th Cavalry. Subsequent campaigns, surrenders, and reservation confinement followed. Allotment policies fragmented landholding and undermined bison-based livelihoods. The Ghost Dance movement spread amid hunger and repression. The Wounded Knee massacre in 1890 ended large-scale armed resistance. Oral tradition, winter counts, and treaty records document this era of dispossession and resilience."
    },
    {
        "name": "Inuit",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "Canada"
            }
        ],
        "city": "Thule",
        "traits": [
            "Agricultural",
            "Scientific"
        ],
        "category": "Minor",
        "description": "The Inuit descend from the Thule culture, which spread across the North American Arctic around 1000 CE. They adapted to sea-ice ecologies with advanced hunting and navigation. Kayaks and umiaks enabled pursuit of seals, walrus, and whales. Dog traction supported winter travel and trade between coastal and inland camps. Snowhouses and sod dwellings provided shelter in seasonal rounds. Stone lamps, harpoon heads, and toggling gear show high specialization. Inuit communities interacted with Norse Greenlanders and later with European whalers and traders. Oral maps and celestial knowledge guided movement across pack ice and polynyas. Regional dialects and art styles diversified from Alaska to Greenland. Despite colonial pressures and epidemics, core skills of hunting, sewing, and toolmaking persisted, anchoring cultural continuity across the circumpolar zone."
    },
    {
        "name": "Nunavut",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "Canada"
            }
        ],
        "upgradesFrom": [
            "Inuit"
        ],
        "city": "Iqaluit",
        "traits": [
            "Commercial",
            "Diplomatic"
        ],
        "category": "Minor",
        "description": "Nunavut is a Canadian Arctic territory established in 1999 after the 1993 Nunavut Land Claims Agreement. It created a public government serving a majority Inuit population with Inuktitut and Inuinnaqtun as official languages alongside English and French. Iqaluit on Baffin Island became the capital. The territory adopted a consensus-style legislature and co-management of wildlife and land use. Communities maintained subsistence hunting while engaging in wage labor, public service, and mining. Projects at Meadowbank and Mary River illustrated new resource frontiers. Archaeology, language programs, and art cooperatives supported cultural renewal. Education and housing policies addressed the constraints of remote settlement and high costs. Climate change affected sea ice regimes and travel safety, prompting adaptation in search, rescue, and community planning across the archipelago."
    },
    {
        "name": "Redware",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "Cuba"
            }
        ],
        "city": "Baní",
        "traits": [
            "Militaristic",
            "Religious"
        ],
        "category": "Minor",
        "description": "Redware in the pre-Columbian Caribbean denotes red-slipped pottery widely produced during the Late Ceramic Age. Artisans prepared fine clays with mineral temper, applied iron-rich slips, and achieved burnished surfaces through controlled open firing. Forms included bowls, bottles, and ritual vessels. Ostionoid assemblages in Puerto Rico, Hispaniola, and Jamaica carried this tradition into the centuries before European contact. Excavations near Baní in Hispaniola have yielded diagnostic rims and bowls used in cooking and ceremony. Distribution across islands points to canoe-borne exchange networks that moved finished wares and ideas. Redware served domestic needs and conveyed social signaling through shape, finish, and context. It anchors ceramic chronologies and links Antillean communities that shared technology while adapting local styles."
    },
    {
        "name": "Jamaica",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "Cuba"
            }
        ],
        "upgradesFrom": [
            "Redware"
        ],
        "city": "Kingston",
        "traits": [
            "Commercial",
            "Industrious"
        ],
        "category": "Minor",
        "description": "Jamaica entered the twentieth century as a British colony centered on Kingston and sugar estates. Urban growth accelerated after the 1907 earthquake and with port and road expansion. Bauxite and alumina industries rose in the 1950s, tying the island to North American aluminum demand. Electoral politics consolidated under the JLP and PNP. Independence came in 1962 within the Commonwealth. Reggae and ska moved from Kingston studios to global markets in the 1960s and 1970s, carrying new cultural influence. The 1970s saw ambitious social programs, polarization, and fiscal strain. The 1980s and 1990s brought IMF agreements, privatization, and tourism growth. Migration forged a large diaspora while remittances and services diversified the economy."
    },
    {
        "name": "Lucaya",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "Cuba"
            }
        ],
        "city": "Guanahani",
        "traits": [
            "Diplomatic",
            "Agricultural"
        ],
        "category": "Minor",
        "description": "The Lucayans were Taíno-related peoples inhabiting the Bahamian archipelago by the first millennium CE. Settlements clustered near fresh water on low islands and cays. Subsistence combined reef fishing, turtle and conch harvests, and small garden plots. Fishing weirs and canoe navigation supported seasonal mobility and inter-island ties. Shell ornaments and worked bone objects mark craft specialization and exchange. Villages on Guanahani and neighboring islands lay on routes to Hispaniola and Cuba. In 1492 Christopher Columbus made first contact in the Bahamas, initiating rapid disruption. Enslavement raids and forced relocations to Hispaniola emptied the islands within a few decades. Archaeology preserves village plans, burials, and tools that link Lucayan lifeways to wider Taíno traditions while reflecting the constraints of a limestone archipelago."
    },
    {
        "name": "Bahamas",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "Cuba"
            }
        ],
        "upgradesFrom": [
            "Lucaya"
        ],
        "city": "Nassau",
        "traits": [
            "Cultural",
            "Scientific"
        ],
        "category": "Minor",
        "description": "The Bahamas transitioned from a British colony reliant on shipping and sponge gathering to a service economy built on tourism and finance. Air travel after 1945 brought resort development concentrated around Nassau and Paradise Island. Majority rule in 1967 ended the Old Guard oligarchy. Independence in 1973 created a sovereign state within the Commonwealth. Offshore banking expanded under permissive incorporation and tax regimes, drawing international capital and scrutiny. The government developed ports, airports, and hotels to capture cruise and long-stay visitors. The 1980s saw drug-trafficking pressures and regulatory responses. Through hurricanes and market shocks, tourism, financial services, and construction remained central. Archipelagic geography shaped governance, infrastructure, and migration across widely scattered islands."
    },
    {
        "name": "Nahua",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "Mexico"
            }
        ],
        "city": "Cholula",
        "traits": [
            "Religious",
            "Industrious"
        ],
        "category": "Minor",
        "description": "Nahua peoples of central Mexico spoke Nahuatl and organized into altepetl city-states during the Postclassic era. They codified ritual and law in painted codices and maintained a 260-day ritual and 365-day solar calendar. Intensive agriculture sustained dense populations, with chinampa fields near lake basins as an innovation of the Basin of Mexico. Pochteca merchants carried luxury goods and intelligence across Mesoamerica. Cholula stood as a major cult and market center. In the fifteenth century the Mexica-led Triple Alliance built a tributary empire that integrated many Nahua polities. Spanish conquest in 1519–1521 reshaped institutions but Nahuatl persisted as a lingua franca in colonial administration and literature. Annals, land titles, and catechisms preserve Nahua perspectives and continuity."
    },
    {
        "name": "Nicaragua",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "Mexico"
            }
        ],
        "upgradesFrom": [
            "Nahua"
        ],
        "city": "Managua",
        "traits": [
            "Commercial",
            "Militaristic"
        ],
        "category": "Minor",
        "description": "Nicaragua emerged from the collapse of the Central American Federation amid rivalry between Granada and León. The San Juan River and Lake Nicaragua corridor drew canal schemes and foreign adventurers. In 1855–1857 William Walker’s filibuster destabilized the country and invited regional intervention. Coffee cultivation expanded after mid-century, linking highland estates to Pacific ports. Liberal consolidation under José Santos Zelaya (1893–1909) modernized administration, secularized institutions, and pursued canal diplomacy. Railroads and telegraph lines integrated the Pacific lowlands while indigenous and communal lands faced privatization. U.S. commercial and strategic interests grew through transit concessions. Although occupation followed in the early twentieth century, nineteenth-century state formation fixed Nicaragua’s export orientation and its contested political geography."
    },
    {
        "name": "Chorotega",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "Mexico"
            }
        ],
        "city": "Nicoya",
        "traits": [
            "Agricultural",
            "Religious"
        ],
        "category": "Minor",
        "description": "The Chorotega were Oto-Manguean–speaking peoples established across the Nicoya Peninsula and adjacent Pacific regions by the Late Postclassic. They organized into chiefdoms with hilltop settlements, wooden palisades, and ballcourts that linked them to wider Mesoamerican practice. Agriculture centered on maize, beans, and squash, with cacao and cotton as valuables. Polychrome pottery featured fine slips and painted motifs, circulating through coastal trade. Exchange connected Nicoya to central Mexico and lower Central America. Spanish incursions after the 1520s imposed tribute, congregated communities, and redirected labor to encomiendas and missions. Population decline followed disease and displacement, yet ceramic styles and settlement patterns document a durable regional culture at the crossroads of Mesoamerican and Isthmo-Colombian spheres."
    },
    {
        "name": "Guatemala",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "Mexico"
            }
        ],
        "upgradesFrom": [
            "Chorotega"
        ],
        "city": "Guatemala City",
        "traits": [
            "Cultural",
            "Industrious"
        ],
        "category": "Minor",
        "description": "Nineteenth-century Guatemala consolidated a coffee-based export economy under Liberal leadership. The 1871 Liberal Reform under Justo Rufino Barrios dismantled corporate lands, weakened the Church, and promoted private property. Coffee planters gained labor through debt peonage and new vagrancy laws, drawing heavily on Maya communities. Railroads and port works linked the highlands to the Pacific and Atlantic, and Guatemala City grew as an administrative and commercial hub. Foreign capital, including German interests in Alta Verapaz, financed estates and infrastructure. State-building produced a professional army and centralized taxation while widening rural inequality. By 1900 the fiscal health of the state depended on coffee prices, setting the conditions for later political volatility tied to export cycles and land concentration."
    },
    {
        "name": "Cherokee",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "USA"
            }
        ],
        "city": "Etowah",
        "traits": [
            "Scientific",
            "Diplomatic"
        ],
        "category": "Minor",
        "description": "In the nineteenth century the Cherokee Nation rebuilt governance to meet U.S. expansion. Sequoyah created the syllabary in 1821, enabling rapid literacy and the Cherokee Phoenix newspaper by 1828. A constitutional government at New Echota adopted bicameral institutions and codified law. Gold discoveries and Georgia’s actions intensified pressure after the Indian Removal Act of 1830. Worcester v. Georgia affirmed sovereignty in principle, yet federal policy enforced cession. The 1835 Treaty of New Echota led to removal in 1838–1839 along the Trail of Tears to Indian Territory, with heavy mortality. In the West, the Nation reconstituted courts, schools, and a new capital at Tahlequah. Treaty divisions and the Civil War fractured politics, but institutional resilience and print culture endured."
    },
    {
        "name": "Muskogee",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "USA"
            }
        ],
        "upgradesFrom": [
            "Cherokee"
        ],
        "city": "Tulsa",
        "traits": [
            "Commercial",
            "Agricultural"
        ],
        "category": "Minor",
        "description": "The Muscogee (Creek) Nation navigated the twentieth century through legal restoration and economic renewal. Allotment and Oklahoma statehood had curtailed governance, yet federal policy shifts enabled reorganization. A modern constitution and elected leadership reemerged by the 1970s, building on earlier frameworks under the Oklahoma Indian Welfare Act. The Nation developed health, housing, and education systems and expanded jurisdiction in partnership with federal courts. Enterprises diversified into gaming, tourism, manufacturing, and service contracts, with revenues funding cultural programs. Strong ties to the Tulsa region reflected historic Creek settlement and town sites. Language revitalization advanced through immersion classes, media, and community teaching. Archival work and preservation protected ceremonial grounds and historical records alongside contemporary governance."
    },
    {
        "name": "Sahaptin",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "USA"
            }
        ],
        "city": "Celilo",
        "traits": [
            "Cultural",
            "Religious"
        ],
        "category": "Minor",
        "description": "Sahaptin refers to Plateau communities using Sahaptin and related Sahaptian languages along the middle Columbia and its tributaries before large-scale colonial disruption. Villages occupied winter pit houses and moved seasonally to root grounds, berry slopes, and upland hunting areas. Celilo Falls and The Dalles served as major fisheries and trade fairs. Dip-netting platforms, drying racks, and cache pits supported salmon preservation and exchange. Camas, wapato, and biscuitroot were key plant foods. Social life centered on village headmen and ritual specialists, with regional alliances maintained through feasts and marriage. A dialect continuum linked Yakama, Umatilla, and Walla Walla communities. Salmon ceremonies ordered harvest rules and affirmed reciprocal obligations. Obsidian, shells, and finished baskets moved through long-distance networks that reached the Coast and Great Basin. Horses entered the region before reservations and shifted mobility and warfare. The economy and settlement pattern remained river-focused until mid-nineteenth-century removals."
    },
    {
        "name": "Umatilla",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            },
            {
                "type": "region",
                "name": "USA"
            }
        ],
        "upgradesFrom": [
            "Sahaptin"
        ],
        "city": "Seattle",
        "traits": [
            "Scientific",
            "Militaristic"
        ],
        "category": "Minor",
        "description": "The Confederated Tribes of the Umatilla Indian Reservation—Cayuse, Umatilla, and Walla Walla—entered the twentieth century under allotment and curtailed authority. A 1949 constitution reorganized government and asserted treaty-reserved rights from the 1855 agreements. The tribes pursued fisheries co-management on the Columbia and Umatilla rivers, building hatcheries, lamprey projects, and habitat restoration in partnership with regional agencies. Litigation and compacts sustained off-reservation fishing, hunting, and gathering. Economic development expanded after the 1990s with the Wildhorse Resort & Casino, energy ventures, and land reacquisition. The Tamástslikt Cultural Institute opened in 1998 as a museum and archive of Plateau history. Language programs advanced Umatilla Sahaptin revitalization. Health, education, and housing services grew under federal self-determination policies. The nation strengthened ties to nearby cities such as Pendleton while retaining ceremonial life, longhouse religion, and seasonal food practices. By century’s end it had rebuilt governance capacity and regional influence."
    },
    {
        "name": "Tupi",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Brazil"
            }
        ],
        "city": "Tupinambá",
        "traits": [
            "Agricultural",
            "Militaristic"
        ],
        "category": "Minor",
        "description": "The Tupi along Brazil’s Atlantic coast comprised diverse communities prior to Portuguese arrival. Settlements occupied river mouths, barrier islands, and coastal plains from Maranhão to São Vicente. Horticulture centered on bitter manioc, complemented by maize, beans, fishing, and shellfish collecting. Large canoes enabled trade and raiding across long shorelines and estuaries. Houses of palm and timber formed clustered hamlets or elongated longhouses. Kin groups organized labor, warfare, and ritual, with speakers across a Tupi-Guarani continuum. Intertribal exchange moved feathers, salt, stone, and crafted goods. Warfare followed cyclical patterns that included captive-taking and public ceremonies in some groups, notably among the Tupinambá. Shamans mediated illness and social conflict. Material culture featured fiber hammocks, cordage, and featherwork. Oral histories and place names later documented toponyms and ethnonyms that shaped colonial records. Early sixteenth-century encounters built on these earlier networks rather than creating them."
    },
    {
        "name": "Amazonia",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Brazil"
            }
        ],
        "upgradesFrom": [
            "Tupi"
        ],
        "city": "Manaus",
        "traits": [
            "Industrious",
            "Scientific"
        ],
        "category": "Minor",
        "description": "During the rubber boom, the Brazilian Amazon underwent rapid integration into global markets. Seringueiros tapped Hevea brasiliensis along tributaries and shipped latex to Belém and Manaus. Urban elites invested in docks, electric lighting, and public buildings such as the Teatro Amazonas. Steam riverboats expanded transport and policing along major rivers. Labor migrants from Brazil’s Northeast entered debt peonage under aviamento credit chains. Disease, violence, and land seizures devastated many Indigenous communities. Telegraph expeditions, including Rondon’s commission, pushed lines toward Acre and the Rio Madeira to link frontier posts with the coast. The boom collapsed after Asian plantation rubber undercut prices after 1912, leaving indebted workers and underused infrastructure. A smaller second surge came during World War II but did not restore earlier levels. The period left a legacy of polarized landholding, fragile towns, and a durable expectation of extractive wealth that framed later development schemes."
    },
    {
        "name": "Wai-wai",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Brazil"
            }
        ],
        "city": "Paru",
        "traits": [
            "Diplomatic",
            "Religious"
        ],
        "category": "Minor",
        "description": "Wai-wai communities of the Guiana Shield maintained dispersed settlements along forested rivers during the era of first sustained outside contact. They spoke a Cariban language and built large thatched longhouses grouped near swidden fields. Subsistence relied on cassava processing with grating, pressing, and roasting to produce farinha and bread. Canoe travel, inter-village visits, and ritual exchanges maintained diplomacy across wide distances. Trade linked Wai-wai to Akawaio, Wapishana, and Makushi neighbors. Dutch and Portuguese expeditions, followed by missionaries, reached some groups in the late eighteenth and early nineteenth centuries. These encounters brought tools and cloth as well as epidemics. Communities often relocated to manage social tensions and resource needs. Leadership emphasized consensus and ritual knowledge. The period set enduring patterns of alliance-making and cautious engagement with outsiders while preserving core practices in house-building, agriculture, and names for rivers and trails."
    },
    {
        "name": "Guyana",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Brazil"
            }
        ],
        "upgradesFrom": [
            "Wai-wai"
        ],
        "city": "Georgetown",
        "traits": [
            "Commercial",
            "Diplomatic"
        ],
        "category": "Minor",
        "description": "Guyana achieved independence from Britain in 1966 and declared a Co‑operative Republic in 1970. Georgetown served as administrative and commercial hub. Bauxite mining at Linden and coastal sugar estates anchored the economy. Under Forbes Burnham, the state pursued cooperative socialism, nationalized major industries, and aligned with the Non‑Aligned Movement. Shortages, migration, and political polarization marked the late 1970s and 1980s. Ethnic competition between Afro‑Guyanese and Indo‑Guyanese parties shaped electoral politics and labor movements. Democratic reforms in 1992 brought competitive elections and macroeconomic stabilization under international programs. Remittances, rice, gold, and later offshore prospects diversified income beyond bauxite. The state engaged in border diplomacy while managing a sparsely populated interior and fragile coastal defenses. Cultural policy promoted Creole and Indo‑Caribbean heritage within a multilingual society. By century’s end, Guyana had moved from colonial plantation structures toward a resource‑dependent but more plural political order."
    },
    {
        "name": "Chono",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Chile"
            }
        ],
        "city": "Chiloé",
        "traits": [
            "Agricultural",
            "Scientific"
        ],
        "category": "Minor",
        "description": "The Chono were canoe-borne hunter-gatherers of the Chiloé archipelago and adjacent Patagonian channels during the early contact era. They navigated intricate kelp-lined routes in dugout and plank-built craft, traveling between fishing grounds, shellfish beds, and sea mammal rookeries. Seasonal camps used bark shelters and hearths; gear included harpoons, nets, and fish weirs. Spanish voyages from Chiloé encountered Chono groups in the sixteenth and seventeenth centuries and drew on their geographic knowledge. Jesuit efforts to gather families into missions produced relocations and cultural change. Some Chono joined Chilote communities, while others withdrew farther south into less accessible channels. The dalca canoe became a regional tool for transport and trade. Place names and archaeological middens trace their maritime lifeways across islets and fjords. By the eighteenth century, assimilation and disease had reduced distinct Chono polities, yet nautical skills and routes persisted within mixed coastal populations."
    },
    {
        "name": "Argentina",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Chile"
            }
        ],
        "upgradesFrom": [
            "Chono"
        ],
        "city": "Buenos Aires",
        "traits": [
            "Cultural",
            "Industrious"
        ],
        "category": "Minor",
        "description": "Nineteenth-century Argentina consolidated a national state and export economy across the River Plate region. After civil conflicts, the 1853 constitution framed federal institutions. British-financed railways linked interior towns to Buenos Aires and Rosario. Port works and frigoríficos enabled chilled beef and mutton exports to Europe. Estancias on the pampas expanded cattle and sheep herds, using wire fencing and improved breeds. Immigration from Italy and Spain fueled urban growth and labor markets. Public education and census-taking advanced administrative reach. The Conquest of the Desert extended state control over Patagonian and Pampas territories with force and colonization. An oligarchic order dominated politics until the Sáenz Peña electoral reform of 1912 broadened suffrage. By 1914, Argentina ranked among the world’s leading grain and meat exporters. Rail networks, land tenure patterns, and a primate Buenos Aires defined modernization and regional hierarchies."
    },
    {
        "name": "Rapa Nui (Ancient)",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Chile"
            }
        ],
        "city": "Rapa Nui",
        "traits": [
            "Cultural",
            "Religious"
        ],
        "category": "Minor",
        "description": "Ancient Rapa Nui society developed a distinctive monumental tradition before sustained external contact. Settlers established clan territories around the island and built ahu platforms facing inland. From the quarry at Rano Raraku they carved moai statues and moved them along prepared routes. Pukao topknots came from the red tuff of Puna Pau. Ritual and authority centered on ancestor veneration tied to these installations. Agricultural systems used stone mulch, windbreaks, and walled garden enclosures to protect crops in a thin-soil environment. House forms included hare paenga boat-shaped structures near ceremonial centers. Basalt tools and workshops attest to intensive lithic production. The landscape of roads, quarries, and shrines shows coordinated labor and technical planning. Environmental and social changes occurred over time, but the island maintained complex ceremonial activity until the era of outside incursions in the eighteenth century."
    },
    {
        "name": "Rapa Nui (Modern)",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Chile"
            }
        ],
        "upgradesFrom": [
            "Rapa Nui (Ancient)"
        ],
        "city": "Rapa Nui",
        "traits": [
            "Cultural",
            "Diplomatic"
        ],
        "category": "Minor",
        "description": "In the twentieth century Rapa Nui life unfolded under Chilean administration and islander revitalization. Chile annexed the island in 1888 and leased most land to a sheep company that confined residents to Hanga Roa. Naval rule and a pass system restricted movement until reforms in mid-century. The 1966 Ley Pascua granted full Chilean citizenship and created local governance mechanisms. Regular air service from the mainland began soon after, opening tourism. Rapa Nui National Park and the island’s inscription as a UNESCO World Heritage Site in 1995 provided conservation frameworks and revenue. Islanders advanced land claims, language education, and cultural performance as public policy. Archaeology, museum partnerships, and heritage laws shaped site management. Hanga Roa expanded with schools, clinics, and small businesses. By century’s end, tourism, heritage administration, and communal land debates structured a new economy alongside enduring kin networks and ritual practice."
    },
    {
        "name": "Chibcha",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Colombia"
            }
        ],
        "city": "Bacatá",
        "traits": [
            "Commercial",
            "Religious"
        ],
        "category": "Minor",
        "description": "The Chibcha, more precisely the Muisca of the Colombian highlands, formed dense chiefdoms across the Altiplano Cundiboyacense before Spanish conquest. Power centered in Bacatá and Tunja, where rulers coordinated tribute, markets, and warfare. Their economy combined highland agriculture, extensive salt extraction at Zipaquirá and Nemocón, and long-distance exchange for emeralds, cotton, and coca. Artisans worked tumbaga alloys into elaborate votives, the famed Muisca raft evoking investiture rites at lakes such as Guatavita. A lunisolar calendar guided farming and ritual. Settlement patterns featured dispersed farmsteads and ceremonial nodes linked by paths. Spanish forces under Gonzalo Jiménez de Quesada entered in 1537, reshaping tribute systems and sacred landscapes. Despite demographic collapse, Muisca technologies in saltmaking, metallurgy, and terrace cultivation showed enduring regional influence. The Chibcha language contributed to toponyms and colonial-era documents that preserve aspects of political structure and cosmology."
    },
    {
        "name": "Venezuela",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Colombia"
            }
        ],
        "upgradesFrom": [
            "Chibcha"
        ],
        "city": "Caracas",
        "traits": [
            "Industrious",
            "Militaristic"
        ],
        "category": "Minor",
        "description": "Twentieth-century Venezuela shifted from agrarian society to oil-driven state. A 1920s boom around Lake Maracaibo reordered labor, cities, and public finance. The 1958 Punto Fijo Pact stabilized party competition after the fall of dictatorship. Venezuela helped found OPEC in 1960 through the efforts of Juan Pablo Pérez Alfonso. Nationalization in 1976 created PDVSA, channeling rents to infrastructure, education, and patronage. Urbanization accelerated in Caracas and Maracaibo, while rural regions faced unequal development. Leftist insurgencies in the 1960s faded as electoral politics consolidated. Price shocks in the 1980s produced debt stress and the 1989 Caracazo. Hugo Chávez won in 1998, initiating the Bolivarian Revolution and a new constitution in 1999. Oil dependence remained central, shaping migration, welfare programs, and recurring fiscal cycles."
    },
    {
        "name": "Cueva",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Colombia"
            }
        ],
        "city": "Darién",
        "traits": [
            "Agricultural",
            "Commercial"
        ],
        "category": "Minor",
        "description": "The Cueva were pre-Columbian peoples of the Darién and adjacent river basins who cultivated maize and manioc, lived in dispersed villages, and integrated local fisheries with forest resources. They maintained trade with Chibchan-speaking neighbors, distributing gold ornaments and other valuables along the Atrato, Tuira, and coastal routes. Ceramic traditions indicate established craft specialization before Spanish arrival. Early sixteenth-century expeditions, including Balboa’s crossing in 1513, reported multiple chiefdoms with fortified settlements and ritual leadership. Enslavement, conflict, and epidemic disease rapidly depopulated the region, and surviving communities were absorbed or displaced, with later Kuna movements altering the cultural map. Archaeological finds and Spanish testimony document metalworking skill, regional exchange networks, and agricultural adaptation in a humid tropical frontier."
    },
    {
        "name": "Panama",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Colombia"
            }
        ],
        "upgradesFrom": [
            "Cueva"
        ],
        "city": "Panama City",
        "traits": [
            "Diplomatic",
            "Industrious"
        ],
        "category": "Minor",
        "description": "Panama’s twentieth century turned on the canal and its geopolitical setting. The Panama Canal opened in 1914, anchoring transit trade, U.S. military presence, and an enduring sovereignty dispute. The Colón Free Zone, established in 1948, expanded re-export commerce. The National Guard became a central political actor after the 1968 coup. Under Omar Torrijos, negotiations with the United States produced the 1977 Torrijos–Carter Treaties, which set a path to canal neutrality and transfer. After Torrijos’s death, Manuel Noriega consolidated power until U.S. forces invaded in 1989. Civilian rule returned in the 1990s. Banking and logistics deepened around Panama City, while the Canal Zone transitioned toward Panamanian administration. On 31 December 1999 Panama assumed full control of the waterway, closing a century defined by foreign jurisdiction."
    },
    {
        "name": "Pano-Tacana",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Peru"
            }
        ],
        "city": "Paucartambo",
        "traits": [
            "Militaristic",
            "Religious"
        ],
        "category": "Minor",
        "description": "The Pano-Tacana language family spans western Amazonia, from Peru’s Ucayali to Bolivia’s Beni and Madre de Dios. Peoples such as the Shipibo-Conibo, Cashinahua, Yaminahua, Tacana, and Ese Eja developed riverine lifeways centered on cassava, plantains, fishing, and seasonal mobility. Trade moved ceramics, salt, pigments, and feathers along canoe routes, while ritual specialists mediated health and warfare. Shipibo-Conibo pottery and textiles, marked by geometric kené designs, reveal sophisticated aesthetic systems and social signaling. Many groups resisted Inca encroachment and later evaded early colonial control, though missionization and the rubber boom brought forced labor, displacement, and new settlement patterns. Community defenses and kin alliances buffered epidemics and slaving raids. Lexical and oral traditions preserve shared origins and long-standing interactions across headwater basins."
    },
    {
        "name": "Ecuador",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Peru"
            }
        ],
        "upgradesFrom": [
            "Pano-Tacana"
        ],
        "city": "Quito",
        "traits": [
            "Commercial",
            "Scientific"
        ],
        "category": "Minor",
        "description": "Ecuador’s twentieth century joined Andean highlands, Pacific coast, and Amazonian lowlands within a resource-driven economy. The 1941 war with Peru reshaped borders and defense priorities. Banana exports in the 1950s funded roads and coastal towns. Military nationalists ruled intermittently, promoting agrarian reform in the 1960s. Amazon oil discoveries in 1967 reoriented public finance and spurred frontier colonization, with state companies and foreign firms expanding pipelines to the coast. Urban growth accelerated in Guayaquil and Quito. Democracy returned in 1979 amid debt and inflation pressures. Indigenous mobilizations in the 1990s, coordinated by CONAIE, pressed for land, bilingual education, and constitutional recognition. Regional disparities persisted as the state balanced hydrocarbons, agriculture, and external credit."
    },
    {
        "name": "Valdivia",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Peru"
            }
        ],
        "city": "Valdivia",
        "traits": [
            "Agricultural",
            "Cultural"
        ],
        "category": "Minor",
        "description": "The Valdivia culture flourished on Ecuador’s Santa Elena Peninsula and nearby coasts during the late fourth to second millennia BCE. It is noted for early pottery in the Americas, organized into phases I–VIII that trace stylistic and technological change. Settlements combined small agricultural villages with shell middens, reflecting mixed farming and marine gathering. Female figurines appear in ritual contexts, suggesting household cults and social marking. Potters experimented with firing and surface treatments, while exchange moved tools and ideas along the littoral. Botanical remains indicate maize and gourds, with cotton likely used for textiles and fishing gear. Valdivia traditions influenced later coastal cultures, establishing ceramic and village patterns that endured into the Formative period."
    },
    {
        "name": "Bolivia",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            },
            {
                "type": "region",
                "name": "Peru"
            }
        ],
        "upgradesFrom": [
            "Valdivia"
        ],
        "city": "La Paz",
        "traits": [
            "Militaristic",
            "Scientific"
        ],
        "category": "Minor",
        "description": "Bolivia’s twentieth century was framed by resource politics and social transformation. The Chaco War against Paraguay (1932–1935) exposed military and logistical weakness, catalyzing reformist movements. The 1952 National Revolution, led by the MNR, nationalized tin mines, extended universal suffrage, and advanced agrarian reform that dismantled highland haciendas. Subsequent decades alternated between civilian rule and military governments, while mining volatility and rural poverty persisted. Democracy returned in 1982 amid hyperinflation, prompting the 1985 New Economic Policy and privatization. Natural gas discoveries shifted the extractive base, creating new regional claims. Mounting conflicts over pricing and export routes culminated in mass protests in 2003, setting the stage for far-reaching political realignments. Indigenous-majority demographics shaped debates on citizenship, autonomy, and control of subsoil wealth."
    },
    {
        "name": "Mon",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "China"
            }
        ],
        "city": "Thaton",
        "traits": [
            "Agricultural",
            "Religious"
        ],
        "category": "Minor",
        "description": "The Mon are early inhabitants of mainland Southeast Asia whose polities spread Theravada Buddhism, literacy, and court culture. From the sixth to eleventh centuries, Dvaravati centers in central Thailand produced stuccoed monuments, sema stones, and Pali inscriptions. Farther south, Thaton served as a Theravada hub and conduit for Indian Ocean ideas. The Mon developed scripts that informed later regional writing systems and left an extensive epigraphic record. Artistic programs emphasized Buddhist relic cults and narrative reliefs. Over time, Mon realms were absorbed by Khmer, Tai, and Burmese powers, yet Mon communities persisted in Lower Myanmar and Thailand. Their monastic networks, sculptural forms, and epigraphy shaped the religious and administrative culture of successors across the Chao Phraya delta and the Ayeyarwady basin."
    },
    {
        "name": "Myanmar",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "China"
            }
        ],
        "upgradesFrom": [
            "Mon"
        ],
        "city": "Rangoon",
        "traits": [
            "Cultural",
            "Militaristic"
        ],
        "category": "Minor",
        "description": "Myanmar, known as Burma until 1989, gained independence from Britain in 1948 amid armed conflicts with communist and ethnic forces. Parliamentary rule struggled to consolidate the multiethnic union. In 1962 General Ne Win seized power, instituting the Burmese Way to Socialism, nationalizing industry, and restricting commerce and travel. Economic decline and isolation followed. A 1974 constitution formalized one-party rule. Nationwide protests in 1988 led to a military takeover by the SLORC, later the SPDC. The 1990 elections delivered an NLD victory that was not recognized; Aung San Suu Kyi spent long periods under house arrest. Ceasefires in the 1990s reduced some frontier fighting while border trade expanded. By the century’s end, the state remained under military control with uneven economic opening and ongoing ethnic insurgencies."
    },
    {
        "name": "Dapenkeng",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "China"
            }
        ],
        "city": "Tamsui",
        "traits": [
            "Commercial",
            "Agricultural"
        ],
        "category": "Minor",
        "description": "Dapenkeng denotes the earliest widespread Neolithic horizon in Taiwan, dated c. 4000–2500 BCE. Communities occupied coastal terraces and estuaries near Tamsui, Keelung, and the southwest plain. Potters produced thick, cord-marked vessels with simple rims and lug handles. Toolkits featured polished stone adzes, slate points, and shell scrapers. Settlement middens contain marine shell, fish bone, and remains of taro or millet, suggesting mixed coastal foraging and horticulture. Burial practice was simple, with flexed inhumations and shell grave goods at some sites. Material traits align with the Liaoning–Fujian littoral and with early Austronesian cultural packages. Many scholars view Dapenkeng as the launching point for Austronesian dispersal into the Batanes and Philippines. Subsequent Taiwanese cultures, including Fengpitou and Niuchouzi, develop from this base. Dapenkeng marks the shift from aceramic foragers to pottery-using village societies on the island."
    },
    {
        "name": "Taiwan",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "China"
            }
        ],
        "upgradesFrom": [
            "Dapenkeng"
        ],
        "city": "Taipei",
        "traits": [
            "Scientific",
            "Diplomatic"
        ],
        "category": "Minor",
        "description": "Taiwan in the twentieth century underwent regime change, industrial growth, and democratization. The Republic of China government relocated to Taipei in 1949 after defeat in the Chinese Civil War. Martial law and one-party rule followed, combined with land reform and U.S.-backed development. From the 1960s to 1980s, export-led manufacturing produced the “Taiwan Miracle,” with rising incomes and the emergence of technology firms and small–medium enterprises. Social movements, a growing middle class, and opposition activism led to the lifting of martial law in 1987 and competitive elections. The 1996 direct presidential election consolidated democratic institutions. Cross-strait tensions with the People’s Republic of China remained a central security issue. By the late 1990s, Taiwan transitioned toward high-tech production in semiconductors and electronics, while expanding social welfare and local governance. Debates over identity and sovereignty shaped party politics and external relations."
    },
    {
        "name": "Gopala",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "India"
            }
        ],
        "city": "Pataliputra",
        "traits": [
            "Religious",
            "Industrious"
        ],
        "category": "Minor",
        "description": "Gopala is credited as the founder of the Pala dynasty in Bengal during the mid-eighth century CE. Sources describe his election by regional chiefs amid disorder following the fall of earlier Gauda rulers. His reign consolidated Varendra and parts of Magadha, stabilizing the lower Ganges plain. The Palas patronized Mahayana and Vajrayana Buddhism and supported major monastic universities. Under Gopala and his successors, grants and endowments were issued to Nalanda; later rulers established Vikramashila and Odantapuri as prominent centers. Administrative records and copperplate charters attest to land settlements and military organization. Gopala’s son Dharmapala expanded Pala influence across Bihar and northern India, often contesting with the Gurjara-Pratiharas and Rashtrakutas. While details of Gopala’s campaigns are scarce, his role in restoring regional kingship and monastic networks framed the political economy of eastern India for two centuries. The dynasty endured, with fluctuations, until the twelfth century."
    },
    {
        "name": "Nepal",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "India"
            }
        ],
        "upgradesFrom": [
            "Gopala"
        ],
        "city": "Kathmandu",
        "traits": [
            "Diplomatic",
            "Cultural"
        ],
        "category": "Minor",
        "description": "Twentieth-century Nepal moved from oligarchic rule to constitutional politics and conflict. The Rana family governed as hereditary prime ministers until 1951, when a palace–popular movement ended the regime and restored the Shah monarchy. A brief experiment with parliamentary government collapsed in 1960. King Mahendra introduced the partyless Panchayat system, which centralized authority and constrained dissent. Economic modernization proceeded unevenly, reliant on foreign aid and labor migration. In 1990, mass protests forced the monarchy to accept a constitutional framework and multiparty elections. Political instability and rural inequality provided the setting for a Maoist insurgency beginning in 1996. The conflict led to a state of emergency, heavy casualties, and polarization between palace, parties, and rebels. The 2006 People’s Movement curtailed royal power and opened a peace process. The monarchy was abolished in 2008, creating a federal republic. Debates on federalism, inclusion, and reconstruction continued into the next decade."
    },
    {
        "name": "Punjab",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "India"
            }
        ],
        "city": "Taxila",
        "traits": [
            "Militaristic",
            "Scientific"
        ],
        "category": "Minor",
        "description": "Ancient Punjab, the land of five rivers, formed a fertile corridor between Central Asia and the Indo-Gangetic plain. Early agricultural communities succeeded the Indus Civilization and interacted with Vedic groups in the late second millennium BCE. By the sixth century BCE parts of western Punjab came under Achaemenid control as a satrapy. Alexander’s campaign crossed the region in 326 BCE, meeting resistance near the Hydaspes. The Mauryan Empire integrated Punjab afterward, promoting roads, administration, and Buddhist patronage. Taxila served as a major urban and scholastic center, linking the highlands of Gandhara with the plains. In the following centuries Indo-Greek, Indo-Scythian, and Kushan polities controlled the northwest, facilitating trade along routes to Central Asia. Gandharan art and Buddhist monastic networks flourished under the Kushans. The region’s composite culture and strategic routes shaped later political formations across northwestern India."
    },
    {
        "name": "Pakistan",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "India"
            }
        ],
        "upgradesFrom": [
            "Punjab"
        ],
        "city": "Islamabad",
        "traits": [
            "Religious",
            "Commercial"
        ],
        "category": "Minor",
        "description": "Pakistan emerged in 1947 as a Muslim-majority dominion carved from British India, divided into West and East wings. Partition brought mass migration and communal violence. Early politics balanced civilian leaders and an assertive military. General Ayub Khan’s 1958 coup inaugurated a period of controlled modernization and alliance with the United States and China. Tensions with India produced wars in 1947–48 and 1965. In 1971, civil war in East Pakistan, combined with Indian intervention, led to the creation of Bangladesh. Zulfikar Ali Bhutto pursued populist reforms, followed by General Zia-ul-Haq’s Islamization after the 1977 coup. The Afghan jihad shaped security policy and society in the 1980s. In 1998, Pakistan conducted nuclear tests at Chagai, becoming an acknowledged nuclear power. The 1999 Kargil conflict and another military takeover underscored persistent civil–military contestation. By century’s end, Pakistan remained pivotal in South Asian geopolitics and regional security."
    },
    {
        "name": "Gojoseon",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "Japan"
            }
        ],
        "city": "Pyongyang",
        "traits": [
            "Industrious",
            "Cultural"
        ],
        "category": "Minor",
        "description": "Gojoseon is recorded in Korean tradition as the earliest polity on the peninsula and southern Manchuria. Chronicles trace its founding to the culture hero Dangun, while archaeology associates the horizon with Liaoning-style bronze daggers, walled settlements, and agriculture. By the early first millennium BCE, Gojoseon interacted with the Yan state and steppe groups, managing trade and frontier conflict. A later phase, often termed Wiman Joseon after the usurper Wiman, expanded influence over the Lelang region. In 108 BCE, Han China conquered the kingdom and established commanderies at Lelang, Xuantu, and adjacent zones, reconfiguring local power. Material legacies include distinctive bronze typologies, stone burials, and craft production that spread into northern Korea. Gojoseon serves as a bridge between prehistoric communities and later states such as Buyeo, Goguryeo, and the Three Kingdoms, shaping early Korean political culture and regional networks."
    },
    {
        "name": "Korea",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "Japan"
            }
        ],
        "upgradesFrom": [
            "Gojoseon"
        ],
        "city": "Seoul",
        "traits": [
            "Agricultural",
            "Scientific"
        ],
        "category": "Minor",
        "description": "South Korea emerged from the division of the peninsula in 1948 and the devastation of the Korean War (1950–1953). The First Republic under Syngman Rhee faced authoritarian consolidation and student protest. Military rule returned in 1961 under Park Chung Hee, who launched export-led industrialization, chaebol-centered planning, and the Saemaul Undong rural program. Heavy and chemical industries expanded in the 1970s, while labor unrest grew. After Park’s assassination and Chun Doo Hwan’s seizure of power, the 1980 Gwangju uprising marked a violent confrontation with democratization forces. Mass mobilization in 1987 achieved constitutional reform and direct presidential elections. The economy diversified into electronics, autos, and shipbuilding, achieving OECD accession in 1996. The 1997–1998 Asian financial crisis prompted restructuring and IMF-supported reforms. Cultural industries and global trade furthered integration into world markets, while security policy centered on the U.S. alliance and inter-Korean relations."
    },
    {
        "name": "Ryukyu",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "Japan"
            }
        ],
        "city": "Shuri",
        "traits": [
            "Diplomatic",
            "Agricultural"
        ],
        "category": "Minor",
        "description": "The Ryukyu Kingdom developed across the Okinawan and Sakishima islands as a maritime intermediary between East and Southeast Asia. Early gusuku castle sites and coral limestone architecture date to the thirteenth–fourteenth centuries, when polities coalesced during the Sanzan period. In 1429, Sho Hashi unified Hokuzan, Chuzan, and Nanzan, founding a centralized court at Shuri. Tribute relations with Ming China granted access to regulated trade, while merchants linked Japan, China, Korea, and Southeast Asia in a transshipment system. Court culture produced bingata textiles, performing arts, and a written tradition using classical Chinese. In 1609 the Satsuma domain invaded, imposing dual subordination: formal tributary ties to China and de facto control by Japan. Despite restrictions, trade and artisan production continued until the Meiji annexation in 1879 ended the kingdom. Archaeology and documents record a distinctive island polity built on seafaring, diplomacy, and craft."
    },
    {
        "name": "Okinawa",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "Japan"
            }
        ],
        "upgradesFrom": [
            "Ryukyu"
        ],
        "city": "Naha",
        "traits": [
            "Commercial",
            "Militaristic"
        ],
        "category": "Minor",
        "description": "Okinawa Prefecture’s twentieth century was shaped by war, occupation, and base politics. In 1945 the Battle of Okinawa caused extensive civilian casualties and destruction. The United States administered the islands from 1945 to 1972, separating them from Japan’s postwar polity. Under U.S. rule, land requisitions for bases and a dollar-linked economy defined daily life, while local movements advocated reversion. The 1972 reversion restored Japanese sovereignty, but large U.S. military installations remained under the security treaty. Economic development policies promoted tourism, agriculture, and light industry, yet income gaps with mainland Japan persisted. Incidents involving base personnel provoked repeated protests, and debates over relocation and land use dominated local politics. Cultural revitalization and community resilience marked recovery, as did memorialization of the battle and peace education. By century’s end, Okinawa stood at the intersection of regional security and local autonomy concerns."
    },
    {
        "name": "Khmer",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "Siam"
            }
        ],
        "city": "Angkor",
        "traits": [
            "Religious",
            "Cultural"
        ],
        "category": "Minor",
        "description": "The Khmer Empire dominated mainland Southeast Asia from the 9th to the 15th century, centered on Angkor in Cambodia. Its rulers built a hydraulic city with baray reservoirs, canals, and embankments that supported intensive rice agriculture. Suryavarman II commissioned Angkor Wat in the early 12th century as a state temple. Jayavarman VII expanded the realm after wars with Champa, founded Angkor Thom, and built the Bayon with its face towers. He sponsored roads, hospitals, and rest houses that integrated the core with peripheral provinces. Khmer religion shifted over time from Shaivism to Mahayana Buddhism and later to Theravada. Court inscriptions and bas-reliefs record campaigns, tribute, and corvée labor organization. From the 14th century the polity faced pressure from Ayutthaya, ecological stress, and changes in regional trade. Angkor was sacked in 1431, and power moved toward the lower Mekong. Khmer art, temple architecture, and hydraulic planning left a durable regional legacy."
    },
    {
        "name": "Cambodia",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "Siam"
            }
        ],
        "upgradesFrom": [
            "Khmer"
        ],
        "city": "Phnom Penh",
        "traits": [
            "Industrious",
            "Diplomatic"
        ],
        "category": "Minor",
        "description": "Modern Cambodia emerged from French colonial rule in 1953 under Norodom Sihanouk. The Sangkum period pursued neutrality and limited modernization while the Vietnam War destabilized the countryside. A 1970 coup installed Lon Nol and drew the state deeper into conflict. The Khmer Rouge seized Phnom Penh in 1975, imposed radical agrarian policies, and carried out mass killings. Vietnamese forces overthrew Democratic Kampuchea in 1979 and installed the People’s Republic of Kampuchea. Civil war continued along the Thai border as external patrons backed rival factions. The Paris Peace Agreements of 1991 led to the UNTAC mission and elections in 1993. A constitutional monarchy returned, and Sihanouk resumed the throne. Political consolidation under Hun Sen followed after factional fighting in 1997. Post-conflict reconstruction rebuilt institutions and infrastructure amid a large demining effort. The 20th century defined borders, population recovery, and the basis of contemporary governance."
    },
    {
        "name": "Bắc Sơn",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "Siam"
            }
        ],
        "city": "Bac Son",
        "traits": [
            "Agricultural",
            "Scientific"
        ],
        "category": "Minor",
        "description": "The Bắc Sơn culture marks an early Neolithic horizon in northern Vietnam, concentrated in karst valleys and caves of Lạng Sơn Province. Assemblages include polished stone adzes and axes with oval cross-sections, flaked tools, and bone implements. Simple pottery and shell ornaments occur at several cave sites. Stratigraphy indicates a transition from Hoabinhian foragers to communities practicing incipient agriculture in valley floors. Seasonal mobility persisted while cultivation and plant processing expanded. Faunal remains show mixed hunting and small-scale animal use. Cave sites provided dry conditions for storage and habitation. The culture’s toolkits spread along limestone corridors that linked the Red River basin with upland routes. Bắc Sơn materials form part of a wider northern Indochina sequence that precedes Bronze Age metallurgical adoption. The complex illustrates early polishing technology, changing subsistence strategies, and the gradual establishment of settled Neolithic lifeways in mainland Southeast Asia."
    },
    {
        "name": "Laos",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            },
            {
                "type": "region",
                "name": "Siam"
            }
        ],
        "upgradesFrom": [
            "Bắc Sơn"
        ],
        "city": "Vientiane",
        "traits": [
            "Commercial",
            "Scientific"
        ],
        "category": "Minor",
        "description": "Laos obtained independence from France in 1954 through the Geneva framework. A fragile monarchy governed amid rivalry between royalist, neutralist, and Pathet Lao forces. The country became a theater of the Secret War, with heavy bombing on the Plain of Jars and along the Ho Chi Minh Trail. In 1975 the Pathet Lao captured Vientiane, abolished the monarchy, and proclaimed the Lao People’s Democratic Republic. Early policies emphasized collectivization and close alignment with Vietnam. Economic difficulties prompted gradual market reforms under the New Economic Mechanism from 1986. Demobilization, resettlement, and reconstruction followed as unexploded ordnance remained a persistent hazard. Hydropower, timber, and cross-border trade shaped development strategies. Laos joined ASEAN in 1997 and expanded road and river links to neighbors. The 20th century closed with single-party rule, modest urban growth, and continuing efforts to clear war legacy munitions."
    },
    {
        "name": "Kernewek",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "Britain"
            }
        ],
        "city": "Tintagel",
        "traits": [
            "Cultural",
            "Agricultural"
        ],
        "category": "Minor",
        "description": "Kernewek denotes the Cornish people and their Brythonic language in Britain’s far southwest. During the classical and late Iron Age periods, communities in the peninsula engaged in tin extraction and exchange through Atlantic maritime routes. Under Rome, the area formed part of Dumnonia, with limited urbanization and a rural mining economy. Latin influence coexisted with an insular Celtic substrate that later evolved into the Cornish language. Early medieval monastic sites and place-names record this transition and sustained links with Armorica and Ireland. Over centuries Cornish developed distinct phonology and literature, preserved in religious texts and mystery plays. Political structures shifted from post-Roman petty kingships toward integration with the English crown, while mining remained a core activity. Though later centuries saw language decline, the classical and early medieval foundations defined a regional identity built on tin working, coastal trade, and Brythonic speech."
    },
    {
        "name": "Cornwall",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "Britain"
            }
        ],
        "upgradesFrom": [
            "Kernewek"
        ],
        "city": "Truro",
        "traits": [
            "Commercial",
            "Diplomatic"
        ],
        "category": "Minor",
        "description": "Medieval Cornwall combined a distinct Celtic inheritance with institutions tied to the English crown. Norman consolidation followed earlier Dumnonian traditions, while coastal parishes maintained links to Brittany and Ireland. The Duchy of Cornwall was founded in 1337 for the heir apparent, creating a durable fiscal and legal framework. Stannary Courts and Parliaments regulated tin mining, tolls, and worker privileges, anchoring a specialized export economy. Monastic sites and saints’ cults shaped local Christianity and parish networks. Maritime communities supplied fish, salt, and transport to Bristol, Biscay, and Iberia. Castles at Launceston and Restormel oversaw routes into the peninsula. Arthurian associations clustered around Tintagel and the north coast. By the late Middle Ages, Cornwall balanced duchy governance, stannary autonomy, and growing integration into English legal and market systems, while retaining distinctive customs, placenames, and a Brythonic linguistic landscape."
    },
    {
        "name": "Cymru",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "Britain"
            }
        ],
        "city": "Gwynedd",
        "traits": [
            "Religious",
            "Militaristic"
        ],
        "category": "Minor",
        "description": "Cymru, the Welsh ethnonym meaning “fellow countrymen,” came to define post-Roman polities in western Britain. From the 6th to 13th centuries, kingdoms such as Gwynedd, Powys, and Deheubarth contested borders with Anglo-Saxon and later Norman powers. Offa’s Dyke marked a Mercian frontier and a line of frequent conflict. Welsh rulers developed law codes, most famously under Hywel Dda, and patronized poets who sustained a court literary tradition. The Mabinogion preserves medieval prose narratives rooted in earlier oral culture. Norman Marcher Lords carved out fortified enclaves along the borderlands. Periodic Welsh unifications, notably under Gruffudd ap Llywelyn and later Llywelyn ap Gruffudd, sought to consolidate authority. Edward I’s campaigns ended native princely rule in 1282 and integrated Wales into the English realm. Despite conquest, the term Cymru endured as a marker of language, law, and historical community."
    },
    {
        "name": "Wales",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "Britain"
            }
        ],
        "upgradesFrom": [
            "Cymru"
        ],
        "city": "Cardiff",
        "traits": [
            "Scientific",
            "Cultural"
        ],
        "category": "Minor",
        "description": "During the industrial era, Wales became a major center of coal, iron, and steel. Merthyr Tydfil’s Cyfarthfa and Dowlais works led early ironmaking, while Swansea earned the name Copperopolis. Dense railway construction linked coalfields to expanding ports. Cardiff and Barry developed large docks that fueled export growth and urbanization. Industrial labor shaped society and politics. The Rebecca Riots targeted tollgates and rural inequities in the 1840s. The 1839 Chartist Newport Rising pressed for political reform. Trade unionism and nonconformist chapels structured community life. Welsh-language culture adapted to urban settings through the press and eisteddfodau. By the early 20th century, global markets and mechanization altered employment and settlement. The region entered cycles of boom and contraction, yet retained technical skills, transport infrastructure, and institutions that tied the coal and steel economy to the wider British world."
    },
    {
        "name": "Helvetii",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "France"
            }
        ],
        "city": "Aventicum",
        "traits": [
            "Diplomatic",
            "Agricultural"
        ],
        "category": "Minor",
        "description": "The Helvetii were a Celtic population on the Swiss Plateau during the late Iron Age. Caesar’s Gallic War recounts their 58 BCE attempt to migrate west under the aristocrat Orgetorix. Roman forces defeated them near Bibracte and ordered a return to their homeland. Subsequent integration into Roman rule produced the civitas Helvetiorum with Aventicum as its principal center. Under Vespasian, Aventicum gained colonial status and developed theaters, baths, and an amphitheater. Rural villae and road links tied the plateau to Alpine passes and the Rhine frontier. La Tène material from lakes and hillforts attests to pre-conquest craftsmanship and warfare. Romanization brought Latin epigraphy, new cults, and administrative restructuring while preserving some local elites. The Helvetii entered provincial history as a community documented through archaeology and Latin sources rather than as an independent polity."
    },
    {
        "name": "Switzerland",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "France"
            }
        ],
        "upgradesFrom": [
            "Helvetii"
        ],
        "city": "Bern",
        "traits": [
            "Industrious",
            "Commercial"
        ],
        "category": "Minor",
        "description": "Switzerland consolidated as a modern federal state with the 1848 Constitution, which created a bicameral parliament, a federal executive, and a unified market. Neutrality framed foreign policy while industry expanded from textiles into precision machinery and chemicals. Railways integrated alpine regions with European networks. The Gotthard Tunnel, opened in 1882, established a key transalpine corridor and showcased engineering capacity. Watchmaking flourished in the Jura arc and Geneva with standardized parts and training schools. Banking and insurance matured alongside urban services in Zurich, Basel, and Lausanne. Federalism managed multilingual cantons through shared institutions and referendums. The Red Cross, founded in Geneva in 1863, reflected a humanitarian strand tied to neutrality. By 1900, Switzerland combined political stability, skilled labor, and transport infrastructure to sustain export-led growth in a challenging alpine environment."
    },
    {
        "name": "Ausci",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "France"
            }
        ],
        "city": "Auch",
        "traits": [
            "Cultural",
            "Militaristic"
        ],
        "category": "Minor",
        "description": "The Ausci were an Aquitanian people centered on Elimberrum, later known as Augusta Auscorum (Auch), in Roman-period southwestern Gaul. Their language was related to the non‑Indo‑European Aquitanian group, with onomastic links to ancient Basque. After Roman conquest, the civitas of the Ausci formed part of Gallia Aquitania and then Novempopulania. Urban life expanded around the forum and baths at Auch, and rural estates integrated the region into imperial markets. Inscriptions attest to local sanctuaries and cults across Gascony, showing a blend of indigenous traditions and Roman forms. Men from the tribe served as auxilia in the Roman army, gaining citizenship and spreading Roman practices on return. Archaeology records pottery, epigraphy, and road networks that tied Auch to Tolosa and Burdigala. The Ausci maintained a distinct Aquitanian identity while undergoing steady Romanization."
    },
    {
        "name": "Aquitane",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "France"
            }
        ],
        "upgradesFrom": [
            "Ausci"
        ],
        "city": "Bordeaux",
        "traits": [
            "Agricultural",
            "Scientific"
        ],
        "category": "Minor",
        "description": "Aquitane was the medieval duchy of southwestern France, stretching from the Loire to the Pyrenees and centered on Poitiers and Bordeaux. It emerged from late Carolingian partitions and grew into a powerful principality under dukes who fostered cross-Channel ties. Eleanor of Aquitaine carried the duchy first to the French crown and then to the Plantagenets, creating a long Anglo‑Angevin presence. Courtly culture and troubadour poetry flourished under ducal patronage. The Bordeaux wine trade expanded through Atlantic routes, linking Gascon ports to England and northern Europe. During the Hundred Years’ War, Aquitane was a principal theater, changing hands through campaigns and treaties such as Brétigny. The French monarchy consolidated control by the late fifteenth century, integrating ducal institutions with royal administration while maintaining commercial vigor around the Gironde and Garonne."
    },
    {
        "name": "Belgica",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "Germany"
            }
        ],
        "city": "Tongeren",
        "traits": [
            "Agricultural",
            "Religious"
        ],
        "category": "Minor",
        "description": "Gallia Belgica was a Roman province established by Augustus in northern Gaul, inhabited by the Belgae and allied tribes. It stretched from the lower Seine and Marne to the Rhine frontier and included key nodes such as Durocortorum, Augusta Treverorum, and Atuatuca. Julius Caesar’s campaigns first documented the region’s polities and military capacities. Under Roman rule, Belgica developed a dense road network, military installations, and urban centers with forums, baths, and amphitheaters. Provincial reorganization in the late empire divided the territory into Belgicae with new administrative seats, while Trier rose as an imperial residence. Rural villas exploited fertile plains and river corridors, and local cults blended with Roman religious practice. The province served as a strategic buffer along the Rhine and a conduit for trade between the Mediterranean and the North Sea."
    },
    {
        "name": "Netherlands",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "Germany"
            }
        ],
        "upgradesFrom": [
            "Belgica"
        ],
        "city": "Amsterdam",
        "traits": [
            "Commercial",
            "Scientific"
        ],
        "category": "Minor",
        "description": "The Netherlands in the Enlightenment era traced its political form to the Dutch Republic forged by the Revolt against Spain. The United Provinces maintained a maritime‑commercial empire led by the VOC, whose Asian networks financed banking, shipbuilding, and urban prosperity. Amsterdam emerged as a European financial hub with advanced credit instruments and exchanges. Intellectual life produced major thinkers and experimenters, including Spinoza, Huygens, and Leeuwenhoek, whose work advanced philosophy, optics, and microscopy. Stadtholderless periods shaped republican governance, while Anglo‑Dutch conflicts and eighteenth‑century wars strained commerce. Enlightenment societies and presses circulated scientific and political ideas. By the 1790s the Batavian Revolution, influenced by French arms and ideology, ended the old republican constitution and reoriented institutions, yet the legacy of trade, science, and civic culture remained durable."
    },
    {
        "name": "Allemanni",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "Germany"
            }
        ],
        "city": "Augsburg",
        "traits": [
            "Militaristic",
            "Diplomatic"
        ],
        "category": "Minor",
        "description": "The Allemanni were a loose Germanic confederation established along the Upper Rhine and across the Black Forest during the third and fourth centuries. They pressured Roman frontiers, raided border provinces, and settled in territories that became Swabia and parts of Alsace. Roman campaigns countered their expansion, notably Julian’s victory at the Battle of Strasbourg in 357. In the migration era they confronted both Roman and Frankish forces, suffering decisive defeat near Tolbiac under Clovis. Over time their settlements formed the region of Alamannia, which adopted Christianity and integrated into the Merovingian and Carolingian realms. Archaeological finds include row grave cemeteries, weapon burials, and fibulae styles. Early law codes and later duchies show the persistence of regional identity under changing political overlords."
    },
    {
        "name": "Bavaria",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "Germany"
            }
        ],
        "upgradesFrom": [
            "Allemanni"
        ],
        "city": "Munich",
        "traits": [
            "Industrious",
            "Religious"
        ],
        "category": "Minor",
        "description": "Bavaria emerged in the early Middle Ages as a duchy on the empire’s southeastern frontier, structured by the Agilolfing dynasty under Frankish suzerainty. Missionaries such as Boniface organized dioceses at Freising, Regensburg, and Passau, consolidating Christian institutions. After Carolingian reordering, the duchy passed to various rulers and in 1156 narrowed in scope when Austria separated. Munich was founded in 1158 around a market and bridge on the Isar, becoming a rising urban center. From 1180 the Wittelsbachs held Bavaria, creating durable princely administration and patronizing towns and monasteries. Within the Holy Roman Empire, Bavarian dukes balanced imperial service with territorial consolidation. The late medieval period saw partitions and reunifications, fiscal development from salt and trade, and the growth of Munich into a political and economic capital."
    },
    {
        "name": "Dacia",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "Yugoslavia"
            }
        ],
        "city": "Sarmizegetusa",
        "traits": [
            "Militaristic",
            "Scientific"
        ],
        "category": "Minor",
        "description": "Dacia was a kingdom north of the Danube that under Decebalus resisted Roman expansion until Trajan’s campaigns of 101–102 and 105–106. After conquest, Rome established the province of Dacia, promoted colonization, and exploited the rich metalliferous zones, notably the gold mines at Roșia Montană (Alburnus Maior). Urban centers, roads, and forts connected the Transylvanian plateau to the Danube limes. Reliefs on Trajan’s Column depict the wars and Dacian fortifications in the Orăștie Mountains. The province blended Dacian, Roman, and immigrant populations and minted coinage to support a militarized economy. In the third century, pressures from Carpi and Goths and strategic retrenchment led Aurelian to evacuate the province around 271, creating a new Dacia south of the Danube. Material culture and place-names attest to lasting Dacian elements."
    },
    {
        "name": "Romania",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "Yugoslavia"
            }
        ],
        "upgradesFrom": [
            "Dacia"
        ],
        "city": "Bucharest",
        "traits": [
            "Cultural",
            "Diplomatic"
        ],
        "category": "Minor",
        "description": "Romania formed in the nineteenth century through the union of Wallachia and Moldavia under Alexandru Ioan Cuza in 1859. Cuza’s reforms modernized administration, secularized monastic estates, and advanced legal codes. In 1866 the German prince Carol of Hohenzollern‑Sigmaringen accepted the throne, guiding state-building and military reorganization. Participation alongside Russia in the 1877–1878 war secured international recognition of independence. In 1881 Romania proclaimed the kingdom under Carol I, attracting foreign investment and expanding railways and ports. Oil extraction at Ploiești and cereal exports integrated the economy into European markets. Political life balanced conservative and liberal currents while addressing peasant demands and national schools. By the early twentieth century, Romania pursued territorial goals and institutional consolidation that framed later unification with Transylvania in 1918."
    },
    {
        "name": "Magyar",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "Yugoslavia"
            }
        ],
        "city": "Szeged",
        "traits": [
            "Agricultural",
            "Militaristic"
        ],
        "category": "Minor",
        "description": "The Magyars were a confederation of Hungarian tribes who migrated from the Pontic steppe and entered the Carpathian Basin around 895 under Árpád. Prior habitation in Etelköz and interactions with Khazar and steppe polities shaped their cavalry warfare and leadership structures. From their new base they launched raids across Central and Western Europe until their defeat at the Battle of Lechfeld in 955 curtailed long‑range incursions. A principality emerged that consolidated control over the basin, integrating local populations and transit routes. Conversion and institutional reform proceeded in the late tenth century, setting the stage for the Christian kingdom established under Stephen I in 1000. Settlement patterns shifted from mobile camps to villages and hillforts, while frontier defenses and tribute systems secured resources and trade arteries."
    },
    {
        "name": "Hungary",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            },
            {
                "type": "region",
                "name": "Yugoslavia"
            }
        ],
        "upgradesFrom": [
            "Magyar"
        ],
        "city": "Budapest",
        "traits": [
            "Scientific",
            "Commercial"
        ],
        "category": "Minor",
        "description": "Nineteenth‑century Hungary evolved within the Habsburg framework from a historic kingdom into a modern state apparatus. The 1848 revolution demanded constitutional rights, national guard, and emancipation; subsequent defeat brought neo‑absolutism, then gradual concessions. The Austro‑Hungarian Compromise of 1867 created the Dual Monarchy, granting Hungary internal autonomy with a common army, foreign policy, and finance. Budapest formed in 1873 from Buda, Pest, and Óbuda, becoming a metropolitan center with bridges, boulevards, and industry. Railways linked the Great Plain, mining districts, and Danube ports, while firms such as Ganz advanced engineering. Land reforms, education laws, and a civil code modernized society, though nationality policies remained contentious. By 1900 Hungary was a rapidly industrializing polity with a diverse economy and assertive parliamentary life."
    },
    {
        "name": "Cyrenaica",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Egypt"
            }
        ],
        "city": "Cyrene",
        "traits": [
            "Commercial",
            "Religious"
        ],
        "category": "Minor",
        "description": "Cyrenaica was a Greek colonial region on the North African coast centered on Cyrene. Settlers from Thera founded Cyrene around 631 BCE under Battus, establishing the Battiad dynasty. The region formed a Pentapolis of cities including Cyrene, Apollonia, Ptolemais, Barca, and Berenice. Wealth derived from coastal agriculture and a monopoly on silphium, a valuable plant depicted on local coinage. Cyrenaica came under Persian influence, then passed to the Hellenistic Ptolemies after Alexander. Learned figures such as Aristippus and Eratosthenes were linked to its cities. Rome annexed Cyrenaica in the first century BCE, later administering it with Crete as a joint province. The area developed Roman urban features, road networks, and early Christian communities. Earthquakes and economic changes affected the cities in late antiquity, and the silphium trade faded. Despite decline, inscriptions and ruins document strong Greek civic traditions adapted to imperial rule."
    },
    {
        "name": "Libya",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Egypt"
            }
        ],
        "upgradesFrom": [
            "Cyrenaica"
        ],
        "city": "Tripoli",
        "traits": [
            "Industrious",
            "Militaristic"
        ],
        "category": "Minor",
        "description": "Libya is a North African state formed from the regions of Tripolitania, Cyrenaica, and Fezzan. Italy conquered the territory in 1911–1912 and ruled until the Second World War. After Allied campaigns, the United Nations oversaw the transition to independence. The Kingdom of Libya was proclaimed in 1951 under Idris al-Sanusi. Oil discoveries in 1959 reshaped state revenues and social policy. In 1969 officers led by Muammar Gaddafi ended the monarchy and established a new regime that nationalized key sectors. The government launched large infrastructure schemes, including the Great Man-Made River project begun in 1984. International disputes and sanctions marked the 1980s and 1990s. In 2011 an uprising and external intervention toppled the long-standing system. The following decade saw rival administrations, militia conflict, and intermittent ceasefires. Diplomatic efforts sought to restore unified national institutions, while hydrocarbon output remained central to the economy."
    },
    {
        "name": "Nubia",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Egypt"
            }
        ],
        "city": "Napata",
        "traits": [
            "Agricultural",
            "Cultural"
        ],
        "category": "Minor",
        "description": "Nubia is the ancient Nile corridor south of Egypt with centers along the Second to Sixth Cataracts. During the Bronze Age, the Kerma kingdom flourished around 2500–1500 BCE. Kerma had monumental architecture, large tumuli, and workshops linked to long-distance trade. Nubian elites exchanged gold, ivory, ebony, and livestock with Egypt and inner Africa. Skilled Nubian archers served as mercenaries in Egyptian armies. From the mid second millennium BCE, New Kingdom Egypt conquered and administered Nubia through the Viceroy of Kush, building temples and forts. Local traditions persisted alongside Egyptian cults and administration. After Egyptian withdrawal, Kushite polities re-emerged, first at Napata and later at Meroe, preserving elements of earlier Nubian culture. Archaeology across cemeteries and settlement mounds documents metalworking, cattle pastoralism, and ceramic styles distinct from the Nile Delta. Nubia remained a conduit between Saharan, Nilotic, and Red Sea networks."
    },
    {
        "name": "Sudan",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Egypt"
            }
        ],
        "upgradesFrom": [
            "Nubia"
        ],
        "city": "Khartoum",
        "traits": [
            "Diplomatic",
            "Scientific"
        ],
        "category": "Minor",
        "description": "Sudan occupies the middle and upper Nile zones, inheriting the legacy of ancient Nubia and Kush. The region fell under Turco-Egyptian rule in the nineteenth century and saw the Mahdist state rise in the 1880s. After Anglo-Egyptian reconquest, Sudan was administered as a condominium. Independence was achieved in 1956. Political life alternated between civilian governments and military regimes. The First Sudanese Civil War began in 1955 and ended with the 1972 Addis Ababa Agreement, granting southern autonomy. Renewed conflict in 1983 followed policy shifts and the imposition of Islamic law. The Second Civil War brought severe humanitarian crises in the 1990s. The Comprehensive Peace Agreement of 2005 paved the way for the secession of South Sudan in 2011. Conflict in Darfur from 2003 drew international attention. Popular protests in 2019 removed President Omar al-Bashir. Subsequent transitional arrangements faced renewed instability and armed confrontation."
    },
    {
        "name": "Helmand",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Iran"
            }
        ],
        "city": "Mundigak",
        "traits": [
            "Religious",
            "Agricultural"
        ],
        "category": "Minor",
        "description": "The Helmand culture refers to Bronze Age communities in the Helmand River basin of southern Afghanistan and adjacent Sistan. Mundigak served as a major center between circa 3000 and 2000 BCE, with large mud-brick platforms, planned quarters, and workshops. Irrigation agriculture supported wheat, barley, and pastoral herds in an arid landscape. Crafts included painted ceramics, stone vessels, and faience. Sites shared traits with Shahr-i Sokhta across the border, indicating a regional cultural sphere. Long-distance trade linked Helmand settlements to the Indus Valley and to Mesopotamia via the Iranian plateau and Makran coast. Materials such as lapis lazuli, chlorite, and shell moved through these routes. Settlement contraction around the end of the third millennium BCE may reflect climatic stress and shifting exchange networks. Excavations at Mundigak and nearby sites outline an early urban tradition distinct from but connected to neighboring Bronze Age civilizations."
    },
    {
        "name": "Afghanistan",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Iran"
            }
        ],
        "upgradesFrom": [
            "Helmand"
        ],
        "city": "Kabul",
        "traits": [
            "Militaristic",
            "Scientific"
        ],
        "category": "Minor",
        "description": "Afghanistan is a mountainous state at the crossroads of Central and South Asia. The modern polity formed from Durrani and Barakzai dynastic realms. The 1919 Treaty of Rawalpindi confirmed independence after the Third Anglo-Afghan War. A constitutional monarchy under Zahir Shah introduced limited reforms. In 1973 a republic displaced the throne. The 1978 Saur Revolution brought a socialist government aligned with the USSR. Soviet forces intervened in 1979, sparking a decade of conflict. Withdrawal in 1989 preceded regime collapse and civil war among mujahideen factions. The Taliban emerged in the mid-1990s and took Kabul in 1996. After 2001 an international coalition supported a new Islamic Republic, which held successive elections and rebuilt institutions amid insurgency. In 2021 the Taliban regained control following the departure of foreign forces. Economic life remains shaped by agriculture, transit trade, and aid, with recurrent displacement and reconstruction cycles."
    },
    {
        "name": "Mannaeans",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Iran"
            }
        ],
        "city": "Izirtu",
        "traits": [
            "Cultural",
            "Militaristic"
        ],
        "category": "Minor",
        "description": "The Mannaeans were an Iron Age polity in the Zagros foothills south of Lake Urmia in northwestern Iran. Their kingdom is attested in Assyrian and Urartian sources from the ninth to seventh centuries BCE. The capital, often identified as Izirtu, and a chain of fortified sites controlled valleys and passes. Mannaean rulers balanced between Assyria and Urartu, paying tribute, forming alliances, and resisting incursions. Assyrian campaigns under Shalmaneser III, Tiglath-pileser III, and Sargon II mention Mannaean cities, rulers, and rival claimants. Material culture shows influences from neighboring highland and lowland traditions, with decorated ceramics, ivories, and bronze fittings. Archaeological work at Hasanlu and Qalaichi has illuminated regional networks and artistic exchange, though attributions remain debated. By the late seventh century BCE, Median expansion and Assyrian upheavals absorbed Mannaean territories, ending their independent role in the politics of the northwest Iranian plateau."
    },
    {
        "name": "Azerbaijan",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Iran"
            }
        ],
        "upgradesFrom": [
            "Mannaeans"
        ],
        "city": "Baku",
        "traits": [
            "Commercial",
            "Diplomatic"
        ],
        "category": "Minor",
        "description": "Azerbaijan lies on the western shores of the Caspian Sea, bridging the Caucasus and Iranian plateau. Baku’s oil fields made the area a major industrial center by the late nineteenth century. In 1918 the Azerbaijan Democratic Republic was declared, becoming the first secular parliamentary republic in the Muslim world. Soviet forces incorporated the country in 1920 as the Azerbaijan SSR, which developed heavy industry and energy infrastructure. Independence was restored in 1991 with the dissolution of the USSR. The First Nagorno-Karabakh War in the early 1990s caused displacement and territorial losses, followed by a 1994 ceasefire. Subsequent governments pursued energy export routes such as the Baku–Tbilisi–Ceyhan pipeline and built closer ties with regional partners. Renewed fighting in the 2010s and 2020 altered control lines before later agreements. State institutions consolidated under strong presidential leadership while hydrocarbon revenues funded large urban projects."
    },
    {
        "name": "Israelites",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Iraq"
            }
        ],
        "city": "Jerusalem",
        "traits": [
            "Religious",
            "Scientific"
        ],
        "category": "Minor",
        "description": "The Israelites were an ancient Levantine people whose early communities formed in the highlands of Canaan. Tradition and later texts describe a United Monarchy under Saul, David, and Solomon in the tenth century BCE. The First Temple was constructed in Jerusalem and became a central cult site. After a dynastic split, the northern Kingdom of Israel, centered on Samaria, and the southern Kingdom of Judah, centered on Jerusalem, developed separate trajectories. Assyria conquered Israel in 722 BCE and deported segments of the population. Babylon captured Jerusalem in 586 BCE, destroyed the Temple, and exiled elites from Judah. Under the Achaemenid Persians, Judean groups returned and rebuilt cult structures, initiating the Second Temple period. Inscriptions, archaeology, and biblical literature record political organization, law, and worship. These sources also trace the formation of identities that later shaped Judaism and related traditions."
    },
    {
        "name": "Israel",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Iraq"
            }
        ],
        "upgradesFrom": [
            "Israelites"
        ],
        "city": "Tel Aviv",
        "traits": [
            "Cultural",
            "Industrious"
        ],
        "category": "Minor",
        "description": "Israel is a modern state established on the eastern Mediterranean coast in 1948. Its Declaration of Independence was followed by war with neighboring Arab states and 1949 armistice lines. A parliamentary system structured political life, while large immigration waves from Europe, the Middle East, the former USSR, and Ethiopia reshaped society. In 1967 Israel fought the Six-Day War and took control of the West Bank, Gaza Strip, Sinai, and Golan Heights. The 1973 war led to strategic reassessment. A peace treaty with Egypt was signed in 1979 and a treaty with Jordan in 1994. The Oslo process in the 1990s created interim arrangements with the Palestinians, though final status remained unresolved. The economy diversified into technology, defense, and services. Recurrent conflicts, diplomacy, and internal debates defined state policy and the region’s balance of power."
    },
    {
        "name": "Canaanite",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Iraq"
            }
        ],
        "city": "Byblos",
        "traits": [
            "Commercial",
            "Agricultural"
        ],
        "category": "Minor",
        "description": "The Canaanites were Bronze Age societies of the Levant organized in independent city-states along the coast and inland valleys. Ports such as Byblos, Tyre, and Sidon exchanged timber, copper, and luxury goods with Egypt and Cyprus. Inland polities connected caravan routes between Syria and the Jordan. At Ugarit, cuneiform archives record treaties, diplomacy, and far-ranging trade. Cult centers honored Baal, Astarte, and El in temples with standing stones and offering installations. Elite households managed textile and metal workshops. Canaanite dialects and a consonantal alphabet emerged from earlier scripts, aiding mercantile record keeping. Egyptian hegemony framed much of the Late Bronze Age, followed by turmoil during the 12th century BCE collapse. Successor Phoenician and Israelite polities carried forward maritime commerce, urban cults, and artistic motifs across the Mediterranean."
    },
    {
        "name": "Lebanon",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Iraq"
            }
        ],
        "upgradesFrom": [
            "Canaanite"
        ],
        "city": "Beirut",
        "traits": [
            "Scientific",
            "Diplomatic"
        ],
        "category": "Minor",
        "description": "Lebanon emerged in 1943 as an independent republic after the French Mandate. Its system rested on the National Pact’s confessional power-sharing. Beirut grew as a banking and media hub that linked Arab markets and the diaspora. Tensions among Maronite, Sunni, Shi‘a, Druze, and Palestinian factions escalated into the 1975–1990 Civil War. Syrian and Israeli interventions, militia rule, and shifting alliances devastated institutions and infrastructure. The 1989 Taif Agreement rebalanced parliamentary seats, affirmed sovereignty, and guided demobilization. Syrian forces remained until 2005. Reconstruction in the 1990s focused on central Beirut and services. External borrowing and remittances financed the program. Despite recurrent crises, Lebanon kept a plural press, private education networks, and active port trade. Its political economy stayed sensitive to regional conflicts and refugee inflows."
    },
    {
        "name": "Nabataeans",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Syria"
            }
        ],
        "city": "Raqmu",
        "traits": [
            "Religious",
            "Diplomatic"
        ],
        "category": "Minor",
        "description": "The Nabataeans built a caravan kingdom that linked South Arabian incense and Indian Ocean spices to Mediterranean markets. Petra (Raqmu) served as the capital. Engineers cut channels, cisterns, and dams into rock to store water and support fields. Kings such as Aretas IV extended control over the Negev, the Hauran, and Red Sea ports including Aila and Leuke Kome. Monumental façades like al-Khazneh and ad-Deir display Hellenistic forms adapted to local craft. Nabataean Aramaic carried administration and fostered a script later influential for Arabic. Coinage and customs revenues funded diplomacy with Judaea and Rome. Maritime competition and Roman expansion eroded caravan profits. In 106 CE Trajan annexed the realm as the province of Arabia Petraea with Bostra as capital. Petra declined as routes shifted."
    },
    {
        "name": "Jordan",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Syria"
            }
        ],
        "upgradesFrom": [
            "Nabataeans"
        ],
        "city": "Amman",
        "traits": [
            "Commercial",
            "Scientific"
        ],
        "category": "Minor",
        "description": "Jordan arose from the British Mandate’s Emirate of Transjordan. It gained independence in 1946 under the Hashemite dynasty. The kingdom consolidated authority under King Abdullah I and later King Hussein, balancing tribal, Palestinian, and urban constituencies. After the 1948 war Jordan controlled East Jerusalem and the West Bank; these territories were lost to Israel in 1967. The 1970–1971 conflict with Palestinian guerrillas, known as Black September, reasserted state control. Aid from Western and Gulf partners supported infrastructure, education, and public employment. A gradual political opening began in 1989 with parliamentary elections and legal opposition parties. In 1994 Jordan signed a peace treaty with Israel and strengthened ties with the United States. The country absorbed successive refugee waves, straining resources yet maintaining internal stability."
    },
    {
        "name": "Kata",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Syria"
            }
        ],
        "city": "Sumhuram",
        "traits": [
            "Agricultural",
            "Militaristic"
        ],
        "category": "Minor",
        "description": "Kata denotes a South Arabian polity active along the Dhofar coast in the late Hellenistic and early Roman eras. It is linked to Sumhuram (modern Khor Rori), a fortified port that shipped frankincense from hinterland groves to Arabia, India, and the Mediterranean. Inscriptions in South Arabian script record local rulers, temple dedications, and dealings with Hadramaut and Qataban. Harbor works, warehouses, and incense-processing installations indicate organized control of export quality and taxation. Overland routes tied the port to caravan stations on the Yemeni plateau. Monsoon sailing expanded seaborne exchange. Political fortunes shifted with regional rivalries and changing demand as aromatics met competition from other resins. By late antiquity Sumhuram waned, while ports farther west on the Red Sea and in Oman gained prominence."
    },
    {
        "name": "Oman",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            },
            {
                "type": "region",
                "name": "Syria"
            }
        ],
        "upgradesFrom": [
            "Kata"
        ],
        "city": "Muscat",
        "traits": [
            "Cultural",
            "Diplomatic"
        ],
        "category": "Minor",
        "description": "The Sultanate of Oman underwent rapid transformation after Sultan Qaboos took power in 1970. Oil revenues financed roads, hospitals, and schools across previously isolated regions. The Dhofar insurgency, backed by Marxist South Yemen, ended in 1976 with British, Iranian, and Jordanian assistance. Administrative reforms unified the interior and coastal domains into a centralized state. Oman joined the Gulf Cooperation Council in 1981 and pursued balanced diplomacy with Iran, Yemen, and Western partners. The late 20th century saw expansion of desalination, ports at Muscat and Salalah, and national airlines. Education and health indicators improved from a low base. Expatriate labor grew in construction and services. Hydrocarbon dependence remained a constraint, prompting early diversification into logistics, fisheries, and tourism."
    },
    {
        "name": "Macedonia (Ancient)",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Greece"
            }
        ],
        "city": "Pella",
        "traits": [
            "Militaristic",
            "Cultural"
        ],
        "category": "Minor",
        "description": "Ancient Macedonia occupied the northern Greek hinterland with cores in Lower Macedonia and the Axios basin. Under Philip II (359–336 BCE) it forged a unified kingdom. Military reforms created the sarissa phalanx and integrated Companion cavalry. Victory at Chaeronea in 338 BCE brought hegemony over the Greek poleis. Alexander III overthrew the Achaemenid Empire and extended rule to Egypt, Mesopotamia, and the Indus. New cities such as Alexandria and Seleucia spread Greek institutions and coinage. After Alexander’s death the successors partitioned the empire. The Antigonid dynasty held Macedonia proper until defeats by Rome at Cynoscephalae (197 BCE) and Pydna (168 BCE). Rome dissolved the monarchy and organized the province. Macedonian methods and colonization shaped the Hellenistic world."
    },
    {
        "name": "Macedonia (Modern)",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Greece"
            }
        ],
        "upgradesFrom": [
            "Macedonia (Ancient)"
        ],
        "city": "Skopje",
        "traits": [
            "Diplomatic",
            "Scientific"
        ],
        "category": "Minor",
        "description": "Modern Macedonia declared independence from Yugoslavia in 1991 and formed a parliamentary republic centered on Skopje. International recognition proceeded under a provisional UN reference due to a naming dispute with Greece. A 1995 Interim Accord stabilized relations and changed the flag and emblems. The new state introduced the denar and privatized enterprises. Transition brought high unemployment but macroeconomic stability. Security was affected by UN and NATO missions on its borders. In 1999 the Kosovo crisis produced a large refugee influx and NATO deployments that strained infrastructure. Relations with neighbors improved through agreements with Bulgaria and Albania. Media and education expanded, and institutions curated both Slavic and Ottoman-era heritage. By 2000 the state sought deeper European and transatlantic ties."
    },
    {
        "name": "Salamis",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Greece"
            }
        ],
        "city": "Salamis",
        "traits": [
            "Commercial",
            "Militaristic"
        ],
        "category": "Minor",
        "description": "Salamis was a leading city-kingdom on the east coast of Cyprus from the Late Bronze Age into the Hellenistic era. Its harbor linked copper exports and grain trade to the Aegean and the Levant. Under Evagoras I (c. 411–374 BCE) the city asserted autonomy, allied with Athens, and challenged Persian authority. Fortifications, temples, and necropoleis attest to urban growth and Greek cultural forms after earlier Phoenician influence. Local coinage bearing royal names circulated in regional commerce. After Alexander’s campaigns, Salamis entered the Ptolemaic sphere and later the Roman order. It retained importance as an administrative and ecclesiastical center. Earthquakes and shifting trade routes reduced its prominence in late antiquity. Nearby Constantia inherited many urban functions."
    },
    {
        "name": "Cyprus",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Greece"
            }
        ],
        "upgradesFrom": [
            "Salamis"
        ],
        "city": "Nicosia",
        "traits": [
            "Cultural",
            "Religious"
        ],
        "category": "Minor",
        "description": "Cyprus gained independence from Britain in 1960 under the Zurich–London Agreements, creating a bicommunal republic with Greek and Turkish Cypriot power-sharing. Constitutional breakdown in 1963 led to intercommunal violence and UN peacekeeping from 1964. A Greek-backed coup in July 1974 prompted Turkish military intervention and de facto partition. A UN buffer zone, the Green Line, separated administrations in the north and south. Sovereign British base areas remained at Akrotiri and Dhekelia. The Republic of Cyprus consolidated state institutions, shipping, and services in the south during the late 20th century. Reunification talks recurred under UN auspices without final settlement. The island’s strategic position kept it central to Eastern Mediterranean security and migration routes."
    },
    {
        "name": "Sicani",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Italy"
            }
        ],
        "city": "Enna",
        "traits": [
            "Agricultural",
            "Religious"
        ],
        "category": "Minor",
        "description": "The Sicani were an indigenous Bronze Age population of central and western Sicily. Classical authors located them around Enna and the island’s interior uplands. Archaeology identifies hilltop settlements, rock-cut tombs, and necropolises that reflect agrarian and pastoral lifeways with bronze metallurgy. Cult activity appears in caves and funerary contexts. Material exchanges linked them to neighboring Sicels and Elymians, while coastal contact with Phoenician traders grew during the late Bronze and early Iron Ages. Pottery styles and burial customs show both continuity and adaptation under external pressures. Greek colonization along the coasts later reoriented regional networks, but interior sites retained local traditions. Thucydides’ report of an Iberian origin is debated, yet it influenced later ethnographic narratives. The Sicani illustrate how indigenous Sicilian societies negotiated climatic constraints, rugged terrain, and maritime economies before and during early Mediterranean colonial encounters."
    },
    {
        "name": "Sicily",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Italy"
            }
        ],
        "upgradesFrom": [
            "Sicani"
        ],
        "city": "Palermo",
        "traits": [
            "Commercial",
            "Scientific"
        ],
        "category": "Minor",
        "description": "In the classical era, Sicily was a contested Mediterranean crossroads. Greek city-states established colonies such as Syracuse, Akragas, Selinus, and Himera, while Carthage dominated the western coast with centers like Motya and Panormus. The Battle of Himera (480 BCE) set a precedent for recurrent Greco-Carthaginian warfare. Syracuse reached hegemony under Dionysius I, who expanded fortifications and fleets. In 212 BCE, Archimedes advised the city’s defenses during the Roman siege. Rome entered decisively during the Punic Wars, securing Sicily after 241 BCE and establishing it as the province of Sicilia. Panormus (Palermo) and Syracuse became administrative and commercial hubs. Under Roman rule, the island served as a principal grain supplier and a nexus for maritime routes between Italy, Africa, and the eastern Mediterranean. Classical Sicily’s layered polities produced diverse legal regimes, coinages, and civic cultures that endured into the imperial period."
    },
    {
        "name": "Illyria",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Italy"
            }
        ],
        "city": "Shkodra",
        "traits": [
            "Agricultural",
            "Militaristic"
        ],
        "category": "Minor",
        "description": "Classical Illyria comprised tribal confederations along the eastern Adriatic and western Balkans. Greek and Roman writers noted maritime raiding and shifting alliances among dynasts. Scodra (Shkodra) emerged as a political center. Under Queen Teuta in the early 3rd century BCE, Illyrian piracy and control of coastal routes provoked Roman intervention. The First Illyrian War (229–228 BCE) curtailed naval power, and subsequent conflicts followed as leaders such as Demetrius of Pharos tested Roman limits. The Third Illyrian War (168 BCE) ended with the defeat of King Gentius and the reorganization of Illyrian territories under Roman oversight. Over time, Roman roads, garrisons, and colonies integrated the coast and uplands into Illyricum and later Dalmatia. Despite administrative consolidation, local identities and hillfort traditions persisted. Illyria’s frontier status shaped Adriatic trade, mercenary recruitment, and the projection of Roman power into the Balkans."
    },
    {
        "name": "Croatia",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Italy"
            }
        ],
        "upgradesFrom": [
            "Illyria"
        ],
        "city": "Zagreb",
        "traits": [
            "Diplomatic",
            "Industrious"
        ],
        "category": "Minor",
        "description": "Medieval Croatia developed from early South Slavic polities formed after the 7th century. By the 9th and 10th centuries, duchies in Dalmatia and Pannonia consolidated, and King Tomislav, crowned around 925, is credited with uniting lands and structuring military and ecclesiastical institutions. Coastal communes maintained Latin urban traditions, while inland counties organized under a network of župans. The Zagreb bishopric was founded in the 11th century, binding the region to broader ecclesiastical reforms. Following dynastic shifts, a personal union with Hungary in 1102 (traditionally framed by the Pacta Conventa) preserved a Croatian Sabor and Ban while integrating into a larger realm. Venetian power grew along Dalmatian shores. Glagolitic literacy, royal charters, and monastic centers attest to a distinct legal and cultural life. By the late Middle Ages, Croatia’s institutions navigated pressures from neighboring kingdoms and Ottoman frontiers."
    },
    {
        "name": "Euskadi",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Spain"
            }
        ],
        "city": "Iruña-Veleia",
        "traits": [
            "Cultural",
            "Industrious"
        ],
        "category": "Minor",
        "description": "In classical antiquity, the Basque homelands straddled the western Pyrenees and the Bay of Biscay. Classical authors referenced the Vascones, Caristii, Varduli, and Autrigones, whose settlements occupied valleys and coastal corridors. Roman power advanced through roads, military posts, and towns such as Pompaelo (Pamplona) and Oiasso (Irun). Epigraphic finds, including those at Iruña-Veleia, record Latin administrative presence alongside enduring local onomastics. Communities alternated between resistance and accommodation, supplying auxiliaries while retaining upland autonomy. Agriculture, stockraising, and ironworking linked mountain and maritime economies. Romanization proceeded unevenly, with civitas institutions concentrated in accessible zones. The Basque linguistic substrate survived across changing imperial regimes, forming a distinctive profile within the northern Iberian mosaic. By late antiquity, these territories connected Aquitanian and Iberian routes while preserving local governance patterns."
    },
    {
        "name": "Basque",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Spain"
            }
        ],
        "upgradesFrom": [
            "Euskadi"
        ],
        "city": "Bilbao",
        "traits": [
            "Commercial",
            "Diplomatic"
        ],
        "category": "Minor",
        "description": "During the industrial era, the Basque Country in Spain underwent rapid transformation driven by iron ore, coal imports, and Atlantic shipping. Bilbao and its estuary became a manufacturing core, with steelworks such as Altos Hornos de Vizcaya and major shipyards at Sestao and Bilbao. Railways and foreign capital integrated mines with ports. The Carlist Wars (1833–1876) reshaped regional autonomy, and the subsequent loss of fueros altered fiscal and military arrangements. Industrialization fostered powerful labor movements and urban growth. Cultural associations promoted Euskara, and in 1919 Euskaltzaindia was founded to standardize the language. Political nationalism coalesced around Sabino Arana’s ideas in the late 19th century. By the early 20th century, the Basque Country had become a leading Iberian industrial district, coupling heavy industry with maritime commerce and a distinct cultural revival."
    },
    {
        "name": "Lusitanian",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Spain"
            }
        ],
        "city": "Conimbriga",
        "traits": [
            "Religious",
            "Militaristic"
        ],
        "category": "Minor",
        "description": "The Lusitanians were western Iberian tribal groups known for prolonged resistance to Rome in the 2nd century BCE. Their territory stretched across interior Portugal and parts of Extremadura. Viriathus emerged as a skilled leader around 147–139 BCE, employing mobile warfare against Roman columns. Roman commanders, including Servilianus and later Servilius Caepio, struggled to suppress the revolt; Viriathus was finally assassinated by envoys bribed by Rome. Subsequent campaigns secured control, and Augustus organized the province of Lusitania, incorporating communities through municipia and coloniae. Latinization advanced in towns such as Conimbriga, where urban planning, baths, and mosaics attest to Roman civic life layered over indigenous traditions. Despite provincial integration, rural uplands preserved elements of pre-Roman social structures. The Lusitanian wars shaped Roman frontier doctrine and the political geography of western Hispania."
    },
    {
        "name": "Portugal",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Spain"
            }
        ],
        "upgradesFrom": [
            "Lusitanian"
        ],
        "city": "Lisbon",
        "traits": [
            "Scientific",
            "Commercial"
        ],
        "category": "Minor",
        "description": "Medieval Portugal emerged from the County of Portucale, granted to Henry of Burgundy in the late 11th century. His son Afonso Henriques consolidated authority after victories including the traditionally cited Ourique (1139) and asserted kingship. The Treaty of Zamora (1143) secured recognition from León, and papal approval followed in 1179. The capture of Lisbon in 1147, aided by crusaders, opened the Tagus estuary and accelerated the Reconquista southward. Military orders fortified frontiers and repopulated lands. Under Afonso III and Dinis, administration, law, and taxation were systematized, while the Portuguese language gained written status. Noble lineages, municipalities, and ecclesiastical institutions negotiated privileges with the crown. The Treaty of Alcanices (1297) stabilized borders with Castile. By the 14th century, Portugal stood as a consolidated Atlantic-facing monarchy, poised for later maritime expansion."
    },
    {
        "name": "Gymnesiae",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Tunisia"
            }
        ],
        "city": "Palma",
        "traits": [
            "Agricultural",
            "Diplomatic"
        ],
        "category": "Minor",
        "description": "Gymnesiae was the classical name for Mallorca and Menorca in the Balearic Islands. The islands developed early maritime ties with Phoenician and Punic traders. Their slingers gained a reputation for accuracy and were enlisted in Carthaginian and later Roman forces. In 123 BCE, Q. Caecilius Metellus led a Roman conquest, earning the cognomen Balearicus. Rome founded colonies such as Palma and Pollentia to secure sea lanes and suppress piracy. Agriculture, salt production, and transit trade integrated the islands into western Mediterranean circuits. Local cults and burial customs persisted alongside Roman institutions. The Gymnesiae occupied a strategic position between Iberia and Sardinia, serving as staging points for fleets and merchants."
    },
    {
        "name": "Baleares",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Tunisia"
            }
        ],
        "upgradesFrom": [
            "Gymnesiae"
        ],
        "city": "Palma de Mallorca",
        "traits": [
            "Cultural",
            "Scientific"
        ],
        "category": "Minor",
        "description": "In the Middle Ages, the Balearic archipelago shifted from Islamic rule to incorporation into the Crown of Aragon. The Taifa of Mallorca flourished as a mercantile and corsair hub in the 11th and 12th centuries, linked to North African dynasties. James I of Aragon conquered Mallorca in 1229 and completed the subjugation of the islands by 1235, establishing Christian lordship and repopulation. Palma developed as an administrative and commercial center. In 1276, the Kingdom of Majorca was created for a cadet branch of the Aragonese house, but it was reintegrated in 1349. Maritime trade in wool, sugar, and salt, along with ship repair and provisioning, sustained the economy. Jewish and Muslim communities contributed to finance and crafts under varying legal regimes. The islands served as strategic nodes in western Mediterranean navigation."
    },
    {
        "name": "Numidia",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Tunisia"
            }
        ],
        "city": "Cirta",
        "traits": [
            "Militaristic",
            "Religious"
        ],
        "category": "Minor",
        "description": "Numidia was a Berber kingdom in North Africa that stood between Carthage and Rome during the classical era. It grew from the Massylii and Masaesyli confederations. Masinissa unified the realm after the Second Punic War by aligning with Rome. He strengthened agriculture, cavalry warfare, and control over the steppe. Cirta served as the royal capital and center of diplomacy. After Carthage fell in 146 BCE, Numidia acted as a Roman client. The Jugurthine War (112–105 BCE) pitted Jugurtha against Rome and exposed sharp conflicts inside the Roman elite. Jugurtha was captured following the intervention of Bocchus of Mauretania. Civil wars later drew the kingdom into Roman struggles. Juba I backed the Pompeians and fell after Caesar’s victory at Thapsus in 46 BCE. Rome then annexed the area as the province of Africa Nova. Urban life and veteran colonies expanded around Cirta under Roman rule."
    },
    {
        "name": "Algeria",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            },
            {
                "type": "region",
                "name": "Tunisia"
            }
        ],
        "upgradesFrom": [
            "Numidia"
        ],
        "city": "Algiers",
        "traits": [
            "Agricultural",
            "Industrious"
        ],
        "category": "Minor",
        "description": "Algeria achieved independence in 1962 after 132 years of French rule. The Algerian War of Independence (1954–1962), led chiefly by the National Liberation Front (FLN), combined guerrilla warfare with urban operations and diplomacy. The Evian Accords ended the conflict and set the path for sovereignty, while prompting the departure of most European settlers. An FLN-led state under Ahmed Ben Bella and then Houari Boumédiène adopted centralized planning and built a large hydrocarbon sector through Sonatrach. Algiers expanded rapidly as an administrative and industrial hub. Foreign policy stressed Non-Aligned cooperation and African solidarity. Economic reforms and limited political opening followed in the 1980s. The cancellation of 1991 elections precipitated a civil conflict through the 1990s, which ended with security operations and reconciliation measures. In the 2000s the state invested hydrocarbon revenues in infrastructure and social programs. Algeria remains a major gas exporter with a large youth population and enduring debates on governance and diversification."
    },
    {
        "name": "Malay",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Indonesia"
            }
        ],
        "city": "Palembang",
        "traits": [
            "Commercial",
            "Cultural"
        ],
        "category": "Minor",
        "description": "The medieval Malay world consisted of maritime polities that controlled passages linking the Indian Ocean and the South China Sea. Srivijaya, centered on Palembang from the seventh century, managed shipping, levied duties, and patronized Buddhist learning. Its influence reached the Malay Peninsula, western Borneo, and the Straits. Chola raids in the eleventh century disrupted its power but did not end Malay dominance in regional trade. A wide Malay diaspora of traders and seafarers formed communities along key ports across island Southeast Asia. From the thirteenth century, Islam spread along these routes and reshaped court culture, law, and literacy through the Jawi script. Later sultanates continued Malay commercial and political traditions, with Melaka becoming the leading entrepôt in the fifteenth century. Courtly Malay served as a lingua franca for commerce and diplomacy. Navigation skills, monsoon knowledge, and boatbuilding underpinned the prosperity of Malay polities in the Straits zone."
    },
    {
        "name": "Malaysia",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Indonesia"
            }
        ],
        "upgradesFrom": [
            "Malay"
        ],
        "city": "Kuala Lumpur",
        "traits": [
            "Diplomatic",
            "Industrious"
        ],
        "category": "Minor",
        "description": "Malaysia was formed in 1963 as a federation of Malaya, Sabah, Sarawak, and Singapore. A brief conflict with Indonesia, known as Konfrontasi, accompanied the early years. Singapore separated in 1965. Kuala Lumpur developed as the federal capital and a manufacturing and services center. Political life was dominated by the Alliance and its successor, Barisan Nasional. The New Economic Policy launched in 1971 aimed to reduce poverty and restructure ownership after the 1969 disturbances. It promoted education, affirmative action, and state-led investment. From the 1980s the country industrialized through export-oriented zones, heavy industry, and infrastructure projects. Leadership under Mahathir Mohamad set long-term development goals and encouraged foreign investment. Peninsular corridors and the Klang Valley grew rapidly, while Sabah and Sarawak retained resource-based economies within the federal system. By the late twentieth century Malaysia had diversified beyond rubber and tin, building electronics, petrochemicals, and services while maintaining a constitutional monarchy."
    },
    {
        "name": "Asmat",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Indonesia"
            }
        ],
        "city": "Agats",
        "traits": [
            "Agricultural",
            "Religious"
        ],
        "category": "Minor",
        "description": "The Asmat are a Papuan people of the southwest New Guinea lowlands, known for riverine settlement and expert woodcarving. Their environment is tidal mangrove and sago swamp. Subsistence focused on sago processing, fishing, and estuarine foraging, supported by large dugout canoes for transport and ritual display. Ancestor veneration guided social life. Bisj poles, elaborate shield designs, and house posts encoded clan memory and ceremonial obligations. Intergroup raiding and headhunting existed historically and ended in the mid‑twentieth century under mission and state pressure. Sustained outside contact intensified after the 1950s. Asmat carving entered museum and gallery collections worldwide, while villages retained ritual cycles adapted to new conditions. The creation of Asmat Regency within Indonesia enabled local administration and cultural festivals. Oral histories, initiation rites, and woodcarving schools continue to transmit knowledge across generations."
    },
    {
        "name": "Papua",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Indonesia"
            }
        ],
        "upgradesFrom": [
            "Asmat"
        ],
        "city": "Jayapura",
        "traits": [
            "Cultural",
            "Diplomatic"
        ],
        "category": "Minor",
        "description": "Papua refers to the Indonesian-administered western half of New Guinea, integrated into Indonesia after the 1969 Act of Free Choice. Jayapura developed as the administrative center, linked outward through air and coastal shipping. State-led programs encouraged transmigration and resource extraction, including logging and mining, to accelerate growth. Local opposition coalesced in the Free Papua Movement (OPM), which pursued independence and faced sustained security operations. The 2001 Special Autonomy Law granted revenue-sharing and local institutions, yet disputes over implementation persisted. Administrative reorganizations created the province of West Papua in 2003 and, in 2022, additional provinces in the highlands and south. Education, health, and infrastructure indicators improved unevenly across difficult terrain. Civil society and church networks advocate for rights and cultural protection. Governance balances national integration with demands for autonomy, while the region remains strategically important and ethnolinguistically diverse."
    },
    {
        "name": "Arrernte",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Polynesia"
            }
        ],
        "city": "Alice Springs",
        "traits": [
            "Religious",
            "Scientific"
        ],
        "category": "Minor",
        "description": "The Arrernte are an Aboriginal people of central Australia whose country centers on Mparntwe (Alice Springs) and surrounding ranges and river corridors. Their cosmology, known as Altyerre, orders kinship, land tenure, and ritual life through songlines that connect sacred sites. Ceremonies reaffirm these links with body designs, dance, and the maintenance of places such as waterholes and gaps. Rock art and petroglyphs record ancestral narratives. Contact with pastoral expansion in the nineteenth century brought dispossession, violence, and mission activity. The Lutheran mission at Hermannsburg (Ntaria) shaped Western Arrernte experience and produced enduring religious and artistic traditions. Eastern and Central Arrernte languages continue in daily use and in schools and media. Land rights and joint management of conservation areas have expanded since the late twentieth century. Contemporary Arrernte art, education programs, and cultural authorities sustain law and transmit knowledge to younger generations."
    },
    {
        "name": "Australia",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Polynesia"
            }
        ],
        "upgradesFrom": [
            "Arrernte"
        ],
        "city": "Canberra",
        "traits": [
            "Agricultural",
            "Industrious"
        ],
        "category": "Minor",
        "description": "The Commonwealth of Australia formed in 1901 by federating six self-governing colonies under a written constitution. The seat of government moved to Canberra, a planned capital, with Parliament opening there in 1927. Australia fought with Britain in the First World War, most famously at Gallipoli, and with the Allies in the Second World War in the Pacific and Europe. Post‑war policy encouraged mass immigration and built a welfare state and public infrastructure. Strategic alignment with the United States was formalized under ANZUS in 1951. The White Australia policy was dismantled after 1949, enabling multicultural growth. A 1967 referendum expanded federal powers regarding Aboriginal affairs, and later legal decisions, including Mabo in 1992, reshaped land rights. From the 1970s the economy diversified toward services and Asia‑Pacific trade. Federalism, constitutional monarchy, and stable elections framed political life through the twentieth century."
    },
    {
        "name": "Hawaii (Ancient)",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Polynesia"
            }
        ],
        "city": "Kailua",
        "traits": [
            "Cultural",
            "Militaristic"
        ],
        "category": "Minor",
        "description": "Before Western contact, the Hawaiian Islands were organized into competing chiefdoms governed by ali‘i under a strict kapu system. Society was stratified among chiefs, priests, skilled specialists, and maka‘āinana cultivators. The economy combined irrigated taro terraces, dryland sweet potato fields, and coastal fishponds. Land was divided into ahupua‘a that ran from mountain to sea, integrating resources across zones. Religious life centered on heiau temples and seasonal rites. Long-distance voyaging knowledge linked Hawaii to the wider Polynesian sphere and persisted in oral tradition and navigation practice. Settlement expanded along leeward coasts such as the Kailua‑Kona region, where agricultural and ritual complexes grew during the late precontact period. Warfare among island polities intensified in the centuries before unification. Artistic production included featherwork, wood carving, and finely woven mats."
    },
    {
        "name": "Hawaii (Modern)",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Polynesia"
            }
        ],
        "upgradesFrom": [
            "Hawaii (Ancient)"
        ],
        "city": "Honolulu",
        "traits": [
            "Commercial",
            "Scientific"
        ],
        "category": "Minor",
        "description": "In the twentieth century Hawaii moved from a U.S. territory to full statehood. The Pearl Harbor attack in 1941 drew the United States into the Pacific War and turned the islands into a major military base and logistics center. Statehood followed a 1959 referendum and congressional approval. Honolulu grew into a regional hub for tourism, finance, and trans‑Pacific shipping, while sugar and pineapple plantations declined and diversified. Federal defense installations remained central to the economy and strategic posture. Post‑statehood politics developed a two‑party system with strong local institutions and county governments. Migration from Asia and the U.S. mainland, along with Native Hawaiian communities, produced a multicultural society. Cultural revival movements from the 1970s affirmed language and heritage in education and public life. Late twentieth‑century policy focused on infrastructure, environmental management, and balancing tourism with community needs."
    },
    {
        "name": "Malagasy",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Sri Lanka"
            }
        ],
        "city": "Mahilaka",
        "traits": [
            "Agricultural",
            "Diplomatic"
        ],
        "category": "Minor",
        "description": "The Malagasy formed from Austronesian voyagers arriving by the first millennium CE, likely from the Barito region of Borneo, mixing with African settlers from the East African coast. Early communities established along river valleys and coasts before expanding into the central highlands. They cultivated wet rice using terracing and irrigated fields, and kept zebu cattle adapted to island ecology. Canoe navigation and outrigger knowledge connected settlements to the Indian Ocean trade. Beads, textiles, and iron flowed through Malagasy ports, while slaves and forest products left the island. Malagasy language, an Austronesian tongue, absorbed Bantu and Arabic loanwords. Lineages organized land and labor, with ritual specialists mediating ancestor veneration. Oral traditions recall Vazimba predecessors. Regional chiefdoms emerged around fortified hill sites. Iron smelting and woodworking supported agriculture and warfare. By the late medieval era, coastal and highland polities engaged Swahili, Arab, and South Asian merchants, laying foundations for later state consolidation."
    },
    {
        "name": "Madagascar",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Sri Lanka"
            }
        ],
        "upgradesFrom": [
            "Malagasy"
        ],
        "city": "Antananarivo",
        "traits": [
            "Religious",
            "Industrious"
        ],
        "category": "Minor",
        "description": "Madagascar in the early modern and industrial era centered on the Merina kingdom of the central highlands. Andrianampoinimerina consolidated Imerina in the late eighteenth century. His successor Radama I expanded control over much of the island through alliances and conquest, and opened relations with British envoys and missionaries. Court reforms standardized administration, taxation, and corvée labor (fanompoana). Mission presses produced a Latin-script orthography for Malagasy and spread literacy in Antananarivo. Queen Ranavalona I pursued defensive isolation and internal mobilization, while later rulers reopened commerce. Export of slaves declined under external pressure, shifting toward cattle, rice, and labor services. Fortified roads, hill citadels, and regimented villages supported rule. Coastal rivals and European powers challenged sovereignty. French campaigns culminated in the 1895 conquest and the abolition of the monarchy. Under colonial rule, plantations, railways, and port works tied the island to global markets. Antananarivo remained the administrative center shaping national politics."
    },
    {
        "name": "Tamil",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Sri Lanka"
            }
        ],
        "city": "Madurai",
        "traits": [
            "Commercial",
            "Religious"
        ],
        "category": "Minor",
        "description": "The classical Tamil world flourished from the late first millennium BCE to the early centuries CE. Sangam anthologies such as the Ettuthokai and Pattuppattu preserved court and bardic poetry on love, war, and kingship. The Chera and Pandya polities patronized poets, managed pearl fisheries, and taxed inland agrarian zones. Ports including Muziris and Korkai linked the Tamil coast to Red Sea and Mediterranean commerce. Roman coins, amphorae, and Tamil-Brahmi inscriptions mark this exchange. Elite cults of Murugan, Shiva, and Vishnu coexisted with local hero and fertility worship. Megalithic burials and iron technology indicate complex social stratification. Poets like Kapilar and Avvaiyar appear as culture bearers and political mediators in tradition. Early Tamil adapted Prakrit and Sanskrit loanwords while preserving a distinct Dravidian grammar. Guilds and merchant corporations moved along peninsular routes and overseas. This period established literary canons and coastal trade patterns that informed later Chola imperial expansion."
    },
    {
        "name": "Vijayanagara",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Sri Lanka"
            }
        ],
        "upgradesFrom": [
            "Tamil"
        ],
        "city": "Hampi",
        "traits": [
            "Militaristic",
            "Scientific"
        ],
        "category": "Minor",
        "description": "The Vijayanagara Empire arose in 1336 as a Hindu-ruled power countering Delhi Sultanate advances in the Deccan. From fortified capitals at Hampi, Penukonda, and later Chandragiri, the Raya kings organized a revenue system, irrigation networks, and the nayaka provincial order. Krishnadevaraya (r. 1509–1529) oversaw campaigns against the Gajapatis and the Bahmani successor states and patronized Kannada, Telugu, Sanskrit, and Tamil literature. Temple complexes at Hampi, including Virupaksha and Vittala, combined monumental gopuras, bazaars, and ritual tanks. Long-distance trade moved cotton textiles, spices, and horses via Persian Gulf and Portuguese networks. Royal stables and artillery reformed warfare. The empire fought a protracted rivalry with the Bahmani and later the Deccan sultanates. Defeat at the Battle of Talikota in 1565 devastated Hampi, yet a reduced polity persisted south of the Tungabhadra under Aravidu rulers. Vijayanagara’s agrarian colonization, military organization, and urban planning shaped successor Nayaka states across southern India."
    },
    {
        "name": "Baiyue",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Vietnam"
            }
        ],
        "city": "Nanning",
        "traits": [
            "Agricultural",
            "Scientific"
        ],
        "category": "Minor",
        "description": "The Baiyue were diverse peoples occupying the humid valleys and coasts of southern China and northern Vietnam during the first millennium BCE. Archaeological finds show stilt-house settlements, wet-rice cultivation, and seafaring craft suited to estuaries. Bronze working produced ornaments and drums akin to Dong Son traditions. Classical Chinese sources noted tattooing, distinctive dress, and autonomous chieftaincies. Qin and early Han expansion met strong resistance, followed by incorporation through prefectures and military colonies. The kingdom of Nanyue under Zhao Tuo bridged Yue communities from Guangdong to the Red River until Han annexation in 111 BCE. Local elites entered imperial administration while many groups moved into uplands. Yue languages and cultures left traces among later Zhuang, Bouyei, and other Tai-Kadai speakers. Riverine and maritime routes tied the region to pearl, salt, and lacquer trades. Over time, sinicization and migration layered new identities on older Yue substrata."
    },
    {
        "name": "Hainan",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Vietnam"
            }
        ],
        "upgradesFrom": [
            "Baiyue"
        ],
        "city": "Haikou",
        "traits": [
            "Commercial",
            "Militaristic"
        ],
        "category": "Minor",
        "description": "Hainan emerged as a southern frontier of Tang and Song administration, organized as Qiongzhou and related prefectures. Han settlers shared the island with indigenous Li and Miao communities who maintained shifting cultivation, textile arts, and village alliances. The court used Hainan as an exile destination; the Song literatus Su Shi taught and wrote there, and local schools spread Confucian curricula. Coastal ports engaged South China Sea commerce linking Champa, Jiaozhi, and Guangdong. Kiln ceramics, aromatics, pearls, and tropical produce moved through market towns. Campaigns alternated between pacification and negotiation with upland groups, with garrisons protecting roads and ferries to Leizhou. Monasteries and shrines marked travel nodes. Shipwrecks off the island attest to heavy medieval shipping. By the Yuan and early Ming, expanded settlement and taxation deepened integration while preserving distinct Li zones in the interior. Hainan thus served as both imperial periphery and maritime waystation."
    },
    {
        "name": "Luzones",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Vietnam"
            }
        ],
        "city": "Tondo",
        "traits": [
            "Cultural",
            "Religious"
        ],
        "category": "Minor",
        "description": "The Luzones were the inhabitants of Luzon, the largest island of the Philippine archipelago, whose ancestry combined early Negrito populations with Austronesian migrants arriving from Taiwan around 2000 BCE. Archaeological evidence points to early rice cultivation, jar burials, and maritime exchange networks linking northern Luzon to Taiwan and the wider South China Sea. By the first millennium CE, communities developed coastal chiefdoms supported by wet-rice agriculture, gold working, and inter-island trade. Chinese records from the Song dynasty noted tribute missions from Ma-i and other settlements, showing integration into regional commerce. By the 15th and 16th centuries, the Luzones had become recognized seafarers and mercenaries active in Malacca, Brunei, and beyond, supplying rice and forest products while engaging in gold and porcelain exchange. These networks connected them to Islamic sultanates and established their role in early Southeast Asian trade. On the eve of Spanish colonization, the Luzones stood as one of the most prominent maritime communities of the Philippines."
    },
    {
        "name": "Philippines",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            },
            {
                "type": "region",
                "name": "Vietnam"
            }
        ],
        "upgradesFrom": [
            "Luzones"
        ],
        "city": "Manila",
        "traits": [
            "Agricultural",
            "Diplomatic"
        ],
        "category": "Minor",
        "description": "The Philippines transitioned from Spanish colony to independent republic through war, occupation, and institution building in the twentieth century. The 1896–1898 revolution and the Spanish–American War ended Spanish rule, followed by the Philippine–American War (1899–1902) and pacification campaigns. Under U.S. civil administration, public schooling, English-language instruction, and infrastructure expanded, while limited self-government grew through the Philippine Assembly and Jones Act. The Commonwealth, inaugurated in 1935 under Manuel L. Quezon, prepared for sovereignty. Japanese invasion in 1941 brought occupation, guerrilla warfare, and severe civilian losses. Liberation in 1944–1945 preceded independence on 4 July 1946. Postwar reconstruction faced agrarian unrest from the Huk movement and rapid urbanization. Alliance with the United States shaped defense and economic policy. Ferdinand Marcos’s presidency (1965–1986) introduced martial law, centralized patronage, and debt-driven projects. The 1986 People Power movement restored electoral politics. Overseas labor migration, remittances, and service industries became major features of the late-century economy."
    },
    {
        "name": "Tatars",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Mongolia"
            }
        ],
        "city": "Kazan",
        "traits": [
            "Militaristic",
            "Religious"
        ],
        "category": "Minor",
        "description": "Tatars in the medieval period were Turkic-Mongol groups embedded in the polities that followed the Mongol conquests. Within the Golden Horde, they managed steppe pastures, river towns, and caravan routes from the Volga to the Black Sea. Conversion to Islam accelerated under Öz Beg Khan in the fourteenth century, shaping legal practice and culture. Tatar contingents raided and taxed Rus’ principalities, extracting tribute through basqaq administration and allied princes. After the Horde fragmented, successor khanates arose at Kazan, Astrakhan, and Crimea. The Volga Tatars built trading communities and craft quarters in Kazan, while Islamic scholars linked the region to Central Asian learning. Muscovy’s capture of Kazan (1552) and Astrakhan (1556) brought incorporation and resettlement, yet Tatar elites and merchants persisted under negotiated privileges. Crimean Tatars continued steppe warfare and a slave trade across the Black Sea. Tatar diasporas maintained networks that tied the Eurasian forest-steppe to Ottoman and Central Asian markets."
    },
    {
        "name": "Cossacks",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Mongolia"
            }
        ],
        "upgradesFrom": [
            "Tatars"
        ],
        "city": "Rostov",
        "traits": [
            "Agricultural",
            "Diplomatic"
        ],
        "category": "Minor",
        "description": "During the eighteenth century, Cossack hosts served as frontier cavalry and riverine forces for expanding empires while defending corporate autonomy. The Zaporozhian Sich guarded the Dnieper rapids and alternated allegiance between the Polish–Lithuanian Commonwealth and the Russian Empire. The Don Cossack Host supplied scouts and irregulars along the steppe frontier and the Caucasus. Service brought land, tax exemptions, and internal self-government under elected officers. Reforms by Peter I and Catherine II tightened imperial control, creating standardized regiments and demanding continuous mobilization. Participation in Russo–Turkish wars extended Cossack settlement to the Kuban and the Black Sea littoral. The Pugachev Rebellion (1773–1775), which drew many disaffected Cossacks and peasants, prompted harsh reprisals and the abolition of the Zaporozhian Sich in 1775. Thereafter hosts were reorganized as hereditary military estates. Despite curbs on autonomy, Cossacks remained integral to border colonization, escort duties, and rapid strike operations in imperial campaigns."
    },
    {
        "name": "Ymyakhtakh",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Mongolia"
            }
        ],
        "city": "Belaya Gora",
        "traits": [
            "Agricultural",
            "Scientific"
        ],
        "category": "Minor",
        "description": "The Ymyakhtakh culture occupied the middle Lena and adjacent basins of northeastern Siberia during the late Neolithic to Early Bronze Age (c. 2500–1500 BCE). Archaeology shows small riverine campsites, semi-subterranean houses, and hearths. Toolkits include stone and early bronze knives, awls, and distinctive tanged and stemmed arrowheads. Ceramic traditions employ pointed-base pots with comb impressions and textile-like surface finishes. Subsistence relied on taiga hunting, fishing, and seasonal reindeer exploitation. Sites cluster along navigable channels and portages that linked the Lena, Aldan, and Kolyma systems. Burial finds suggest archery-oriented warfare and ritual. The culture spread widely across the subarctic and interacted with contemporaries of the forest zone. It provided a technological base for later Siberian metalwork and archery practices noted across Yakutia."
    },
    {
        "name": "Sakha",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Mongolia"
            }
        ],
        "upgradesFrom": [
            "Ymyakhtakh"
        ],
        "city": "Yakutsk",
        "traits": [
            "Cultural",
            "Industrious"
        ],
        "category": "Minor",
        "description": "The Sakha (Yakut) formed a Turkic-speaking society in the Lena River basin during the medieval period. Oral traditions and linguistics indicate migration from the south, possibly the Baikal region, between the 13th and 15th centuries. They adapted horse and cattle herding to the subarctic through haymaking, winter stalling, and selective breeding. Settlement formed around ulus units and clan lineages. Blacksmiths produced iron tools and ornament and held ritual status. Shamanic practice structured healing, divination, and seasonal rites. Expansion along the middle and lower Lena brought interaction with Evenk hunters and with Tungusic and Yukaghir groups. Fur trade ties intensified after the 17th century with Russian tribute systems. The Sakha language became dominant across central Yakutia. Pastoral lifeways, equestrian culture, and oral epics (olonkhо) anchored identity and governance into the early modern era."
    },
    {
        "name": "Monpa",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Tibet"
            }
        ],
        "city": "Tawang",
        "traits": [
            "Religious",
            "Cultural"
        ],
        "category": "Minor",
        "description": "The Monpa are a Tibeto-Burman people of the Tawang and West Kameng region on the southern slopes of the eastern Himalaya. Medieval communities organized around fortified villages that guarded trade passes to the Tsangpo valley. Early Buddhist influence entered through Tibetan schools and local monasteries tied to Tawang. Agricultural cycles combined barley, millet, and shifting cultivation with yak and sheep pastoralism at higher elevations. Artisans produced woodwork, textiles, and iron tools for trans-Himalayan exchange. Political authority rested with village headmen under loose regional polities sometimes termed Monyul. Monasteries mediated disputes and ritual life and kept links with Lhasa and Bhutan. The Monpa adopted fortification methods suited to narrow valleys and landslide-prone terrain. Trade in salt, wool, and tea sustained contacts across mountain corridors through the late medieval and early modern periods."
    },
    {
        "name": "Bhutan",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Tibet"
            }
        ],
        "upgradesFrom": [
            "Monpa"
        ],
        "city": "Thimphu",
        "traits": [
            "Diplomatic",
            "Religious"
        ],
        "category": "Minor",
        "description": "Bhutan consolidated in the 17th century under Zhabdrung Ngawang Namgyel. He unified rival valleys, codified the dual system of governance, and established Drukpa Kagyu authority. Massive dzong fortresses were erected at strategic river confluences to serve as monasteries, administrative centers, and arsenals. Tibetan invasions were repelled in repeated campaigns during the 1640s and 1650s. The state instituted a network of regional governors and monastic hierarchs under the Zhabdrung’s charisma and legal codes. Trade with Tibet and Assam provided revenue in wool, salt, and rice. Successors managed internal rivalries among penlops while maintaining the dzong system and road networks. The polity retained autonomy despite highland conflicts and changing Himalayan geopolitics. Its institutions shaped later Bhutanese statecraft into the 19th century."
    },
    {
        "name": "Uyghur",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Tibet"
            }
        ],
        "city": "Karabalghasun",
        "traits": [
            "Commercial",
            "Religious"
        ],
        "category": "Minor",
        "description": "The Uyghurs rose to imperial power with the Uyghur Khaganate (744–840) on the Mongolian steppe. Its capital, Ordu-Baliq, featured planned streets, walls, and palaces. The court patronized Manichaean clergy and scribes, producing texts in the Old Uyghur script. After the collapse, Uyghur groups migrated to the Tarim Basin and founded the Kingdom of Qocho around Turfan and Bezeklik. These states supported Buddhist monasteries and maintained Silk Road caravans linking China and Transoxiana. Surviving Tarim manuscripts preserve religious canons, legal documents, and commercial records. Uyghur elites served as translators and brokers between Tang and later Chinese courts and Central Asian polities. Artistic programs at Bezeklik and other caves exhibit a Buddhist cosmopolitanism fused with Turkic court culture. Successor principalities persisted into the 13th century under Qara Khitai and Mongol hegemony."
    },
    {
        "name": "Xinjiang",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Tibet"
            }
        ],
        "upgradesFrom": [
            "Uyghur"
        ],
        "city": "Ürümqi",
        "traits": [
            "Industrious",
            "Scientific"
        ],
        "category": "Minor",
        "description": "Xinjiang became a formal Qing province in 1884 after Zuo Zongtang reconquered the region and negotiated the return of the Ili Valley from Russia. Provincial institutions extended yamen administration, taxation, and garrison towns across Tarim and Dzungaria. Early industrial-era projects surveyed ores, improved irrigation, and opened caravan routes to Russian Turkestan. In the 20th century, warlord regimes, notably under Sheng Shicai, tied the region to Soviet trade and technical aid. Rail building accelerated after mid-century, integrating Urumqi and the Tarim rim with interior China. State farms and petroleum development reshaped the northern basins. Policy encouraged large-scale migration that altered urban demographics. The province remained a frontier of resource extraction, military logistics, and multiethnic settlement within modern Chinese administration."
    },
    {
        "name": "Mitanni",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Turkey"
            }
        ],
        "city": "Washukanni",
        "traits": [
            "Diplomatic",
            "Militaristic"
        ],
        "category": "Minor",
        "description": "Mitanni was a Hurrian-speaking kingdom that dominated Upper Mesopotamia in the 16th–14th centuries BCE. Its power rested on chariot warfare, elite training, and horse management. The Kikkuli treatise, preserved by the Hittites, records Mitannian horse-training methods. Royal courts at Washukanni engaged in diplomacy with Egypt, as shown by Amarna letters and dynastic marriages. Mitanni controlled key routes across the Habur and upper Euphrates, drawing tribute from Syrian city-states. Pressure from Hittite kings and rising Assyria fractured the realm. Vassalage and partition followed campaigns by Suppiluliuma I and later Assyrian rulers. Material culture shows a Hurrian synthesis with local Semitic traditions. The kingdom transmitted chariotry, equine terminology, and courtly norms across the Late Bronze Age Near East."
    },
    {
        "name": "Armenia",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Turkey"
            }
        ],
        "upgradesFrom": [
            "Mitanni"
        ],
        "city": "Yerevan",
        "traits": [
            "Cultural",
            "Scientific"
        ],
        "category": "Minor",
        "description": "Armenia in antiquity comprised highland polities that bridged Anatolia, the Caucasus, and Iran. The Artaxiad dynasty (2nd–1st century BCE) forged a powerful kingdom under Tigranes II, who extended control from the Mediterranean to the Caspian. Hellenistic urban forms, coinage, and art mixed with Iranian court customs. Strategic corridors through the Ararat plain drew Roman, Parthian, and later Sasanian intervention. Client kingship alternated with direct occupation as empires contested the frontier. Aristocratic clans (nakharars) shaped military levies and provincial rule. Early Christianization in the early 4th century created an enduring ecclesiastical structure and script traditions that matured soon after. Fortresses, caravan routes, and royal capitals such as Artaxata and Tigranocerta anchored political life during the classical era."
    },
    {
        "name": "Colchis",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Turkey"
            }
        ],
        "city": "Kutaisi",
        "traits": [
            "Agricultural",
            "Cultural"
        ],
        "category": "Minor",
        "description": "Colchis occupied the lowlands and foothills of western Georgia along the Black Sea. Greek sources located the voyage of Jason and the Golden Fleece there, reflecting knowledge of its gold-working and sheep-based technologies. From the 7th–6th centuries BCE, Greek colonies such as Phasis established trade nodes for timber, metals, and slaves. Archaeology attests to skilled metallurgy, intricate jewelry, and local polities that negotiated with Achaemenid and later Hellenistic powers. River valleys formed corridors from the coast to the interior passes. Burial mounds and sanctuaries show a distinct ritual sphere tied to the Caucasian hinterland. In late antiquity, the region’s successor, Lazica, became a focus of Roman-Byzantine and Sasanian rivalry, preserving the coastal fort system and trade links."
    },
    {
        "name": "Georgia",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Turkey"
            }
        ],
        "upgradesFrom": [
            "Colchis"
        ],
        "city": "Tbilisi",
        "traits": [
            "Commercial",
            "Scientific"
        ],
        "category": "Minor",
        "description": "The medieval Kingdom of Georgia consolidated under the Bagrationi dynasty. David IV the Builder reformed the army, curbed aristocratic power, and won at Didgori in 1121, opening Tbilisi. Queen Tamar’s reign (1184–1213) marked a cultural apex with church building, court literature, and schools at Gelati and Ikalto. Georgian forces campaigned across the Caucasus and held Black Sea ports. Diplomacy balanced ties with Byzantium, the Seljuks, and neighboring emirates. Stone architecture and fresco programs flourished in monasteries and mountain strongholds. Mongol invasions and internal fragmentation in the 13th century ended the high medieval expansion. Yet legal traditions, scripts, and ecclesiastical networks maintained continuity across successor principalities."
    },
    {
        "name": "Kipchak",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Uzbekistan"
            }
        ],
        "city": "Sarai",
        "traits": [
            "Militaristic",
            "Agricultural"
        ],
        "category": "Minor",
        "description": "The Kipchak were a Turkic nomadic confederation that dominated the Pontic–Caspian steppe in the medieval period. Their western groups, often called Cumans, formed the Cuman–Kipchak union that controlled routes between the Volga and the Danube. Kipchak leaders fought and negotiated with Kievan Rus principalities, Byzantium, and Hungary. They served as raiders, mercenaries, and allies in shifting frontier wars. The Codex Cumanicus preserves a key record of their language. After the Mongol expansion, many Kipchak tribes were absorbed into the Golden Horde. Others entered Hungary and the Balkans as refugees or auxiliaries. Kipchak soldiers and slaves held important roles in Mamluk Egypt. Archaeology records kurgan burials, horse gear, and composite bows across the steppe. By the fourteenth century the confederation fragmented under Mongol and regional pressures, but its elites and speech endured in successor polities and in later Black Sea Turkic varieties."
    },
    {
        "name": "Kazakhstan",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Uzbekistan"
            }
        ],
        "upgradesFrom": [
            "Kipchak"
        ],
        "city": "Astana",
        "traits": [
            "Diplomatic",
            "Commercial"
        ],
        "category": "Minor",
        "description": "Kazakhstan emerged as an independent republic in December 1991 after the dissolution of the Soviet Union. Nursultan Nazarbayev led the transition under a strong presidency. The state joined the United Nations in 1992 and adopted a new constitution in 1995. The capital moved from Almaty to a planned city on the Ishim River in 1997, later known as Astana. Market reforms brought foreign investment into the Tengiz and Kashagan oil fields. A multi‑vector foreign policy balanced ties with Russia, China, Western states, and regional partners. Kazakhstan joined Eurasian integration projects while maintaining national currency and border control. Social and language policies promoted a civic nation in a multiethnic setting. Leadership changes in the 2010s produced gradual political adjustments. The republic remains a major energy exporter and a key state in Central Asian security and transport corridors."
    },
    {
        "name": "Kyrgyz",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Uzbekistan"
            }
        ],
        "city": "Osh",
        "traits": [
            "Agricultural",
            "Religious"
        ],
        "category": "Minor",
        "description": "The Kyrgyz are a Turkic people whose early polity rose along the upper Yenisei River. In 840 they overthrew the Uyghur Khaganate and formed the Yenisei Kyrgyz Khaganate. Their society relied on pastoralism, horse breeding, and clan alliances. Chinese and Islamic geographers noted their northern forests and frontier position. From the twelfth century pressures and migrations redirected Kyrgyz groups toward the Tian Shan. Under the Mongol Empire they served as auxiliaries and local leaders within imperial structures. Oral traditions, including cycles linked to Manas, preserved memories of movement, warfare, and customary law. In the early modern period Kyrgyz confederations held pastures in the Alay and Ferghana regions. They later entered the orbit of Kokand and the Russian Empire. Modern Kyrgyz identities connect Yenisei origins with Tian Shan homelands and continuous Turkic speech."
    },
    {
        "name": "Kyrgyzstan",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            },
            {
                "type": "region",
                "name": "Uzbekistan"
            }
        ],
        "upgradesFrom": [
            "Kyrgyz"
        ],
        "city": "Bishkek",
        "traits": [
            "Scientific",
            "Militaristic"
        ],
        "category": "Minor",
        "description": "Kyrgyzstan proclaimed independence in August 1991 as the Soviet Union collapsed. The capital, long known as Frunze, was renamed Bishkek the same year. The republic joined the United Nations in 1992 and adopted a constitution in 1993. Early state building created national institutions, currency, and border services. Politics remained competitive by regional standards, with recurrent power turnovers. The 2005 Tulip Revolution and the events of 2010 brought leadership change and a shift toward a stronger parliamentary system. Kyrgyzstan joined regional bodies such as the Collective Security Treaty Organization and later the Eurasian Economic Union. Remittances, hydropower, livestock, and gold mining at Kumtor form major economic pillars. The state balances clan networks, mountainous geography, and external ties with Russia, China, and neighbors. Civil society and media play visible roles in elections and policy debates."
    },
    {
        "name": "Balts",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Poland"
            }
        ],
        "city": "Kernavė",
        "traits": [
            "Agricultural",
            "Religious"
        ],
        "category": "Minor",
        "description": "The Balts were Indo‑European peoples who occupied the eastern shores of the Baltic Sea in antiquity. Groups included Curonians, Old Prussians, Latgalians, and Semigallians. Archaeology records hillforts, cremation cemeteries, and metalwork linked to regional trade. Amber routes carried Baltic goods toward the Mediterranean and appear in Roman accounts. Contacts with Germanic and Slavic neighbors produced trade, raiding, and shifting alliances along river corridors. Pagan cults persisted into the Middle Ages with sacred groves and seasonal rites. From the thirteenth century the Teutonic Order and German colonists advanced into Prussian and Latvian lands. Some communities were subdued and assimilated, while others retained autonomy and later formed parts of Lithuania and Latvia. Baltic languages preserved archaic Indo‑European features that interest modern linguistics."
    },
    {
        "name": "Lithuania",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Poland"
            }
        ],
        "upgradesFrom": [
            "Balts"
        ],
        "city": "Vilnius",
        "traits": [
            "Cultural",
            "Diplomatic"
        ],
        "category": "Minor",
        "description": "The Grand Duchy of Lithuania emerged in the thirteenth century and expanded under the Gediminid dynasty. It incorporated much of Belarus and Ukraine and at times reached the Black Sea steppe. Pagan elites adopted Latin Christianity in 1387 under Jogaila. The Union of Krewo in 1385 linked Lithuania to Poland through a dynastic arrangement. Allied armies defeated the Teutonic Order at Grunwald in 1410. Administrative consolidation produced the Lithuanian Statutes and a network of castles, towns, and courts. Under the Jagiellonian monarchs the union with Poland deepened in governance and culture. The Polish‑Lithuanian Commonwealth succeeded the Grand Duchy in 1569 as a federative state. Lithuanian nobles retained legal identity and institutions within the Commonwealth framework."
    },
    {
        "name": "Bohemia",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Poland"
            }
        ],
        "city": "Velehrad",
        "traits": [
            "Industrious",
            "Cultural"
        ],
        "category": "Minor",
        "description": "Bohemia developed from a Přemyslid duchy into a medieval kingdom in central Europe. Its rulers controlled the Elbe and Vltava basins and founded towns and monasteries. Silver mining at Kutná Hora strengthened royal revenues. In 1348 Charles IV of the Luxembourg dynasty founded Charles University in Prague and promoted major building works. The Golden Bull of 1356 confirmed the Bohemian king as an Imperial elector. Religious ferment after 1415 produced the Hussite movement. The Hussite Wars from 1419 to 1434 reshaped society and warfare through field wagons and disciplined infantry. Later Habsburg rule bound Bohemia to wider dynastic politics. Legal estates and urban communities remained active forces in the region’s history."
    },
    {
        "name": "Czechia",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Poland"
            }
        ],
        "upgradesFrom": [
            "Bohemia"
        ],
        "city": "Prague",
        "traits": [
            "Scientific",
            "Diplomatic"
        ],
        "category": "Minor",
        "description": "The Czech Republic emerged on 1 January 1993 after the peaceful dissolution of Czechoslovakia. Democratic institutions and a market economy were consolidated in the 1990s. The country joined NATO in 1999 and the European Union in 2004. Privatization and industrial restructuring integrated the economy into European supply chains. Prague developed as a center for services, culture, and tourism. Political life alternated among coalition governments under a parliamentary system. The state pursued Atlantic and European partnerships while sustaining regional cooperation in Central Europe. Scientific research and automotive production remained key sectors. The short country name Czechia gained wider international use in the 2010s."
    },
    {
        "name": "Kyiv",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Russia"
            }
        ],
        "city": "Kyiv",
        "traits": [
            "Religious",
            "Commercial"
        ],
        "category": "Minor",
        "description": "Kyiv rose as the principal center of Kievan Rus in the tenth and eleventh centuries. Its position on the Dnieper linked Baltic trade with Byzantium. Grand Prince Vladimir adopted Christianity in 988, establishing ecclesiastical structures and ties to Constantinople. Monumental works included the Golden Gate and Saint Sophia Cathedral. Chronicles and law codes took shape in the city’s courts and monasteries. Rival princely lines and steppe incursions weakened the polity in the twelfth century. The Mongol campaign of 1240 devastated Kyiv and shifted power north and northeast. The city revived under Lithuanian and later Polish‑Lithuanian rule as a regional hub. Its medieval legacy endures in chronicles, architecture, and sacred sites."
    },
    {
        "name": "Ukraine",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Russia"
            }
        ],
        "upgradesFrom": [
            "Kyiv"
        ],
        "city": "Kyiv",
        "traits": [
            "Agricultural",
            "Militaristic"
        ],
        "category": "Minor",
        "description": "Ukraine declared independence in August 1991 and confirmed it by referendum. The state joined the United Nations in 1992 and adopted a constitution in 1996 that established a semi‑presidential system. Early governments pursued reforms while managing economic contraction and privatization. Political mobilization shaped the 2004 Orange Revolution and the 2013–2014 Maidan movement. Russia’s actions in 2014 and later years reoriented security and foreign policy toward Euro‑Atlantic structures. Ukraine entered association agreements with the European Union and expanded defense cooperation with NATO members. Industrial regions, agriculture, and IT services form core sectors of the economy. The country built national institutions, armed forces, and an active civil society under conditions of conflict and reform."
    },
    {
        "name": "Finns",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Russia"
            }
        ],
        "city": "Turku",
        "traits": [
            "Cultural",
            "Scientific"
        ],
        "category": "Minor",
        "description": "In antiquity Uralic-speaking groups in southern and western Fennoscandia formed the ancestors of the modern Finns. Archaeology shows continuities from Late Bronze and Early Iron Age communities, with tarand-style burial traditions known around the Gulf of Finland and contacts to the Estonian coast. During the Roman and Migration periods, settlement intensified in southern Finland, where hillforts, cremation cemeteries, and ironworking appear. Exchange networks linked the region to Scandinavia and the eastern Baltic; furs, iron, and amber moved across the sea. By the Late Iron Age, distinct Finnic-speaking communities such as the Tavastians and Karelians are documented archaeologically and later in medieval sources. Contacts with Norse traders and raiders across the Baltic Sea are evident from imported goods and boat graves. These developments formed the cultural base for medieval Finnish polities under Swedish influence and set the stage for later Christianization and integration into northern European trade."
    },
    {
        "name": "Finland",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Russia"
            }
        ],
        "upgradesFrom": [
            "Finns"
        ],
        "city": "Helsinki",
        "traits": [
            "Industrious",
            "Diplomatic"
        ],
        "category": "Minor",
        "description": "Finland declared independence from Russia in December 1917 amid imperial collapse. A brief but violent civil war followed in 1918, resulting in a non-socialist victory and a parliamentary republic. Interwar policy sought security through the League of Nations and Nordic cooperation. Soviet invasion in 1939 triggered the Winter War; Finland fought the Continuation War alongside Germany from 1941, then the Lapland War against retreating German forces in 1944–45. The 1947–48 peace settlements fixed borders, mandated reparations, and guided a careful neutrality known as the Paasikivi–Kekkonen line, including the 1948 Treaty of Friendship with the USSR. Reparations spurred rapid industrialization. Helsinki hosted the 1952 Olympic Games. The 1975 Conference on Security and Co-operation in Europe produced the Helsinki Final Act. Postwar consensus politics stabilized the economy and welfare state. Finland deepened Western integration after the Cold War, joining the European Union in 1995."
    },
    {
        "name": "Papar",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Scotland"
            }
        ],
        "city": "Vestmannaeyjar",
        "traits": [
            "Religious",
            "Diplomatic"
        ],
        "category": "Minor",
        "description": "The Papar are Irish monastic hermits reputed to have reached Iceland before Norse settlement. Medieval Icelandic texts, notably Íslendingabók and Landnámabók, report Christian anchorites who departed when pagan settlers arrived, leaving bells, books, and croziers. Place-names such as Papey and vestiges in the Vestmannaeyjar suggest an early ecclesiastical presence, though archaeological confirmation remains limited and debated. The tradition parallels evidence of Irish clerics in the Faroes and northern isles of Scotland. If present, the Papar would mark an early phase of North Atlantic ascetic voyaging linked to Insular monasticism. Norse colonization after c. 870 brought enduring settlement, and any earlier hermitage sites were soon absorbed into a new cultural landscape. The Papar story endures in medieval narrative and local lore as testimony to the wider reach of Gaelic monastic travel across the ocean margins."
    },
    {
        "name": "Iceland",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Scotland"
            }
        ],
        "upgradesFrom": [
            "Papar"
        ],
        "city": "Reykjavik",
        "traits": [
            "Commercial",
            "Scientific"
        ],
        "category": "Minor",
        "description": "In 1918 Iceland achieved sovereignty through the Act of Union with Denmark, sharing a monarch but gaining control over domestic affairs. British forces occupied the island in 1940 to forestall German moves; American forces took over defense in 1941. A 1944 referendum ended the union, and the Republic of Iceland was proclaimed. In 1949 Iceland joined NATO, and a 1951 defense agreement maintained a U.S. presence at Keflavík. The fishing industry drove modernization, urbanization, and welfare policies. Maritime disputes with the United Kingdom, known as the Cod Wars (1958–61, 1972–73, 1975–76), extended Iceland’s fishery limits to 200 nautical miles and redefined North Atlantic fisheries management. Iceland joined EFTA in 1970 and pursued a mixed economy with strong cooperative sectors. Cultural life and science benefited from rising literacy and public investment, while the state balanced security commitments with an absence of standing armed forces."
    },
    {
        "name": "Éire",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Scotland"
            }
        ],
        "city": "Tara",
        "traits": [
            "Cultural",
            "Religious"
        ],
        "category": "Minor",
        "description": "Medieval Gaelic Ireland consisted of numerous tuatha under kings who owed shifting degrees of overlordship to provincial rulers and, at times, to a High King at Tara. Brehon law governed kinship, land, and compensation. From the sixth century, monasteries at Armagh, Clonmacnoise, and Iona fostered scholarship, mission, and manuscript production. Irish clerics such as Columba and Columbanus spread learning to Britain and the continent. Metalwork and manuscripts, including the Book of Kells, attest to highly developed craftsmanship. Viking raids began in the late eighth century, followed by settlement and the founding of towns like Dublin, Waterford, and Limerick. Norse-Gaelic polities integrated with local dynasties, while Brian Boru’s overlordship culminated in 1014 at Clontarf. The twelfth century saw church reform and the arrival of Anglo-Norman forces from 1169, which reshaped lordship and urban life while Gaelic law and culture endured in many regions."
    },
    {
        "name": "Ireland",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Scotland"
            }
        ],
        "upgradesFrom": [
            "Éire"
        ],
        "city": "Dublin",
        "traits": [
            "Agricultural",
            "Diplomatic"
        ],
        "category": "Minor",
        "description": "The Irish Free State emerged in 1922 under the Anglo-Irish Treaty, followed by a civil war between pro- and anti-Treaty forces. A new constitution in 1937 established a sovereign state named Éire with a strong executive. During the Second World War, Ireland maintained neutrality while managing security and supply pressures. The Republic of Ireland Act in 1948–49 ended the last constitutional links to the Commonwealth. Postwar decades saw emigration, protectionism, and gradual economic reform under Seán Lemass in the 1960s. Ireland joined the European Economic Community in 1973, accelerating modernization and agricultural transformation. The state engaged diplomatically with the Northern Ireland conflict from the late 1960s, contributing to cross-border institutions and the 1998 Good Friday Agreement. Social change, education expansion, and foreign investment reshaped society by century’s end. Cultural policy, language preservation, and peacekeeping overseas marked Ireland’s international profile."
    },
    {
        "name": "Jutes",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Sweden"
            }
        ],
        "city": "Jelling",
        "traits": [
            "Militaristic",
            "Commercial"
        ],
        "category": "Minor",
        "description": "The Jutes were a Germanic group associated with the Jutland peninsula who took part in fifth- and sixth-century migrations to Britain. Bede’s account places Jutish settlers in Kent, the Isle of Wight, and parts of Hampshire. Archaeology in Kent shows rich furnished burials, continental connections, and early Christianization under King Æthelberht, whose law code is the earliest written in any Germanic vernacular. Material culture indicates ties to Frisia and northern Frankish regions alongside Jutland. Over time, Jutish identity in Britain blended with neighboring Angle and Saxon groups into emergent Anglo-Saxon kingdoms. On the continent, Jutland remained a zone of shifting polities interacting with Danes and Franks. The Jutes’ role in the settlement of southeast Britain contributed to early urban and ecclesiastical foundations, including Canterbury as a center of Roman mission from 597."
    },
    {
        "name": "Denmark",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Sweden"
            }
        ],
        "upgradesFrom": [
            "Jutes"
        ],
        "city": "Copenhagen",
        "traits": [
            "Cultural",
            "Scientific"
        ],
        "category": "Minor",
        "description": "Medieval Denmark coalesced in the Viking Age. Harald Bluetooth unified the realm and introduced Christianity in the late tenth century, commemorated by the Jelling stones. Towns such as Hedeby, Ribe, and Roskilde anchored trade across the Baltic and North Sea. In the early eleventh century, Cnut the Great ruled a North Sea empire that included England and Norway. After consolidation and ecclesiastical organization, royal power expanded again under Valdemar I and Valdemar II, who led crusades against the Wends and intervened around the Baltic. Denmark contended with the Hanseatic League and regional rivals while building a network of castles, monasteries, and bishoprics. Law codes and coinage standardized royal authority. Despite reversals and noble disputes, the kingdom entered the late medieval period as a key Baltic power, laying groundwork for later unions with Norway and Sweden and continued maritime commerce."
    },
    {
        "name": "Sami",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Sweden"
            }
        ],
        "city": "Kautokeino",
        "traits": [
            "Agricultural",
            "Diplomatic"
        ],
        "category": "Minor",
        "description": "The Sami are an indigenous Uralic people of northern Fennoscandia with ancient roots in Arctic hunter-fisher lifeways. Classical and medieval sources mention northern “Finns” and “Skridfinns,” while Ohthere’s account to King Alfred describes communities engaged in hunting, fishing, and early reindeer use. Exchange with Norse and Finnic neighbors supplied iron, textiles, and grain in return for furs and marine products. Sacred landscapes, shamanic practice, and drum rituals structured spiritual life. Seasonal mobility across tundra and taiga supported dispersed settlement. Large-scale pastoral reindeer herding developed later, but its antecedents lie in earlier management of semi-domesticated herds. By the late medieval period, tribute and taxation reached Sami areas from Norse, Swedish, and Novgorod authorities. These pressures, combined with trade, connected Sami societies to broader northern markets while preserving distinct languages and cultural forms."
    },
    {
        "name": "Sapmi",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            },
            {
                "type": "region",
                "name": "Sweden"
            }
        ],
        "upgradesFrom": [
            "Sami"
        ],
        "city": "Karasjok",
        "traits": [
            "Religious",
            "Industrious"
        ],
        "category": "Minor",
        "description": "Sápmi is the transnational homeland of the Sami across northern Norway, Sweden, Finland, and Russia. In the twentieth century, policies shifted from assimilation toward recognition, driven by activism and cross-border cooperation. The Nordic Saami Council formed in 1956. Representative institutions followed: Finland’s Sami Delegation in 1973 and Sami Parliament in 1996, Norway’s Sami Parliament in 1989, and Sweden’s in 1993. Norway ratified ILO Convention 169 in 1990 and passed the Finnmark Act in 2005, expanding land and resource rights; Sweden and Finland pursued parallel, though more limited, frameworks. Language preservation, schooling, and media advanced through public support and cultural centers. The Alta dam conflict (1979–81) galvanized environmental and indigenous movements. Reindeer husbandry, coastal fishing, handicrafts, and duodji remain core practices. Cross-border legal and cultural initiatives seek to protect livelihoods, sacred sites, and languages within modern state systems."
    }
]
