[
    {
        "name": "Human",
        "category": "Human",
        "yields": [
            {
                "name": "Moves",
                "value": 3
            },
            {
                "name": "Production Cost",
                "value": 10
            }
        ],
        "actions": [
            "Move",
            "Explore"
        ],
        "description": "Human mobility preceded vehicles. In the Paleolithic, hunter-gatherers traversed continents on foot, carrying tools and children. Endurance walking and persistence hunting shaped routes and seasonal ranges. Coastal and river crossings used improvised floats, but most travel was terrestrial. By the Neolithic, villagers moved seed, pottery, and livestock between settlements, enabling exchange networks and migration. Paths became trackways. Portage skills supported early exploration of forests and steppe. Without draft animals or wheels, load limits constrained distance and speed. Yet humans colonized diverse environments from Saharan margins to highland valleys. Foot travel remained essential for scouts, envoys, and pilgrims long after vehicles appeared."
    },
    {
        "name": "Chariot",
        "category": "Mounted",
        "requires": [
            {
                "type": "technology",
                "name": "Wheel"
            },
            {
                "type": "resource",
                "name": "Horses"
            }
        ],
        "yields": [
            {
                "name": "Moves",
                "value": 4
            },
            {
                "name": "Production Cost",
                "value": 20
            },
            {
                "name": "Production Cost",
                "value": 25,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": -15,
                "type": "percent",
                "for": [
                    {
                        "type": "concept",
                        "name": "Urban"
                    }
                ]
            },
            {
                "name": "Defense",
                "value": -15,
                "type": "percent"
            }
        ],
        "specials": [
            "No defense bonuses"
        ],
        "actions": [
            "Move",
            "Explore"
        ],
        "description": "The chariot emerged in the early second millennium BCE with the spread of the light spoked wheel. Teams of horses pulled a two-wheeled car carrying a driver and archer or spearman. In the Near East and Egypt it served as a fast missile platform and a status vehicle. At Kadesh (c. 1274 BCE), Egyptian and Hittite chariot corps fought in massed formations. In China, Shang rulers used chariots for warfare and ceremony. Chariots aided royal hunts, rapid reconnaissance, and command control. Rough terrain and the rise of skilled cavalry reduced their battlefield role after the first millennium BCE. They persisted in ritual, sport, and processions."
    },
    {
        "name": "Horse",
        "category": "Mounted",
        "requires": [
            {
                "type": "technology",
                "name": "Riding"
            },
            {
                "type": "resource",
                "name": "Horses"
            }
        ],
        "yields": [
            {
                "name": "Moves",
                "value": 4
            },
            {
                "name": "Production Cost",
                "value": 45
            },
            {
                "name": "Production Cost",
                "value": 25,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": -15,
                "type": "percent",
                "for": [
                    {
                        "type": "concept",
                        "name": "Urban"
                    }
                ]
            }
        ],
        "specials": [
            "No defense bonuses"
        ],
        "actions": [
            "Move",
            "Explore"
        ],
        "description": "Mounted warfare on horses matured from steppe traditions into a dominant classical arm. Early riding followed domestication on the Eurasian steppe, but effective cavalry required improved bits, saddles, and training. Scythian riders used composite bows for mobile skirmishing. Macedon under Alexander fielded the Companion Cavalry, delivering decisive shock at Chaeronea and Gaugamela. In Iran and Mesopotamia, Parthian cataphracts combined heavy armor with disciplined maneuver, while horse archers perfected the feigned retreat and Parthian shot. Cavalry improved communications, scouting, and pursuit in imperial systems. Over time, stirrups and breeding programs expanded capability, linking horse logistics to remount depots and pasture management."
    },
    {
        "name": "Camel",
        "category": "Mounted",
        "requires": [
            {
                "type": "technology",
                "name": "Riding"
            },
            {
                "type": "resource",
                "name": "Camels"
            }
        ],
        "yields": [
            {
                "name": "Moves",
                "value": 3
            },
            {
                "name": "Production Cost",
                "value": 45
            },
            {
                "name": "Production Cost",
                "value": 25,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": -15,
                "type": "percent",
                "for": [
                    {
                        "type": "concept",
                        "name": "Urban"
                    }
                ]
            }
        ],
        "specials": [
            "No defense bonuses",
            "No Desert damage"
        ],
        "actions": [
            "Move",
            "Explore"
        ],
        "description": "The camel as a riding and pack animal transformed desert mobility. Dromedaries and Bactrians were domesticated by the early first millennium BCE and adapted to sparse forage and water scarcity. Riders could traverse arid routes with minimal resupply. In Arabia, early Islamic forces used camels for transport, screening, and rapid movement between oases. Across the Sahara, caravans linked Sahelian states to North Africa; armed riders guarded loads of salt, gold, and textiles. Camel corps served as scouts and raiders where horses failed. Specialized saddles, nose pegs, and herd management underpinned endurance. Firearms and motor transport later displaced camel cavalry, but pastoral logistics persisted."
    },
    {
        "name": "Elephant",
        "category": "Mounted",
        "requires": [
            {
                "type": "technology",
                "name": "Riding"
            },
            {
                "type": "resource",
                "name": "Elephants"
            }
        ],
        "yields": [
            {
                "name": "Moves",
                "value": 3
            },
            {
                "name": "Production Cost",
                "value": 45
            },
            {
                "name": "Production Cost",
                "value": 33,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 15,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": -30,
                "type": "percent",
                "for": [
                    {
                        "type": "concept",
                        "name": "Urban"
                    }
                ]
            }
        ],
        "specials": [
            "No defense bonuses",
            "No Jungle damage"
        ],
        "actions": [
            "Move",
            "Explore"
        ],
        "description": "War elephants carried mahouts and fighting crews on howdahs, providing shock action and heavy load capacity. Indian states developed breeding, armor, and tactics that influenced Hellenistic and Persian armies after Alexander. Elephants featured in Southeast Asian warfare, where nobles fought from their backs and units executed coordinated charges. At Panipat in 1526, Mughal forces deployed elephants amid artillery and matchlocks. Ayutthayan armies used them in set-piece battles and duels. Countermeasures included missiles, caltrops, trenches, and later concentrated musketry and cannon. Elephants excelled in intimidation and pursuit but were vulnerable to panic. By the early modern period, gunpowder reduced their tactical value."
    },
    {
        "name": "Carriage",
        "category": "Vehicle",
        "requires": [
            {
                "type": "technology",
                "name": "Sieging"
            }
        ],
        "yields": [
            {
                "name": "Moves",
                "value": 2
            },
            {
                "name": "Production Cost",
                "value": 20
            },
            {
                "name": "Defense",
                "value": -30,
                "type": "percent"
            }
        ],
        "specials": [
            "No defense bonuses",
            "Can carry stockpile"
        ],
        "actions": [
            "Move",
            "Explore"
        ],
        "description": "Carriages and wagons formed the backbone of pre-industrial logistics. Four- and two-wheeled vehicles, drawn by horses or oxen, moved siege engines, provisions, and trade goods. Roman armies organized baggage trains with standardized carts, animal teams, and road schedules on the viae. In China, the Han state employed ox-drawn carts across imperial highways and frontier corridors. Suspension and wheel design improved ride quality and load stability. Harness innovations, including the horse collar, raised draft efficiency. States regulated weights, axle widths, and waystations to protect roads. Carriage transport integrated with river barges and depots, enabling sustained campaigns and regional markets."
    },
    {
        "name": "Truck",
        "category": "Vehicle",
        "requires": [
            {
                "type": "technology",
                "name": "Combustion"
            },
            {
                "type": "resource",
                "name": "Rubber"
            },
            {
                "type": "resource",
                "name": "Oil"
            }
        ],
        "yields": [
            {
                "name": "Moves",
                "value": 4
            },
            {
                "name": "Production Cost",
                "value": 260
            },
            {
                "name": "Production Cost",
                "value": 25,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": -15,
                "type": "percent",
                "for": [
                    {
                        "type": "concept",
                        "name": "Urban"
                    }
                ]
            }
        ],
        "specials": [
            "No defense bonuses"
        ],
        "actions": [
            "Move",
            "Explore"
        ],
        "description": "The motor truck appeared in the 1890s as internal combustion engines replaced animal traction. Gottlieb Daimler’s 1896 vehicle demonstrated practical road haulage. By the early twentieth century, pneumatic tires, gearboxes, and standardized payload ratings increased reliability. Armies adopted trucks for ammunition, food, and troop movement in World War I, reshaping operational reach. Interwar fleets expanded urban and regional freight, supporting just-in-time delivery long before the term. Diesel engines, all-wheel drive, and modular bodies broadened roles from tankers to ambulances. Road networks and depots evolved around trucking. The platform remains central to civilian logistics and mechanized warfare."
    },
    {
        "name": "Tracked",
        "category": "Vehicle",
        "requires": [
            {
                "type": "technology",
                "name": "Tracked Treads"
            },
            {
                "type": "resource",
                "name": "Steel"
            },
            {
                "type": "resource",
                "name": "Oil"
            }
        ],
        "yields": [
            {
                "name": "Moves",
                "value": 4
            },
            {
                "name": "Production Cost",
                "value": 360
            },
            {
                "name": "Production Cost",
                "value": 50,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 15,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": -30,
                "type": "percent",
                "for": [
                    {
                        "type": "concept",
                        "name": "Urban"
                    }
                ]
            }
        ],
        "specials": [
            "No defense bonuses"
        ],
        "actions": [
            "Move",
            "Explore"
        ],
        "description": "Tracked armored vehicles use continuous tracks to spread weight and maintain traction on mud, snow, and broken ground. The British Mark I debuted in 1916 to cross trenches and wire while carrying armor and guns. Interwar design refined suspensions and engines, culminating in versatile World War II tanks such as the Soviet T-34. Tracked platforms combined mobility, protection, and firepower for breakthrough and exploitation. Doctrine integrated them with infantry, artillery, and aviation. Variants included assault guns, self-propelled artillery, and engineering vehicles. Postwar designs evolved into main battle tanks with advanced optics and stabilization, sustaining their role despite anti-tank threats."
    },
    {
        "name": "Raft",
        "category": "Sail Hull",
        "requires": [
            {
                "type": "technology",
                "name": "Sailing"
            }
        ],
        "yields": [
            {
                "name": "Moves",
                "value": 3
            },
            {
                "name": "Production Cost",
                "value": 10
            },
            {
                "name": "Production Cost",
                "value": 10,
                "type": "percent"
            },
            {
                "name": "Trade Range",
                "value": 10
            }
        ],
        "actions": [
            "Move",
            "Explore"
        ],
        "description": "The raft is a flat, buoyant platform made from bundled reeds, logs, or inflated skins. It served as an early solution for river and coastal transport. In Mesopotamia, reed rafts moved people and goods along the Euphrates, exploiting calm currents and shallow drafts. On the Nile, simple rafts complemented boats for local crossings and construction work. Propulsion came from poles, paddles, and small sails. The design was economical, repairable, and suitable for ferrying livestock or bulky cargo. Rafts enabled settlement, trade, and fishing before complex hulls matured. They persisted where materials were plentiful and waters predictable."
    },
    {
        "name": "Galley",
        "category": "Sail Hull",
        "requires": [
            {
                "type": "technology",
                "name": "Ship Building"
            }
        ],
        "yields": [
            {
                "name": "Moves",
                "value": 4
            },
            {
                "name": "Production Cost",
                "value": 20
            },
            {
                "name": "Production Cost",
                "value": 10,
                "type": "percent"
            },
            {
                "name": "Trade Range",
                "value": 25
            }
        ],
        "actions": [
            "Move",
            "Explore"
        ],
        "description": "The galley is a long, shallow-draft warship propelled primarily by oars, with a sail for favorable winds. Bronze Age Aegean and Mycenaean fleets used galleys for raiding, convoy escort, and island control. New Kingdom Egypt maintained sea patrols and river forces with similar hulls. Tactics focused on ramming, grappling, and boarding near coasts where oars gave precise maneuver. Hull forms and rowing arrangements later evolved into biremes and triremes, but the core concept persisted. Galleys required large crews, steady supply of water and provisions, and regular beaching for maintenance. They dominated enclosed seas until sail warships and gunpowder altered naval combat."
    },
    {
        "name": "Heavy Galley",
        "category": "Sail Hull",
        "requires": [
            {
                "type": "technology",
                "name": "Ship Engineering"
            },
            {
                "type": "resource",
                "name": "Hardwood"
            }
        ],
        "yields": [
            {
                "name": "Moves",
                "value": 3
            },
            {
                "name": "Production Cost",
                "value": 45
            },
            {
                "name": "Production Cost",
                "value": 33,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 15,
                "type": "percent"
            }
        ],
        "specials": [
            "No defense bonuses"
        ],
        "actions": [
            "Move",
            "Explore"
        ],
        "description": "The heavy galley was a reinforced oared warship of the classical Mediterranean. Builders strengthened the keel and ram, added thicker wales, and carried large complements of marines. The type excelled in ramming and boarding actions along coasts and in straits. Athenian triremes at Salamis in 480 BCE showed the tactical value of coordinated oar power, while later polyremes such as quinqueremes increased mass for shock. During the First Punic War Rome fielded heavy galleys in large numbers, experimenting with the corvus to turn sea battles into infantry fights. Bronze-sheathed rams, decking over the oar banks, and elevated fighting platforms were common. By the Hellenistic period, states built even larger flagships, yet logistics and maintenance limited sustained campaigns."
    },
    {
        "name": "Clinker",
        "category": "Sail Hull",
        "requires": [
            {
                "type": "technology",
                "name": "Clinker Hulls"
            }
        ],
        "yields": [
            {
                "name": "Moves",
                "value": 4
            },
            {
                "name": "Production Cost",
                "value": 80
            },
            {
                "name": "Production Cost",
                "value": 10,
                "type": "percent"
            },
            {
                "name": "Trade Range",
                "value": 50
            }
        ],
        "specials": [
            "Can enter Sea"
        ],
        "actions": [
            "Move",
            "Explore"
        ],
        "description": "Clinker construction joined hull planks with overlapping edges fastened by iron rivets and roves. Caulking with animal hair and tar made the laps watertight. The method produced light, flexible hulls suited to rough northern seas. Viking longships combined clinker planking with a keel and frames to achieve speed, beachability, and shallow draft. In the Baltic and North Sea, merchants adopted broader clinker-built cogs with single masts and stern rudders. Hanseatic ports standardized production and outfitting for bulk cargo and armed convoy. Clinker building shaped navigation to Iceland, Greenland, and the British Isles. The technique persisted for fishing craft well into the modern era, even after carvel methods dominated large oceanic ships."
    },
    {
        "name": "Heavy Clinker",
        "category": "Sail Hull",
        "requires": [
            {
                "type": "technology",
                "name": "Compass"
            },
            {
                "type": "resource",
                "name": "Hardwood"
            }
        ],
        "yields": [
            {
                "name": "Moves",
                "value": 3
            },
            {
                "name": "Production Cost",
                "value": 80
            },
            {
                "name": "Production Cost",
                "value": 33,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 15,
                "type": "percent"
            }
        ],
        "specials": [
            "No defense bonuses",
            "Can enter Sea"
        ],
        "actions": [
            "Move",
            "Explore"
        ],
        "description": "Heavy clinker ships increased plank thickness, frames, and internal bracing to carry more cargo and endure longer passages. Northern European hulks and large cogs served dense Baltic and North Sea trade in the late medieval and early Renaissance periods. Builders raised freeboard, expanded beam, and added fore and aft castles for defense. The sternpost rudder and improved rigging enhanced control in crowded, tidal waterways. Some North Sea ventures pushed farther into the Atlantic before carvel construction became common. Shipyards adapted semi-carvel planking at stress points while retaining clinker topsides for resilience. Heavy clinker marked the transitional phase between medieval seafaring and the oceanic sailing age, supporting staple exports such as grain, timber, salt, and wool."
    },
    {
        "name": "Carvel",
        "category": "Sail Hull",
        "requires": [
            {
                "type": "technology",
                "name": "Carvel Hulls"
            }
        ],
        "yields": [
            {
                "name": "Moves",
                "value": 5
            },
            {
                "name": "Production Cost",
                "value": 130
            },
            {
                "name": "Production Cost",
                "value": 10,
                "type": "percent"
            },
            {
                "name": "Trade Range",
                "value": 75
            }
        ],
        "specials": [
            "Can enter Sea",
            "Can enter Ocean"
        ],
        "actions": [
            "Move",
            "Explore"
        ],
        "description": "Carvel construction laid smooth, edge-joined planks over robust frames, producing fair hull forms with greater internal volume. Mediterranean yards refined the method, which spread to Atlantic powers in the age of exploration. Frame-first building allowed standardization and larger tonnage. Tight seams were caulked with oakum and pitch. Carvel hulls accepted multiple decks, heavy artillery, and complex rigs. By the seventeenth century, states built ships of the line on carvel principles for fleet warfare. East Indiamen combined merchant capacity with armament for long, armed voyages to Asia. The technique supported global routes, better hydrodynamics, and durable maintenance cycles in dockyards from Lisbon to Bombay."
    },
    {
        "name": "Heavy Carvel",
        "category": "Sail Hull",
        "requires": [
            {
                "type": "technology",
                "name": "Cartography"
            },
            {
                "type": "resource",
                "name": "Hardwood"
            }
        ],
        "yields": [
            {
                "name": "Moves",
                "value": 4
            },
            {
                "name": "Production Cost",
                "value": 130
            },
            {
                "name": "Production Cost",
                "value": 33,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 15,
                "type": "percent"
            }
        ],
        "specials": [
            "No defense bonuses",
            "Can enter Sea",
            "Can enter Ocean"
        ],
        "actions": [
            "Move",
            "Explore"
        ],
        "description": "Heavy carvel hulls were the culminating wooden structures of the early industrial age. Builders used massive frames, diagonal riders, iron knees, and copper sheathing to resist hogging and fouling on long passages. Large wooden frigates and post-Napoleonic ships of the line relied on this strength to carry powerful batteries. In commerce, clipper ships pursued speed with fine lines, tall rigs, and strong yet elastic scantlings. Yards introduced mixed construction, adding iron strapping and improved fastenings while retaining timber as the primary material. Maintenance required drydocks, reliable supply of quality oak or teak, and specialized crews. The type persisted until iron and steel hulls, screw propulsion, and armor plate rendered heavy wooden carvels obsolete in blue-water service."
    },
    {
        "name": "Steamer",
        "category": "Powered Hull",
        "requires": [
            {
                "type": "technology",
                "name": "Steam Engine"
            },
            {
                "type": "resource",
                "name": "Coal"
            }
        ],
        "yields": [
            {
                "name": "Moves",
                "value": 6
            },
            {
                "name": "Production Cost",
                "value": 180
            },
            {
                "name": "Production Cost",
                "value": 10,
                "type": "percent"
            },
            {
                "name": "Trade Range",
                "value": 100
            }
        ],
        "specials": [
            "Can enter Sea",
            "Can enter Ocean"
        ],
        "actions": [
            "Move",
            "Explore"
        ],
        "description": "Steam propulsion detached ships from wind patterns in the late eighteenth and early nineteenth centuries. Early steamers used paddle wheels driven by low-pressure engines and coal-fired boilers. Marquis de Jouffroy tested Pyroscaphe on the Saône in 1783. Robert Fulton’s Clermont demonstrated regular passenger service on the Hudson in 1807. Steam spread on rivers, canals, and coastal routes, improving schedule reliability and towage. Hulls evolved to support boilers, engines, and bunkers, while safety practice grew after boiler explosions. The later adoption of the screw propeller and higher pressure engines expanded range and efficiency. Steamers reshaped inland trade and naval logistics before iron, steel, and armored construction transformed ocean service."
    },
    {
        "name": "Heavy Steamer",
        "category": "Powered Hull",
        "requires": [
            {
                "type": "technology",
                "name": "Steel Milling"
            },
            {
                "type": "resource",
                "name": "Steel"
            },
            {
                "type": "resource",
                "name": "Coal"
            }
        ],
        "yields": [
            {
                "name": "Moves",
                "value": 5
            },
            {
                "name": "Production Cost",
                "value": 180
            },
            {
                "name": "Production Cost",
                "value": 33,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 15,
                "type": "percent"
            }
        ],
        "specials": [
            "No defense bonuses",
            "Can enter Sea",
            "Can enter Ocean"
        ],
        "actions": [
            "Move",
            "Explore"
        ],
        "description": "Heavy steamers of the industrial era used iron and then steel hulls with watertight bulkheads and powerful engines. The vast SS Great Eastern launched in 1858 demonstrated long-range capability, cable laying, and structural compartmentalization. Naval designers followed with armored ironclads such as HMS Warrior in 1860, integrating wrought-iron armor, rifled guns, and screw propulsion. Compounded and triple-expansion engines improved fuel economy, while Scotch and later water-tube boilers raised steam pressures. Heavy framing supported turrets, barbettes, and central batteries. Classification societies and load-line rules matured as ship size grew. These ships enabled reliable transoceanic schedules, global telegraph infrastructure, and modern battle fleets. By the 1890s fully steel construction and quick-firing artillery defined the new standard."
    },
    {
        "name": "Diesel Hull",
        "category": "Powered Hull",
        "requires": [
            {
                "type": "technology",
                "name": "Oil Refining"
            },
            {
                "type": "resource",
                "name": "Oil"
            }
        ],
        "yields": [
            {
                "name": "Moves",
                "value": 6
            },
            {
                "name": "Production Cost",
                "value": 260
            },
            {
                "name": "Production Cost",
                "value": 10,
                "type": "percent"
            },
            {
                "name": "Trade Range",
                "value": 125
            }
        ],
        "specials": [
            "Can enter Sea",
            "Can enter Ocean"
        ],
        "actions": [
            "Move",
            "Explore"
        ],
        "description": "Diesel propulsion replaced coal-fired steam in many roles during the twentieth century. Oil engines delivered higher thermal efficiency, simpler fueling, and reduced manning compared to stoked boilers. MV Selandia in 1912 proved the practicality of long-range diesel cargo service. Submarines and smaller combatants adopted compact diesels for surface running and battery charging, typified by Type VII U-boats in World War II. Welded steel hulls, standardized sections, and vibration control complemented the new machinery. Slow-speed two-stroke engines became dominant in merchant shipping, driving large propellers at low rpm. Diesel reliability and range supported global liner trades, tankers, trawlers, and later offshore supply vessels."
    },
    {
        "name": "Heavy Diesel",
        "category": "Powered Hull",
        "requires": [
            {
                "type": "technology",
                "name": "Hydrodynamics"
            },
            {
                "type": "resource",
                "name": "Steel"
            },
            {
                "type": "resource",
                "name": "Oil"
            }
        ],
        "yields": [
            {
                "name": "Moves",
                "value": 5
            },
            {
                "name": "Production Cost",
                "value": 260
            },
            {
                "name": "Production Cost",
                "value": 33,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 15,
                "type": "percent"
            }
        ],
        "specials": [
            "No defense bonuses",
            "Can enter Sea",
            "Can enter Ocean"
        ],
        "actions": [
            "Move",
            "Explore"
        ],
        "description": "Heavy diesel ships are very large steel vessels optimized for intercontinental freight. Designers use box-girder hull structures, double bottoms, and cellular holds for container stacks. Slow-speed two-stroke engines burn heavy fuel oil with waste heat recovery for efficiency. Emma Maersk in 2006 and the Maersk Triple-E class set benchmarks in capacity, fuel economy, and emissions controls. Hull forms maximize length and beam within canal and port constraints, with bulbous bows and optimized propellers. Automation reduces crew size while real-time monitoring manages hull stresses and cargo loads. These ships depend on deepwater terminals, cranes, and global scheduling systems. Environmental rules drive scrubbers, low-sulfur fuels, and trials of LNG or hybrid assistance."
    },
    {
        "name": "Nuclear Hull",
        "category": "Powered Hull",
        "requires": [
            {
                "type": "technology",
                "name": "Nuclear Propulsion"
            },
            {
                "type": "resource",
                "name": "Steel"
            },
            {
                "type": "resource",
                "name": "Uranium"
            }
        ],
        "yields": [
            {
                "name": "Moves",
                "value": 6
            },
            {
                "name": "Production Cost",
                "value": 360
            },
            {
                "name": "Production Cost",
                "value": 50,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": 15,
                "type": "percent"
            }
        ],
        "specials": [
            "No defense bonuses",
            "Can enter Sea",
            "Can enter Ocean"
        ],
        "actions": [
            "Move",
            "Explore"
        ],
        "description": "Nuclear-propelled surface ships couple a compact reactor to steam turbines for sustained high power and endurance. While navies and icebreakers have used nuclear propulsion since the mid twentieth century, future designs propose civilian container ships and next-generation combatants with small modular reactors. A nuclear hull allows long intervals between refueling and reduced dependence on bunkering networks. Reactor shielding, compartmentalization, and redundancy shape internal layouts and damage control. Regulatory frameworks, port access, and nonproliferation concerns remain central. Concepts emphasize passive safety, load-following capability, and integration with electric drivetrains. If deployed at scale, nuclear merchant ships could alter routing, speed profiles, and Arctic operations."
    },
    {
        "name": "Submarine",
        "category": "Submersible",
        "requires": [
            {
                "type": "technology",
                "name": "Hydrodynamics"
            },
            {
                "type": "resource",
                "name": "Oil"
            }
        ],
        "yields": [
            {
                "name": "Moves",
                "value": 4
            },
            {
                "name": "Production Cost",
                "value": 260
            },
            {
                "name": "Defense",
                "value": -15,
                "type": "percent"
            }
        ],
        "specials": [
            "Invisible before move",
            "No defense bonuses",
            "Can enter Sea",
            "Can enter Ocean"
        ],
        "actions": [
            "Move",
            "Explore"
        ],
        "description": "A submarine is an underwater naval vessel capable of submerged propulsion and extended operations. During the industrial era, inventors moved from hand-powered craft to practical machines. The French Plongeur (1863) introduced mechanical propulsion with compressed air. The Spanish Ictíneo II (1864) tested air regeneration and improved hull form. The Confederate CSS Hunley (1864) carried out the first combat sinking by a submersible. John Holland’s Holland VI (1897) set the diesel-electric pattern with internal combustion for surface running, batteries for submerged movement, and torpedoes as primary armament. By World War I, submarines served as commerce raiders and fleet scouts. Periscopes, hydrophones, and fire control advanced rapidly. Interwar designs improved endurance and hull strength. World War II mass production and snorkels extended submerged cruising and set the stage for postwar innovation."
    },
    {
        "name": "Nuclear Sub",
        "category": "Submersible",
        "requires": [
            {
                "type": "technology",
                "name": "Nuclear Propulsion"
            },
            {
                "type": "resource",
                "name": "Uranium"
            }
        ],
        "yields": [
            {
                "name": "Moves",
                "value": 5
            },
            {
                "name": "Production Cost",
                "value": 360
            },
            {
                "name": "Defense",
                "value": -15,
                "type": "percent"
            }
        ],
        "specials": [
            "Invisible before move",
            "No defense bonuses",
            "Can enter Sea",
            "Can enter Ocean",
            "Can enter Ice"
        ],
        "actions": [
            "Move",
            "Explore"
        ],
        "description": "Nuclear submarines use onboard reactors to remove endurance limits and sustain high submerged speed. USS Nautilus (1955) demonstrated global reach by transiting under Arctic ice. The Soviet November-class (1958) introduced nuclear attack boats for ocean patrols and anti-submarine warfare. HMS Dreadnought (1963) brought Britain into the nuclear era. Reactors enabled months-long deployments without snorkeling. Teardrop hulls, quieting, and advanced propulsors cut acoustic signatures. Sonar suites, wire-guided torpedoes, and towed arrays expanded detection ranges. Ballistic missile submarines provided continuous at-sea deterrence during the Cold War. Under-ice operations and global patrols became routine. Safety, shielding, and refueling cycles shaped fleet logistics. By the late twentieth century, improved reactors and cruise missiles broadened missions. Nuclear submarines remain central to sea denial, power projection, and strategic deterrence."
    },
    {
        "name": "Biplane",
        "category": "Aircraft",
        "requires": [
            {
                "type": "technology",
                "name": "Flight"
            },
            {
                "type": "resource",
                "name": "Oil"
            }
        ],
        "yields": [
            {
                "name": "Moves",
                "value": 1
            },
            {
                "name": "Range",
                "value": 5
            },
            {
                "name": "Production Cost",
                "value": 180
            },
            {
                "name": "Production Cost",
                "value": 25,
                "type": "percent"
            }
        ],
        "specials": [
            "Must be in airbase"
        ],
        "actions": [
            "Recon",
            "Rebase"
        ],
        "description": "Biplanes dominated early aviation due to structural strength from two wings and bracing. The Wright Flyer (1903) used a biplane layout with wing-warping for control. In World War I, the type matured into agile fighters and reliable reconnaissance platforms. The Sopwith Camel (1917) and Fokker D.VII (1918) showed high maneuverability and refined handling. Wood-and-fabric construction enabled rapid production and easy repair. Drag from struts and wires limited speed and ceiling. Interwar advances in metal structures and cantilever wings allowed clean monoplanes to surpass biplanes in performance. By the 1930s, biplanes shifted to training, bush flying, and aerobatics where low-speed handling was valued. Their legacy includes progress in airfoil testing, propeller integration, and engine cooling that informed later aerodynamic practice."
    },
    {
        "name": "Dirigible",
        "category": "Aircraft",
        "requires": [
            {
                "type": "technology",
                "name": "Flight"
            },
            {
                "type": "resource",
                "name": "Oil"
            }
        ],
        "yields": [
            {
                "name": "Moves",
                "value": 1
            },
            {
                "name": "Range",
                "value": 8
            },
            {
                "name": "Production Cost",
                "value": 220
            },
            {
                "name": "Production Cost",
                "value": 25,
                "type": "percent"
            },
            {
                "name": "Defense",
                "value": -50,
                "type": "percent"
            }
        ],
        "specials": [
            "Must be in airbase",
            "Can carry stockpile"
        ],
        "actions": [
            "Recon",
            "Rebase"
        ],
        "description": "Dirigibles are powered, steerable lighter-than-air craft developed for long endurance and payload. Rigid Zeppelins established large-scale operations. The LZ 127 Graf Zeppelin (1928) conducted global voyages and transatlantic service. Militaries used airships for reconnaissance, fleet scouting, and early warning. The U.S. Navy’s USS Akron (1931) explored airborne scouting concepts but crashed in 1933, driving safety changes. The Hindenburg LZ 129 (1937) disaster ended large hydrogen passenger airships. Helium was safer but scarce and costly. Non-rigid and semi-rigid types persisted in patrol, training, and advertising. Airship operations advanced meteorology, radio navigation, and mooring techniques. Modern revivals target surveillance, communications relay, and heavy-lift concepts. Weather sensitivity and infrastructure needs still constrain routine heavy logistics despite excellent loiter efficiency."
    },
    {
        "name": "Monocoque",
        "category": "Aircraft",
        "requires": [
            {
                "type": "technology",
                "name": "Aerodynamics"
            },
            {
                "type": "resource",
                "name": "Oil"
            }
        ],
        "yields": [
            {
                "name": "Moves",
                "value": 1
            },
            {
                "name": "Range",
                "value": 8
            },
            {
                "name": "Production Cost",
                "value": 260
            },
            {
                "name": "Production Cost",
                "value": 25,
                "type": "percent"
            }
        ],
        "specials": [
            "Must be in airbase",
            "Can carry stockpile"
        ],
        "actions": [
            "Recon",
            "Rebase"
        ],
        "description": "Monocoque aircraft use a load-bearing skin to carry structural stresses and reduce drag. Early pioneers sought weight savings and smoother forms. The Deperdussin Monocoque (1912) used molded shells for stiffness and low resistance. By the late 1920s, semi-monocoque designs with frames and stringers spread in metal airframes. The Lockheed Vega (1927) demonstrated robust plywood monocoque techniques. The Douglas DC-3 (1936) employed stressed-skin aluminum construction that defined airliner practice. These methods allowed higher speeds, greater payloads, and pressurization. Production required precision forming, riveting, and later bonding. Wartime output refined panel standardization and fatigue analysis. Postwar jets retained semi-monocoque fuselages with fail-safe features and corrosion control. The approach remains standard in airframes, rockets, and spacecraft requiring smooth surfaces and efficient weight distribution."
    },
    {
        "name": "Supersonic",
        "category": "Aircraft",
        "requires": [
            {
                "type": "technology",
                "name": "Supersonic Flight"
            },
            {
                "type": "resource",
                "name": "Aluminium"
            },
            {
                "type": "resource",
                "name": "Oil"
            }
        ],
        "yields": [
            {
                "name": "Moves",
                "value": 1
            },
            {
                "name": "Range",
                "value": 8
            },
            {
                "name": "Production Cost",
                "value": 360
            },
            {
                "name": "Production Cost",
                "value": 25,
                "type": "percent"
            },
            {
                "name": "Evasion",
                "value": 25,
                "type": "percent"
            }
        ],
        "specials": [
            "Must be in airbase",
            "Can carry stockpile"
        ],
        "actions": [
            "Recon",
            "Rebase"
        ],
        "description": "Supersonic flight exceeds Mach 1 and introduces shock waves, drag rise, and heating. The Bell X-1 (1947) broke the sound barrier with a rocket engine and thin wings. Cold War fighters adopted swept and delta wings, area ruling, and afterburning turbines. The MiG-21 entered mass service in the 1950s as a compact interceptor. Strategic reconnaissance advanced speed and altitude with the SR-71 Blackbird (1966). Civil supersonic transport reached service with Concorde in 1976. Operational issues included sonic booms, high fuel burn, and demanding maintenance. Heat-resistant materials, variable inlets, and stability augmentation were essential. Later programs pursued variable geometry and supercruise for efficient supersonic dash. Supersonic capability remains common in modern fighters, while routine civil use declined after Concorde’s retirement."
    },
    {
        "name": "Superagile",
        "category": "Aircraft",
        "requires": [
            {
                "type": "technology",
                "name": "Fly-by-wire"
            },
            {
                "type": "resource",
                "name": "Electronics"
            },
            {
                "type": "resource",
                "name": "Oil"
            }
        ],
        "yields": [
            {
                "name": "Moves",
                "value": 1
            },
            {
                "name": "Range",
                "value": 8
            },
            {
                "name": "Production Cost",
                "value": 500
            },
            {
                "name": "Production Cost",
                "value": 25,
                "type": "percent"
            },
            {
                "name": "Evasion",
                "value": 33,
                "type": "percent"
            }
        ],
        "specials": [
            "Must be in airbase",
            "Can carry stockpile"
        ],
        "actions": [
            "Recon",
            "Rebase"
        ],
        "description": "Superagile fighters prioritize extreme maneuverability through fly-by-wire control and high thrust-to-weight ratios. Designers adopt relaxed static stability to improve turn rate and nose pointing at high angles of attack. Planform features such as canards, leading-edge extensions, and all-moving tails sustain control authority. Thrust vectoring provides post-stall maneuvering. The Eurofighter Typhoon (2003) combines canards with digital flight control for sustained agility. The F-22 Raptor (2005) adds vectoring, supercruise, and sensor fusion. Russia’s Su-35S (2010s) showcases 3D vectoring and strong energy management. High off-boresight missiles and helmet sights exploit kinematic advantages. Structural loads, infrared signature, and fuel capacity drive careful tradeoffs. These designs dominate close-in engagements while retaining beyond-visual-range effectiveness in networked air combat."
    },
    {
        "name": "Sealth",
        "category": "Aircraft",
        "requires": [
            {
                "type": "technology",
                "name": "Stealth"
            },
            {
                "type": "resource",
                "name": "Electronics"
            },
            {
                "type": "resource",
                "name": "Oil"
            }
        ],
        "yields": [
            {
                "name": "Moves",
                "value": 1
            },
            {
                "name": "Range",
                "value": 8
            },
            {
                "name": "Production Cost",
                "value": 500
            },
            {
                "name": "Production Cost",
                "value": 33,
                "type": "percent"
            },
            {
                "name": "Evasion",
                "value": 50,
                "type": "percent"
            }
        ],
        "specials": [
            "Must be in airbase",
            "Can carry stockpile"
        ],
        "actions": [
            "Recon",
            "Rebase"
        ],
        "description": "Stealth aircraft reduce detection across radar, infrared, visual, and acoustic domains. Research in the 1970s applied electromagnetic theory, edge alignment, and faceting to lower radar returns. Radar-absorbent materials and planform shaping became standard. Internal weapon bays preserved smooth contours. The B-2 Spirit entered service with very low observables for deep penetration. The F-22 Raptor (2005) combined stealth with supercruise and advanced sensors. The F-35 Lightning II (2015) extended multirole applications. Infrared suppression, shielded inlets, and cooled exhaust cut thermal signatures. Coating maintenance and tight tolerances remained demanding. Sensor fusion and low-probability-of-intercept datalinks supported emissions control. Adversaries pursued counter-stealth using low-frequency radar and multistatic networks. Stealth remains central for first-day-of-war missions against integrated air defenses."
    },
    {
        "name": "Helicopter",
        "category": "Helicopter",
        "requires": [
            {
                "type": "technology",
                "name": "Vertical Flight"
            },
            {
                "type": "resource",
                "name": "Aluminium"
            },
            {
                "type": "resource",
                "name": "Oil"
            }
        ],
        "yields": [
            {
                "name": "Moves",
                "value": 5
            },
            {
                "name": "Production Cost",
                "value": 360
            },
            {
                "name": "Production Cost",
                "value": 25,
                "type": "percent"
            }
        ],
        "specials": [
            "Ignore move cost",
            "Can move after attack"
        ],
        "actions": [
            "Move",
            "Rebase"
        ],
        "description": "Helicopters use powered rotors for vertical takeoff, hovering, and landing in confined areas. Igor Sikorsky’s R-4 (1942) proved practical single-rotor design with tail rotor anti-torque. Postwar models expanded roles in rescue, liaison, and anti-submarine warfare. The Bell UH-1 Huey (1959) defined air mobility in Vietnam, moving troops and evacuating casualties. The Mil Mi-8 (1967) served worldwide as a versatile transport. Turboshaft engines improved power-to-weight and reliability. Advances included composite rotor blades, vibration control, and automatic flight systems for low-level operations. Attack variants added armor, cannons, and anti-tank missiles. Limitations include speed, range, and vulnerability to weather and small-arms fire. Tiltrotors and compound helicopters seek higher cruise speeds while preserving vertical-lift capability for dispersed operations."
    },
    {
        "name": "Guided Missile",
        "category": "Missile",
        "requires": [
            {
                "type": "technology",
                "name": "Guidance Systems"
            }
        ],
        "yields": [
            {
                "name": "Moves",
                "value": 1
            },
            {
                "name": "Range",
                "value": 5
            },
            {
                "name": "Production Cost",
                "value": 180
            },
            {
                "name": "Strength",
                "value": -50,
                "type": "percent"
            },
            {
                "name": "Evasion",
                "value": 25,
                "type": "percent"
            }
        ],
        "specials": [
            "Single use"
        ],
        "actions": [
            "Rebase"
        ],
        "description": "Guided missiles are self-propelled weapons steered by onboard or remote guidance to strike precise targets. Cold War development produced reliable seekers and compact electronics. The AIM-9 Sidewinder (1956) used passive infrared homing for short-range air combat. The AGM-86 Air-Launched Cruise Missile (1982) combined inertial navigation with terrain matching for strategic strike. The Tomahawk (1983) added terrain and digital scene matching, later GPS, for long-range maritime and land attack. Guidance types include infrared, radar, laser, satellite-aided, and fiber-optic links. Missions cover air-to-air, anti-ship, land-attack, and anti-armor roles. Solid and liquid propulsion support different ranges. Data links enable retargeting and cooperative tactics. Countermeasures drove advances in seeker discrimination, electronic protection, and low-altitude or sea-skimming profiles."
    },
    {
        "name": "Hypersonic Missile",
        "category": "Missile",
        "requires": [
            {
                "type": "technology",
                "name": "Hypersonic Flight"
            }
        ],
        "yields": [
            {
                "name": "Moves",
                "value": 1
            },
            {
                "name": "Range",
                "value": 7
            },
            {
                "name": "Production Cost",
                "value": 250
            },
            {
                "name": "Strength",
                "value": -50,
                "type": "percent"
            },
            {
                "name": "Evasion",
                "value": 50,
                "type": "percent"
            }
        ],
        "specials": [
            "Single use"
        ],
        "actions": [
            "Rebase"
        ],
        "description": "Hypersonic missiles travel at speeds above Mach 5 while maneuvering within the atmosphere. Two principal forms emerged: boost-glide vehicles released by rockets to skip and glide at high altitude, and air-breathing cruise missiles that use scramjets for sustained hypersonic flight. Cold War research set the groundwork, but materials, guidance, and computation in the 2000s enabled operational systems. Russia fielded Avangard in 2019 as a strategic glide vehicle mounted on ICBMs. China unveiled the DF-17 in 2019 as a regional-range glide system. Russia’s 3M22 Zircon achieved initial naval deployment in 2022 as a scramjet cruise missile. These weapons aim to compress reaction times and complicate missile defense through high speed, maneuver, and unpredictable paths. Key challenges include thermal protection, precision targeting, and communication through ionized flow. States are testing new sensors and interceptors for glide-phase defense, while the United States, China, Russia, and others continue flight testing and limited deployment."
    },
    {
        "name": "MRBM",
        "category": "Missile",
        "requires": [
            {
                "type": "technology",
                "name": "Ballistics"
            }
        ],
        "yields": [
            {
                "name": "Moves",
                "value": 1
            },
            {
                "name": "Range",
                "value": 15
            },
            {
                "name": "Production Cost",
                "value": 360
            },
            {
                "name": "Strength",
                "value": -50,
                "type": "percent"
            },
            {
                "name": "Evasion",
                "value": 75,
                "type": "percent"
            }
        ],
        "specials": [
            "Single use",
            "Must be in airbase",
            "Can carry stockpile"
        ],
        "actions": [
            "Rebase"
        ],
        "description": "Medium-range ballistic missiles (MRBMs) occupy the range tier between short-range and intercontinental systems, typically about 1,000–3,000 kilometers. Early medium and intermediate-range missiles proliferated in the 1950s–1960s as nuclear delivery systems and became central to regional deterrence. Mobility increased with road‑mobile launchers and solid propellants. The 1987 Intermediate-Range Nuclear Forces Treaty eliminated US and Soviet land-based missiles from 500 to 5,500 kilometers, but its 2019 collapse renewed global interest. Modern MRBMs often carry conventional warheads and improved guidance. Maneuverable reentry vehicles enable anti-ship and precision land-attack roles. China’s DF-21D, fielded in the 2010s, introduced an anti-ship ballistic capability. Iran’s two-stage solid-fueled Sejjil has flown since 2008 as a regional deterrent. India’s Agni‑II entered service in 2001 to provide mid-tier reach within its strategic program. MRBMs remain a central tool for states seeking rapid regional strike and theater-level deterrence."
    },
    {
        "name": "ICBM",
        "category": "Missile",
        "requires": [
            {
                "type": "technology",
                "name": "Space Flight"
            }
        ],
        "yields": [
            {
                "name": "Moves",
                "value": 1
            },
            {
                "name": "Range",
                "value": 9999
            },
            {
                "name": "Production Cost",
                "value": 500
            },
            {
                "name": "Production Cost",
                "value": 50,
                "type": "percent"
            },
            {
                "name": "Strength",
                "value": -50,
                "type": "percent"
            },
            {
                "name": "Evasion",
                "value": 90,
                "type": "percent"
            }
        ],
        "specials": [
            "Single use",
            "Must be in airbase",
            "Can carry stockpile"
        ],
        "actions": [
            "Rebase"
        ],
        "description": "Intercontinental ballistic missiles deliver warheads across continents, generally at ranges beyond 5,500 kilometers. The Soviet R-7 (1957) and the US Atlas (1959) established the class. By the 1960s–1970s, solid-fueled designs, silo basing, and multiple independently targetable reentry vehicles (MIRVs) defined the strategic arsenals. ICBMs anchor the land-based leg of nuclear triads alongside submarine- and air-delivered forces. Guidance evolved from inertial to stellar-inertial systems with improved accuracy and reliability. Arms control, including SALT, START, and New START, shaped force sizes and testing regimes. Russia’s RS-24 Yars, introduced in the 2010s, is a MIRVed solid-fuel system deployed in silos and on road-mobile launchers. China’s DF-41, publicly revealed in 2017, added a high-mobility, MIRVed deterrent. The US Minuteman III, though first deployed in 1970, received continuous upgrades into the 2000s to extend service life. Current programs focus on warhead security, command and control resilience, and penetration aids against missile defenses."
    },
    {
        "name": "Satellite",
        "category": "Satellite",
        "requires": [
            {
                "type": "technology",
                "name": "Space Flight"
            }
        ],
        "yields": [
            {
                "name": "Moves",
                "value": 1
            },
            {
                "name": "Range",
                "value": 9999
            },
            {
                "name": "Production Cost",
                "value": 500
            }
        ],
        "specials": [
            "Cannot be attacked"
        ],
        "actions": [
            "Reposition"
        ],
        "description": "An artificial satellite is a human-made object placed in Earth orbit for communication, navigation, observation, or science. The Soviet Sputnik 1 (1957) proved orbital flight and began the Space Age. Explorer 1 (1958) discovered the Van Allen radiation belts. Specialized satellites soon supported weather forecasting, reconnaissance, and global communications. The Hubble Space Telescope (1990) enabled deep-space astronomy from low Earth orbit. The GPS Block II series in the 1990s provided precise timing and navigation worldwide and became a backbone for civil and military systems. Satellites occupy low, medium, and geostationary orbits, using solar power, attitude control, and telemetry to sustain missions. Launch vehicles and global tracking networks enable deployment and operations. Miniaturization produced CubeSats and large commercial constellations. The Outer Space Treaty of 1967 framed legal use, while debris mitigation and end-of-life disposal became growing concerns."
    }
]
