[
    {
        "name": "Bronze",
        "description": "Bronze is an alloy of copper and tin that defined the Bronze Age across Eurasia and North Africa. First produced in the late 4th to early 3rd millennium BCE, it offered harder edges and greater durability than pure copper. Its spread depended on long-distance trade to secure tin, a scarce resource. Societies cast bronze into swords, spearheads, and armor, reshaping warfare and élite display. Farmers used bronze axes, sickles, and chisels, improving land clearance and craft production. Artisans employed piece-mold and lost-wax casting to create complex forms. Shang dynasty ritual vessels show high technical control and elaborate design. In later periods, bronze served musical and domestic uses, including bells and mirrors. The alloy remained a standard for sculpture and commemorative statuary into the modern era."
    },
    {
        "name": "Steel",
        "description": "Steel is an iron-carbon alloy that became central to industrial society. Early steels appeared in antiquity, including crucible and pattern-welded varieties. Modern mass production began in the 19th century with the Bessemer converter and open-hearth process, followed by basic oxygen and electric-arc methods. Steel enabled railway rails, steamship hulls, and the expansion of heavy industry. Engineers adopted steel frameworks for bridges and skyscrapers, transforming urban skylines. Machine tools and factory equipment relied on its strength and toughness. During World Wars I and II, steel underpinned armaments, armor, and logistics. Standardized grades and heat treatment allowed predictable performance in harsh conditions. By the mid-20th century, global steelmaking supported automobiles, household appliances, pipelines, and large-scale infrastructure."
    },
    {
        "name": "Electricity",
        "description": "Electricity is the flow of charge used to power devices, transmit signals, and drive machinery. Industrial use followed key 19th-century advances. The voltaic pile provided continuous current, and Faraday’s generators enabled mechanical-to-electrical conversion. Urban lighting systems appeared in the 1880s, with Edison’s DC networks and Westinghouse’s AC adoption enabling large-scale distribution. Telegraphy and telephony created real-time long-distance communication. Electric motors reorganized factory layouts and improved productivity by replacing line shafts. Streetcars and subways expanded urban transit. Electrification spread to households in the early 20th century, adding lighting and appliances to daily life. By the mid-20th century, electricity underpinned broadcasting, data processing, and modern control systems, setting the foundation for contemporary power and communications networks."
    },
    {
        "name": "Canned Food",
        "description": "Canned food preserves provisions in sealed metal containers through heat processing. The technique originated in the early 19th century with Nicolas Appert’s methods, soon adapted to tinplate containers after Peter Durand’s patent. Retort sterilization reduced spoilage and botulism risk as industrial standards improved. Military demand drove early adoption, including Napoleonic-era rations and later supplies for World Wars I and II. Navies and explorers used canned goods for long voyages and polar expeditions. In the late 19th and 20th centuries, commercial canning expanded with mechanization, refrigeration in supply chains, and global trade. Canned meats, vegetables, and condensed milk supported urban markets and emergency relief. The format enabled standardized nutrition, long shelf life, and safe transport at scale."
    },
    {
        "name": "Steel Alloy",
        "description": "Steel alloys add elements such as chromium, nickel, molybdenum, tungsten, and vanadium to tailor performance. Alloying with chromium and nickel produces stainless steel with corrosion resistance for cutlery, medical devices, and chemical plants. Tool steels with tungsten or molybdenum hold hard cutting edges and tolerate heat, supporting machining and dies. High-tensile grades serve automobiles, aircraft, and pressure vessels. Chromium-vanadium steels power springs and high-stress components. Controlled heat treatment and tempering further adjust strength and toughness. Development accelerated in the early 20th century with standardized compositions and tests. Alloy steels enabled lighter structures, longer service life, and safer operation across transport, energy, and manufacturing sectors."
    },
    {
        "name": "Electronics",
        "description": "Electronics studies and applies the control of electric signals in components and circuits. Nineteenth-century telegraphy and telephony established signal networks over wire. The 20th century began with thermionic valves: Fleming’s diode and de Forest’s triode enabled rectification and amplified radio transmission. By the 1930s and 1940s, radio, radar, and fire-control systems reshaped warfare, navigation, and weather sensing. The 1947 invention of the transistor at Bell Labs launched solid-state electronics with lower power and greater reliability. Integrated circuits, developed in 1958–59 by Jack Kilby and Robert Noyce, packed many transistors on a single chip, enabling compact, fast, and affordable computation. Microelectronics drove computers, satellites, and consumer devices. Late-century progress expanded digital communication, control systems, and the foundations of the modern information economy."
    },
    {
        "name": "Plastic",
        "description": "Plastics are synthetic or semi-synthetic polymers formed into durable or flexible shapes. Early materials included Parkesine and celluloid for combs and film. Bakelite, introduced in 1907, provided heat-resistant electrical housings and radio cases. Nylon, developed in the 1930s, supplied textiles and wartime parachutes. Mid-20th-century polymers such as PVC, polystyrene, and polyethylene scaled with petrochemical feedstocks. Injection molding and extrusion enabled rapid, repeatable production. Plastics entered piping, insulation, packaging, and consumer goods, where low weight and corrosion resistance offered cost advantages. Widespread use transformed logistics and hygiene through sealed containers and disposable items. By the late 20th century, engineering plastics supported automotive parts, electronics housings, and medical devices."
    }
]