[
    {
        "name": "Maize",
        "description": "Maize is a New World cereal domesticated from teosinte in Mesoamerica by the early Holocene. Farmers selected larger cobs and soft kernels, enabling diverse cookery and storage. Nixtamalization with alkali improved nutrition and dough quality. The crop anchored milpa systems with beans and squash, fixing nitrogen and stabilizing yields. Maya and Aztec polities relied on maize tribute and labor rations. Tortillas, tamales, and atole structured daily meals and festivals. Granaries and field rotation sustained high population densities. After 1492, maize spread to Europe, Africa, and Asia through imperial and merchant networks. It supported peasant subsistence in the Mediterranean, the Balkans, and southern China. Hybridization and altitude-tolerant landraces allowed cultivation from lowland tropics to Andean highlands, making maize a global staple.",
        "category": "Grain",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Farm"
        ]
    },
    {
        "name": "Quinoa",
        "description": "Quinoa is an Andean pseudocereal domesticated in the highlands around Lake Titicaca. It thrives on cold nights, saline soils, and steep terraces. Pre-Inca and Inca farmers bred diverse colors and grain sizes for food and ritual. State storehouses stocked quinoa to provision armies and buffer famine. Husks contain saponins that deter pests; washing prepared the grain for porridge, stews, and flatbreads. Cultivation integrated with camelid herding and frost-avoidance planting calendars. Spanish colonial rule reduced its prestige in some regions, but it persisted in indigenous agriculture. Modern research resumed in the twentieth century, expanding acreage in Bolivia, Peru, and beyond. Quinoa's protein profile and adaptability made it a strategic crop for high-altitude communities across pre-Columbian and contemporary Andes.",
        "category": "Grain",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Farm"
        ]
    },
    {
        "name": "Rye",
        "description": "Rye is a Eurasian cereal that became a staple by adaptation to cold climates and poor soils. It likely entered cultivation as a weed in wheat and barley fields, then was selected during the Iron Age. By the medieval period it dominated northern and eastern European bread grain. Open-field rotations and fallow supported reliable yields on sandy or acidic land. Dense rye breads sustained rural households and urban workers; malted rye fed regional distilling traditions, including vodkas and akvavit. The crop also served as winter fodder and green manure. Vulnerability to ergot fungus caused periodic poisonings and social distress. Nineteenth-century plant breeding and improved milling diversified rye products, but its historic core remained hardy subsistence in marginal zones.",
        "category": "Grain",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Farm"
        ]
    },
    {
        "name": "Wheat",
        "description": "Wheat is among the earliest domesticated cereals from the Fertile Crescent, with emmer and einkorn cultivated by 9000-8000 BCE. Selection produced free-threshing bread wheat, expanding acreage from the Levant to the Nile and Aegean. Irrigation, plows, and sickles increased surplus, feeding cities and temples in Mesopotamia and dynastic Egypt. Bread and beer formed ration systems for workers and soldiers. As empires expanded, wheat moved along Mediterranean and Silk Road routes, becoming central to Roman annona distributions and later Islamic agronomy. Medieval open fields, three-course rotations, and mills stabilized production. Early modern globalization spread wheat to the Americas and Australia. Industrial milling and rail transport created mass urban bread markets, cementing wheat as a global staple grain.",
        "category": "Grain",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Farm"
        ]
    },
    {
        "name": "Durum",
        "description": "Durum wheat is a hard, tetraploid form derived from ancient emmer and adapted to arid Mediterranean climates. Its glassy endosperm mills into coarse semolina suited to pasta, couscous, and traditional flatbreads. Roman and later Byzantine and Islamic farmers expanded durum across North Africa, Sicily, and the Levant through irrigation and dryland techniques. Coastal trade linked Saharan oases, Maghrebi ports, and Italian cities, moving grain and milled semolina. From the nineteenth century, durum cultivation spread to the Canadian Prairies and U.S. Plains, supplying industrial pasta factories. Regional cuisines preserved diverse shapes and methods, from Italian durum pastas to Berber couscous. Quality standards for protein and yellow pigment guided breeding programs that stabilized yield and texture.",
        "category": "Grain",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Farm"
        ]
    },
    {
        "name": "Millet",
        "description": "Millet denotes several small-seeded cereals domesticated across Africa and Asia. Pearl millet anchored Sahelian agriculture with short seasons and deep roots. Foxtail and proso millet formed early staples in North China, including the Yangshao culture. These crops mature quickly, resist drought, and tolerate poor soils, making them valuable in risk-prone ecologies. Medieval West African states, including Mali and Songhai, taxed and stored millet to feed courts, armies, and caravans. Fermented millet beers and thick porridges structured communal meals and rituals. Intercropping with legumes and sorghum stabilized yields. Under colonial rule, cash crops displaced millet in some regions, yet it remained crucial in drylands. Modern breeding and extension programs continue to support millet cultivation among smallholders.",
        "category": "Grain",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Farm"
        ]
    },
    {
        "name": "Barley",
        "description": "Barley was among the first Near Eastern domesticates and spread widely due to tolerance of salinity and short seasons. Early farmers in Mesopotamia and the Levant raised two-row and six-row types. Cuneiform records detail rations of barley bread and beer to workers, priests, and soldiers. Egyptian breweries scaled production for royal and temple economies. In classical and medieval Europe, barley fed the rural poor, supplied animal fodder, and supported monastic brewing. Malting techniques evolved with kiln technology to control flavor and stability. Barley's hardiness allowed cultivation at higher latitudes and altitudes than wheat. Modern varieties underpin brewing and distilling industries, yet the grain retains a long history as a versatile staple and feed.",
        "category": "Grain",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Farm"
        ]
    },
    {
        "name": "Buckwheat",
        "description": "Buckwheat is a pseudocereal of the genus Fagopyrum, likely domesticated in the Himalayan fringe and southwest China. It grows rapidly on acidic, nutrient-poor soils and requires a short frost-free period. Medieval Europe adopted buckwheat for pancakes, porridges, and fasting dishes, with regional traditions in Brittany and the Low Countries. Across Siberia and Mongolia it helped bridge long winters with groats and noodles. East Asia developed refined uses, notably Japanese soba and northern Chinese lamian and congees. The plant also supports beekeeping through abundant nectar. Because it is not a grass, its gluten-free flour behaves differently in milling and baking. Buckwheat persisted where risk, altitude, or poverty constrained wheat, offering a reliable fallback crop.",
        "category": "Grain",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Farm"
        ]
    },
    {
        "name": "Rice",
        "description": "Rice is a wetland cereal domesticated in the Yangtze basin, later diverging into japonica and indica lineages. Irrigated paddy systems with bunds, canals, and transplanting raised yields and supported dense settlements. Terracing spread across uplands of China, Southeast Asia, and the Himalayas. Rice underpinned court economies and tax regimes in early China and India. Fermented beverages and rice cakes formed ritual and seasonal foods. Adoption of fast-maturing Champa rice in Song China expanded double-cropping and population. Maritime and overland trade diffused techniques through Vietnam, Java, and Bengal. Skilled labor, water control, and communal calendars synchronized planting and harvest. Rice agriculture shaped villages, cuisine, and state capacity across monsoon Asia, persisting into modern mechanized cultivation.",
        "category": "Grain",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Farm"
        ]
    },
    {
        "name": "Taro",
        "description": "Taro is a starchy aroid cultivated for corms and leaves in tropical and subtropical zones. Likely domesticated in Island Southeast Asia and New Guinea, it traveled with Austronesian voyagers across the Pacific. In Polynesia and Melanesia it formed a primary staple, organized in irrigated patches and dry gardens. Hawaiians developed loi systems that integrated water flow, fish, and soil renewal. Cooked and pounded taro produced poi for daily meals and ceremonies. Corms stored well for feasts and voyages. Taro also entered South and Southeast Asian cuisines as stews and fritters. Its cultural status shaped land tenure and ritual in many islands, while resilience and clonal propagation supported settlement of remote archipelagos.",
        "category": "Grain",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Farm"
        ]
    },
    {
        "name": "Kidney Beans",
        "description": "Kidney beans are cultivars of the common bean (Phaseolus vulgaris), domesticated independently in Mesoamerica and the Andes. Pre-Columbian farmers integrated them with maize and squash in polyculture fields. Dried beans supplied portable protein for Andean and Mesoamerican societies. After the Columbian Exchange, common beans spread to Europe, Africa, and South Asia. They entered regional cuisines such as Portuguese feijoada, Caribbean rice-and-beans, and Indian rajma. Agronomists valued the crop for nitrogen fixation and resilience in rotation systems. Maritime stores used dried beans as durable rations. Modern plant breeding differentiated red, white, and mottled market types. Insufficiently cooked red kidney beans can cause illness from phytohaemagglutinin, a fact noted in modern food safety. The crop remains a major staple in Latin America and East Africa.",
        "category": "Bean\/Nut",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Peanuts",
        "description": "Peanuts (Arachis hypogaea) were domesticated in South America, with early remains from Peru and Bolivia. The plant’s geocarpy made it distinct among New World crops. Spanish and Portuguese traders carried peanuts to Africa and Asia in the sixteenth century. West African farmers adopted them as a food and oil crop suited to sandy soils. By the eighteenth and nineteenth centuries the peanut was a regional cash crop in Senegambia and northern Nigeria. In the United States South, reformers promoted peanuts for soil restoration and as a market commodity. Peanut oil entered industrial uses and cooking, including wartime supplies. The crop became embedded in Chinese and Indian street foods and sweets. Modern cultivars support global snack, confectionery, and edible oil industries, while maintaining roles in smallholder rotations.",
        "category": "Bean\/Nut",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Pine Nuts",
        "description": "Historically, pine nuts are edible seeds from several pines, notably Pinus pinea in the Mediterranean, P. koraiensis in Northeast Asia, and pinyon pines in the Great Basin. Foragers and pastoralists gathered cones, then cured and shelled the kernels for storage. Classical Mediterranean cuisines used pine kernels in sauces and pastries. Roman sources mention their consumption with honey and wine. In the medieval Ligurian region they entered pesto-like preparations. East Asian trade moved Korean pine nuts across Manchuria and into Chinese markets. Indigenous peoples of the Great Basin relied on pinyon harvests as a key seasonal food and trade item. The product’s high oil content made it valuable in exchange networks from Iberia to Central Asia. Modern demand continues to link forest zones to urban markets.",
        "category": "Bean\/Nut",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Fava Beans",
        "description": "Fava beans (Vicia faba), also called broad beans, were among the earliest Old World legumes. They were cultivated across the Levant, Egypt, Greece, and Rome. Archaeological finds and classical texts attest to their use as staple food and animal fodder. In the Mediterranean they supplied winter protein and were dried for storage and transport. Egyptian ful medames is a long-standing preparation. Medieval European farmers sowed broad beans as a food crop and as green manure to enrich soils. The bean appears in religious calendars as a Lenten dish. In some populations ingestion triggers favism due to G6PD deficiency, a trait documented around the Mediterranean. Early modern expansion carried the crop to the Atlantic world. It remains a significant ingredient in stews, spreads, and seasonal festivities.",
        "category": "Bean\/Nut",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Olives",
        "description": "The olive (Olea europaea) was domesticated in the Eastern Mediterranean by the Bronze Age. Cultivation spread with Phoenician, Greek, and Roman colonization. Olive oil served in cooking, lighting, cosmetics, and medicine. Amphorae from Baetica and North Africa supplied imperial Rome, as seen at Monte Testaccio. Estates and terraces shaped landscapes in Attica, Campania, and Andalusia. Laws protected groves and regulated pressing and trade. Press technology advanced from lever presses to screw presses in antiquity. In the Islamic Mediterranean, irrigation and grafting sustained production and extended varieties. Early modern commerce exported soap-grade oils from the Levant and Iberia. Table olives developed through curing methods that reduced bitterness. The tree’s longevity anchored family holdings and regional economies across millennia.",
        "category": "Bean\/Nut",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Kola Nut",
        "description": "Kola nuts are caffeine-rich seeds from Cola species native to West Africa. They circulated in forest–savanna trade long before European contact. Chiefs and traders used kola in diplomacy, oath taking, and hospitality. Caravans moved dried nuts north across the Sahel to Hausa and Tuareg markets. The crop adapted well to humid forest zones of present-day Ghana, Nigeria, and Sierra Leone. Under colonial rule, kola production intensified to meet regional demand. In the late nineteenth century, European and American pharmacists used kola extracts in patent medicines and early cola drinks. Urban consumption in West Africa remained high, creating steady cash income for smallholders and brokers. Today kola persists as a stimulant and ritual item while synthetic flavorings replaced many medicinal uses.",
        "category": "Bean\/Nut",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Lentils",
        "description": "Lentils (Lens culinaris) were domesticated in the Fertile Crescent by early agricultural communities. They appear in Neolithic layers alongside wheat and barley. Ancient Egypt and Mesopotamia prepared lentils as stews and porridges. Biblical tradition records a lentil dish in the story of Esau and Jacob. The crop spread across the Mediterranean and into South Asia, where it formed the basis of dal preparations. Lentils store well and cook quickly, making them reliable rations for armies and caravans. Medieval farmers used them in rotations to improve soil fertility. Trade moved lentils through Levantine ports to Aegean and Italian markets. Modern breeding produced red, brown, and green varieties suited to mechanized harvest. The grain remains a key protein source for arid and temperate zones.",
        "category": "Bean\/Nut",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Almonds",
        "description": "Almonds (Prunus dulcis) derive from wild bitter relatives domesticated in the Near East. Selection for sweet kernels enabled widespread consumption. By the first millennium BCE they were cultivated around the Mediterranean. Phoenician and Greek merchants distributed planting stock and kernels through maritime trade. Roman kitchens used almonds in sauces, pastries, and wines. In late antiquity and the medieval Islamic world, almond oil and confections circulated in urban markets. Marzipan emerged from Arabic and Iberian traditions and spread into European courts. Monastic and civic gardens kept trees for festive foods and medicinal preparations. Early modern trade linked Levantine and Italian supplies to Northern Europe. Nineteenth-century transplants established commercial orchards in California, which later dominated global exports.",
        "category": "Bean\/Nut",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Soy Beans",
        "description": "Soya bean (Glycine max) agriculture began in northern China by the late Neolithic. Farmers valued the plant for seed protein and for nitrogen fixation in rotations with millet, wheat, and rice. Han and later dynasties documented tofu, soy milk, and fermented pastes. Techniques diverged regionally into Chinese jiang, Japanese miso and shoyu, and Korean doenjang and ganjang. By the seventeenth century the crop spread to Japan and Korea at scale. Western awareness grew after eighteenth-century botanic exchanges. Industrial crushing in the twentieth century made soybean oil and meal central to global food and feed. The crop moved into Brazil and the United States Midwest through breeding for temperate day lengths. Soya remains a cornerstone of East Asian cuisines and world protein supply.",
        "category": "Bean\/Nut",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Coconuts",
        "description": "The coconut palm (Cocos nucifera) spread across tropical shorelines through human voyaging and ocean drift. Austronesian sailors carried it across Island Southeast Asia and into the Pacific. The fruit supplied water, starch-rich flesh, and cooking oil. Fibrous husk provided coir for rope and mats, which entered regional trade. On atolls and volcanic islands the palm underpinned settlement and exchange systems. South Asian and Southeast Asian cuisines use coconut milk and grated kernel in curries and sweets. From the nineteenth century, colonial plantations processed copra for export oil and soap. Maritime routes from the Philippines, Ceylon, and the South Pacific supplied global markets. The palm’s wood and fronds also served in house building and boat repairs in coastal communities.",
        "category": "Bean\/Nut",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Pumpkin",
        "description": "Pumpkin (Cucurbita pepo and related species) is a New World squash domesticated by Indigenous peoples of North America and Mesoamerica. Grown with maize and beans in intercropped “Three Sisters” fields, it supplied carbohydrates, oil-rich seeds, and durable shells for storage vessels. Archaeology records use by communities such as the Mississippian and Northeast tribes. European colonists quickly adopted pumpkins for porridge, pies, and livestock feed, noting their hardiness and storability. By the eighteenth century, pumpkin recipes circulated in Anglo-American cookery. Irish immigrants adapted Old World Samhain turnip-carving customs to the larger New World pumpkin, producing the modern jack-o’-lantern in nineteenth-century North America. Today pumpkins remain tied to autumn harvest festivals and are cultivated globally for food, fodder, and seed oil.",
        "category": "Vegetable",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Farm"
        ]
    },
    {
        "name": "Potato",
        "description": "Potato (Solanum tuberosum) was domesticated in the Andes, especially around Lake Titicaca, from wild tuber-bearing nightshades. Andean farmers bred thousands of varieties suited to elevations and frost, and developed preservation methods such as chuño. Spanish conquest brought the tuber to Europe in the sixteenth century. Adoption as a staple accelerated in the eighteenth century in Ireland, Prussia, and Russia, where high yields supported population growth. Vulnerability to blight and genetic uniformity produced catastrophe in the Irish Potato Famine of 1845–1849, driving mass mortality and emigration. In the nineteenth and twentieth centuries the crop spread across Asia and Africa, became a key wartime staple, and entered industrial processing. Modern breeding programs manage disease resistance and storage while preserving native Andean diversity.",
        "category": "Vegetable",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Farm"
        ]
    },
    {
        "name": "Turnip",
        "description": "Turnip (Brassica rapa subsp. rapa) is a cool-season root long cultivated in Europe and the Mediterranean. Classical authors described its culture and fodder value. In medieval and early modern Europe it served as a common boiled or mashed vegetable and as winter livestock feed. The eighteenth-century Norfolk four-course rotation used turnips to restore soil fertility and support overwintering animals, enabling higher grain yields and manure supply. Pickling and storage in clamps extended availability through winter. Turnips fed both armies and urban poor during shortages, and retained importance in northern kitchens even after the rise of the potato. Distinct from the later rutabaga, the turnip remained a flexible crop for mixed farming systems across Britain, France, and Scandinavia.",
        "category": "Vegetable",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Farm"
        ]
    },
    {
        "name": "Cabbage",
        "description": "Cabbage (Brassica oleracea var. capitata) forms dense heads suited to storage and transport. It was established in Europe by classical antiquity and spread through medieval gardens and field plots. Fermented as sauerkraut, it supplied vitamins to Central and Eastern European diets and to maritime crews; eighteenth-century naval provisioning used sauerkraut to combat scurvy. In Eastern Europe and the Balkans, cabbage leaves were blanched and filled for stuffed dishes that kept well in winter. Market gardeners near cities grew multiple heading types for successive harvests. Cabbage also entered East Asian cuisines through related domesticated brassicas, though pak choi and napa are distinct forms. The plant’s cold tolerance and responsiveness to manure made it central to intensive agriculture and winter nutrition.",
        "category": "Vegetable",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Farm"
        ]
    },
    {
        "name": "Chickpeas",
        "description": "Chickpeas (Cicer arietinum) were domesticated in the northern Levant around the early Holocene and entered Bronze Age field systems alongside wheat and barley. Their protein content and drought tolerance suited Mediterranean dry-farming. Classical Greek and Roman sources note boiled and roasted preparations. In the Islamic and later Ottoman worlds, chickpeas circulated widely in trade and cookery. They became staples of Levantine foods such as hummus and falafel, and spread east to South Asia as chana, used whole or split in curries and flours. Iberian cultivation under Muslim rule established the Spanish “garbanzo,” later carried to the Americas. Modern breeding distinguishes desi and kabuli types, reflecting regional preferences and adaptation to varied climates.",
        "category": "Vegetable",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Farm"
        ]
    },
    {
        "name": "Okra",
        "description": "Okra (Abelmoschus esculentus) likely originated in the Sudano-Sahelian zone and moved along Nile and Saharan corridors by antiquity. Its mucilaginous pods thicken stews and sauces and can be dried and ground for later use. West African cuisines integrated okra into soups and palm oil dishes, where it provided texture and nutrients. The crop reached the eastern Mediterranean and South Asia through Islamic-era trade and took root in Mughal and regional Indian cookery as bhindi. Enslaved Africans carried seeds and knowledge to the Americas, where okra became central to Creole and Cajun gumbo and to Lowcountry kitchens. It grows well in hot climates and small plots, making it a resilient subsistence and market vegetable from the Sahel to the Mississippi Delta.",
        "category": "Vegetable",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Farm"
        ]
    },
    {
        "name": "Onions",
        "description": "Onion (Allium cepa) is a bulb crop with ancient cultivation in the Near East and Egypt. Tomb art and texts record its use in rations and ritual offerings. The plant’s storability and strong flavor made it a cornerstone of Levantine and Mediterranean cookery. Greek and Roman authors described medicinal and culinary uses. In medieval Europe, onions were a primary market-garden crop, traded dried, braided, or pickled. They formed the aromatic base for soups, pottages, and sauces across Europe, North Africa, and the Middle East. Early modern apothecaries attributed antiseptic and diuretic properties to onion preparations. Globalized cuisines kept onions as a foundation ingredient, while improved cultivars and curing methods extended shelf life and long-distance trade.",
        "category": "Vegetable",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Farm"
        ]
    },
    {
        "name": "Parsnip",
        "description": "Parsnip (Pastinaca sativa) is a hardy root native to Eurasia and established as a food plant by Roman times. In medieval and early modern Europe it was roasted, boiled, or mashed, and used to sweeten dishes before widespread cane sugar imports. The crop tolerates frost and improves in flavor after cold weather, making it a reliable winter staple for northern peasants and monastic communities. It entered pottages and meatless fast-day fare, and served as animal feed when necessary. From the eighteenth century the potato displaced parsnip in many regions, though it remained common in parts of Britain, Ireland, Scandinavia, and Russia. Rural households stored roots in clamps or cellars, sustaining diets during lean months.",
        "category": "Vegetable",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Farm"
        ]
    },
    {
        "name": "Pak Choy",
        "description": "Pak choy (Brassica rapa subsp. chinensis) is a non-heading Chinese cabbage grown for crisp petioles and tender leaves. Song and Ming sources document its cultivation in kitchen gardens and commercial plots, prized for quick maturity and year-round planting in milder regions. It entered soups, stir-fries, and noodle dishes, and appeared in temple and medicinal diets for its digestibility. Urban markets in the Yangtze Delta and Pearl River Delta traded multiple sizes and cultivars for daily cooking. Migrant networks carried pak choy to Southeast Asia and the Pacific in the nineteenth century, where it adapted to tropical highlands. Modern seed selection has produced dwarf and bolt-resistant types, maintaining the vegetable’s role in East Asian cuisines.",
        "category": "Vegetable",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Farm"
        ]
    },
    {
        "name": "Breadfruit",
        "description": "Breadfruit (Artocarpus altilis) is a clonally propagated tree crop central to Polynesian and Melanesian agroforestry. Its starchy fruits are roasted, baked, or boiled as staple fare, and can be fermented into storage pastes in pits for lean seasons. Austronesian voyagers transported cultivars among islands, enabling settlement across the Pacific. European interest peaked in the late eighteenth century, when the British sought breadfruit as a cheap food for Caribbean plantations; the HMS Bounty mission under William Bligh is the most famous episode. Plantings took hold in Jamaica and elsewhere, though acceptance varied. In the Pacific, breadfruit remained integrated with coconut, taro, and banana in multistory gardens that buffered storms and ensured food security.",
        "category": "Vegetable",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Farm"
        ]
    },
    {
        "name": "Bison",
        "description": "The American bison sustained Plains societies for millennia. Plains peoples organized communal hunts, including buffalo jumps, to secure meat, marrow, hides, sinew, and bone. Dried meat and fat became pemmican, a durable trade food. Hides supplied robes, lodges, and shields; sinew served as cordage. Seasonal migrations shaped camp movements and diplomacy. In the nineteenth century herds were devastated by commercial hide hunters, railroad expansion, and deliberate U.S. military policy to break Indigenous economies. Tens of millions fell to a few hundred surviving animals in the 1880s. Frontier journals and shipping records document the trade. Remnant herds persisted in Yellowstone and private ranches, enabling twentieth-century conservation. Sites such as Head-Smashed-In Buffalo Jump illustrate precontact hunting systems and the animal’s central place in Plains subsistence.",
        "category": "Cattle\/Game",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Camp"
        ]
    },
    {
        "name": "Guinea Pigs",
        "description": "Cuy, the domesticated guinea pig, emerged in Andean households by the pre-Columbian era. Families kept animals indoors, feeding them kitchen scraps and harvesting them for meat on a household schedule. Archaeology and Spanish chronicles record their role in diet and ritual. Offerings of cuy accompanied petitions to mountain deities and ancestor shrines. The animal provided compact, reliable protein at high altitudes where larger livestock were scarce. After the Spanish conquest, husbandry continued with minimal change, and regional cuisines developed distinctive preparations, including spit-roasted dishes for festivals. Healers also used cuy in diagnostic rites. In the twentieth century selective breeding spread the species to laboratories and pet markets, yet in Peru, Ecuador, and Bolivia it remains an everyday food animal linked to home production and local exchange.",
        "category": "Cattle\/Game",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Pasture"
        ]
    },
    {
        "name": "Deer",
        "description": "Deer supplied meat, hides, and antler across the boreal forests of Eurasia and North America. Taiga hunters, including Evenki, Khanty, and many Siberian groups, pursued elk (moose) and red deer along river corridors and winter trails. Venison supported household subsistence, while rawhide and sinew furnished lashing and cordage. Antlers provided points, wedges, and crafts. Medieval and early modern communities balanced seasonal hunts with fishing and trapping. Firearms, fur-trade demands, and state tribute increased hunting pressure from the seventeenth century. Regulation and game reserves appeared unevenly under Russian and imperial administrations. Diaries, tax registers, and trading posts record the traffic in deer products. Despite regional decline during expansion eras, deer remained integral to taiga economies, winter clothing, and mobile lifeways well into the nineteenth century.",
        "category": "Cattle\/Game",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Camp"
        ]
    },
    {
        "name": "Cows",
        "description": "Cattle underpinned European mixed farming from antiquity through the early modern period. Oxen pulled ploughs and carts, extending arable acreage and transport. Cows supplied milk for butter and cheese, essential to rural diets and trade. Manure fertilized fields within open-field and later enclosed systems. Herds functioned as movable wealth, dowry, and tax assessment. Medieval manors counted cattle among their chief assets; monastic estates specialized in dairying. In the Low Countries intensive pasture and drainage fostered a notable dairy sector. Selective breeding in Britain during the eighteenth and nineteenth centuries improved yields and carcass quality. Cattle disease outbreaks, from rinderpest to pleuropneumonia, spurred veterinary measures and state quarantine. Tithes, fairs, and droving routes attest to the animal’s central role in agrarian economies.",
        "category": "Cattle\/Game",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Pasture"
        ]
    },
    {
        "name": "Pigs",
        "description": "Domestic pigs thrived in Mediterranean agroecosystems due to flexible feeding and rapid growth. Households kept swine on kitchen refuse, orchard windfall, and acorns during seasonal pannage. Roman sources note pork as a staple in urban and rural diets, with specialized herds and processing for hams and sausages. Archaeology traces early domestication and breeding in Neolithic and classical settlements around the basin. In medieval towns pigs scavenged in streets and yards, while estates integrated them into mixed husbandry alongside vineyards and olives. Regulations periodically restricted urban rooting to protect crops and sanitation. Trade in salted pork and lard supplied ships and armies. Despite religious prohibitions in parts of the region, pig husbandry endured as a resilient, low-input component of Mediterranean food systems.",
        "category": "Cattle\/Game",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Pasture"
        ]
    },
    {
        "name": "Kudu",
        "description": "The greater and lesser kudu inhabit African savanna and woodland. For millennia San and Khoikhoi hunters pursued kudu for meat and durable hides. Sinews and bones entered toolkits. The animal’s long, spiraled horns were fashioned into trumpets and ritual objects across several cultures. Oral histories and rock art document its importance in southern African subsistence. In the eighteenth and nineteenth centuries colonial expansion and market hunting added pressure, and kudu entered the repertoire of big-game safaris. Game laws and reserves later altered access and use. Modern conservation areas maintain populations while controlled hunting and meat production continue in some regions. Museum collections, travel narratives, and ethnographic records preserve evidence of kudu hunting techniques, material uses, and ceremonial applications.",
        "category": "Cattle\/Game",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Camp"
        ]
    },
    {
        "name": "Goats",
        "description": "Goats were among the first domesticated ungulates in the Near East. Neolithic sites such as Ganj Dareh and Çayönü show managed herds supplying meat, milk, hides, and bone. Their browsing ability suited arid hills and scrub, enabling pastoral expansion into marginal lands. In the Levant and Mediterranean, goats contributed milk for fresh cheeses and played roles in sacrificial rites. Transhumant and nomadic systems moved flocks between seasonal pastures, integrating with cereal agriculture and trade. Fibers from specialized breeds, including cashmere and mohair, entered textile markets. Colonial and early modern reports note both utility and landscape impacts from overgrazing. Across West Asia, North Africa, and southern Europe, goats provided dependable household subsistence and exchange value from prehistory through the modern era.",
        "category": "Cattle\/Game",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Pasture"
        ]
    },
    {
        "name": "Yak",
        "description": "The yak supported high-altitude societies of the Tibetan Plateau and Himalaya. Domesticated millennia ago, it supplied pack and draught power on passes and fields unsuited to other bovines. Milk, butter, and meat anchored diets where barley dominated cultivation. Hair and wool became ropes, tents, and coarse textiles; hides served as durable covers. Crossbreeds with cattle, known as dzo or dzomo, increased traction and milk yields at lower elevations. Caravans of salt, tea, and wool relied on yak transport across trans-Himalayan routes. Monastic estates and village commons regulated pastures and breeding. Travelogues and trade records from the seventeenth to nineteenth centuries describe seasonal migrations and fairs. The animal remains central to highland economies despite modern roads and mechanized transport.",
        "category": "Cattle\/Game",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Pasture"
        ]
    },
    {
        "name": "Water Buffalo",
        "description": "Water buffalo were domesticated in South and Southeast Asia and adapted to wet, heavy soils. As draught animals they powered paddy ploughing and transported loads in flooded landscapes. Their wallowing behavior aided thermoregulation in tropical climates. River and swamp types supported different agro-ecologies. Milk entered regional diets as ghee and yogurt; in the Mediterranean, introduced buffalo supplied mozzarella production. Hides fed local leather trades. In irrigated rice regions, buffalo labor shaped settlement patterns, tenancy, and seasonal work rhythms. Colonial agronomic surveys recorded their distribution and productivity. Mechanization reduced roles in some areas, yet buffalo remain important where fuel and capital are scarce. Iconography, village contracts, and agricultural manuals attest to their long integration with wet-rice systems.",
        "category": "Cattle\/Game",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Camp"
        ]
    },
    {
        "name": "Kangaroo",
        "description": "Kangaroos provided meat, skins, and materials for Aboriginal Australians over millennia. Hunting followed seasonal movements and used tracking, spearing, and later firearms. Skins furnished cloaks and shields; sinew served as binding for spears and tools. Fire management shaped habitats to favor grazing and ease pursuit. Early European observers recorded large drives and detailed techniques. In the nineteenth and twentieth centuries colonists commercialized hides and meat, and culling expanded with pastoral settlement. Government regulations later formalized quotas and export controls. Ethnographic accounts, rock art, and museum collections document enduring cultural knowledge tied to kangaroo use. Today regulated harvest continues alongside conservation management and research on grazing impacts in arid and temperate zones.",
        "category": "Cattle\/Game",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Camp"
        ]
    },
    {
        "name": "Red Snapper",
        "description": "Red snapper denotes several Lutjanus species, most notably Lutjanus campechanus of the Gulf of Mexico and western Atlantic. Indigenous fishers in the Caribbean and Gulf harvested snapper from reefs using hooks, lines, and woven traps. Colonial fleets expanded catches in the 18th–19th centuries, supplying salted and dried fish to coastal towns and plantations. Iced rail shipments in the late 1800s moved fresh fillets to inland markets. By the late 20th century, heavy effort reduced stocks and prompted quota systems, seasonal closures, and gear rules in U.S. and Mexican waters. Today the fish remains a valuable demersal resource caught by hook-and-line and longline near reefs and platforms. It underpinned coastal household economies, market stalls, and regional trade along the American littoral.",
        "category": "Fish",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Boats"
        ]
    },
    {
        "name": "Bocachico",
        "description": "Bocachico (Prochilodus magdalenae) sustained floodplain and river fisheries of northern Andean Colombia. The species migrates seasonally along the Magdalena and Cauca systems, concentrating during low waters. Indigenous and colonial riverine communities used cast nets, corrales, and basket traps to capture schooling fish for household use and sale in fluvial markets. Smoking and salting supported commerce between riparian towns and inland highlands. In the 20th century, commercial fleets and urban demand intensified pressure. Dams and channel works disrupted migratory routes and altered spawning grounds. Regional authorities introduced closed seasons and mesh regulations to preserve recruitment. Bocachico remains a cultural and dietary staple, featured in local stews and market stalls, and a case study in Andean floodplain fisheries management.",
        "category": "Fish",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Boats"
        ]
    },
    {
        "name": "Salmon",
        "description": "Salmon comprises anadromous species of Salmo and Oncorhynchus that spawn in rivers and mature at sea. In the Pacific Northwest, First Nations and Native American communities built weirs, traps, and smokehouses, organizing seasonal harvests that structured trade and ceremony. European colonization brought canneries, fish wheels, and industrial gillnets to the Columbia and Fraser in the 19th century. In northern Europe, medieval estates controlled riverine weirs and net rights for Atlantic salmon, with rents paid in fish. Declining runs led to hatcheries, fish ladders, and treaty-based co-management in the 20th century. Salmon remains central to coastal economies, cuisine, and identity from Scandinavia to Alaska, and a benchmark species for watershed restoration and fisheries law.",
        "category": "Fish",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Boats"
        ]
    },
    {
        "name": "Mussels",
        "description": "Mussels are intertidal and subtidal bivalves gathered for food, bait, and soil amendment. European coastal households collected them from rocks and estuaries through antiquity and the Middle Ages. Roman writers noted mussel beds near ports, supplying urban markets. In Brittany and the Low Countries, managed beds and pole-culture supported regular harvests for towns. Shell middens across Atlantic Europe and North America attest to long use by coastal foragers. Fisherfolk also dug mussels for bait and spread shells on fields as lime. Periodic closures followed disease or red tides to protect consumers. Mussels formed a low-cost protein in coastal diets and a dependable commodity in local trade networks.",
        "category": "Fish",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Boats"
        ]
    },
    {
        "name": "Tuna",
        "description": "Tuna refers to migratory Thunnus and related genera long pursued in the Mediterranean and adjacent Atlantic. Phoenician and Greek communities used fixed traps and light craft to intercept coastal runs. Roman processors salted loins and rendered sauces that moved widely by amphora. Medieval and early modern tonnare and almadrabas in Sicily, Sardinia, and Andalusia anchored seasonal economies, with lords and towns leasing trap rights. Steam canning and longlines in the 19th–20th centuries expanded reach into oceanic grounds. Conservation regimes later addressed declines in bluefin stocks. Tuna fishing linked coastal labor, preservation industries, and regional commerce for over two millennia.",
        "category": "Fish",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Boats"
        ]
    },
    {
        "name": "Tilapia",
        "description": "Tilapia denotes several cichlid species native to Africa and the Nile basin. Ancient Egyptian tomb art shows tilapia in nets and basins, reflecting early management and consumption. Riverine and lacustrine communities across Africa relied on the fish for everyday protein, using baskets, traps, and shoreline seines. In the mid‑20th century, governments and development agencies promoted pond culture of Nile tilapia to raise rural food supplies. The species adapted to simple earthen ponds and integrated farming, spreading across Asia and Latin America. Trade developed in fresh, iced, and frozen fillets for domestic and export markets. Tilapia remains central to smallholder aquaculture and urban markets, linking ancient capture fisheries with modern farmed production.",
        "category": "Fish",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Boats"
        ]
    },
    {
        "name": "Catfish",
        "description": "Catfish in the Near East include Clarias and related scaleless forms common in the Jordan Valley and Mesopotamian wetlands. Communities along the Jordan, Orontes, and lower Euphrates caught them with traps, hooks, and night lines for local sale. Ottoman tax registers and market ordinances mention river fish provisioning towns. Religious food laws shaped demand, since some traditions avoided scaleless fish, directing sales to mixed or non-observant populations. Seasonal floods created productive backwaters that sustained juvenile growth. Modern drainage works and dams altered habitats, reducing floodplain nurseries. Despite changes, catfish continued as an accessible, resilient source of protein in Levantine and Iraqi riverine economies.",
        "category": "Fish",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Boats"
        ]
    },
    {
        "name": "Perch",
        "description": "Perch, notably Perca fluviatilis, populate northern Eurasian lakes and rivers and supported subsistence and market fisheries. Indigenous Siberian families set under‑ice lines and nets for winter protein and traded dried fillets. Medieval and early modern towns around the Baltic and Russian heartland purchased perch for fast days and ordinary meals. Smoking, drying, and pickling extended shelf life through long winters. Nineteenth‑century rail links widened distribution to urban markets. Stocking and water regulation in the 20th century influenced local abundance in reservoirs and regulated lakes. Perch persisted as a reliable, cold‑water species for household consumption, regional trade, and small commercial fleets across boreal and temperate zones.",
        "category": "Fish",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Boats"
        ]
    },
    {
        "name": "Mackerel",
        "description": "Mackerel are fast, oily pelagic fish abundant along East Asian coasts. Japanese, Korean, and Chinese fishers targeted seasonal schools with purse seines, drift nets, and handlines. Salting, drying, and fermenting produced durable foods for inland trade and maritime voyages. Edo‑period Japan distributed dried saba widely to urban consumers. Korean ports shipped preserved mackerel to interior markets reliant on sea fish. In southern China, dried and salted mackerel formed part of coastal provisioning networks and emigrant diets. Steam vessels and ice in the late 19th century increased range and freshness. Mackerel remained a foundation species for regional protein supply and artisanal and commercial fisheries.",
        "category": "Fish",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Boats"
        ]
    },
    {
        "name": "Crab",
        "description": "Crabs provided versatile coastal food across Oceania and many littoral societies. Pacific island communities gathered reef and mangrove species at low tide, using woven traps, spears, and hand collection. Shellfish formed part of communal feasts and exchange, with live crabs moved between villages and islands. Colonial observers recorded crab gleaning as a regular women’s activity in atoll economies. Preservation by cooking and carrying in woven baskets allowed short‑range trade to markets and mission stations. In the 20th century, canneries and tourist demand expanded some fisheries. Crabs continued to supply household protein and ceremonial meals, linking reef ecosystems with daily subsistence and modest commerce.",
        "category": "Fish",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Boats"
        ]
    },
    {
        "name": "Avocado",
        "description": "Avocado is a Mesoamerican tree fruit valued for its high fat content and dense nutrition. Archaeological and linguistic evidence points to early cultivation by the Maya and Aztecs, who ate it fresh, mashed it into sauces, and used it in medicine and fertility rites. Spanish colonial networks spread the crop to the Caribbean and Europe, where it remained a curiosity until modern horticulture advanced. Commercial production expanded in the 19th and 20th centuries with orchards in Mexico, California, Chile, Peru, Israel, and Spain. The Hass cultivar, selected in California in the 1920s, became dominant in global trade. Refrigeration, ripening rooms, and controlled-atmosphere transport enabled long-distance distribution. Avocado oil and cosmetic uses developed alongside fresh markets, embedding the fruit in global cuisines.",
        "category": "Fruit",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            }
        ],
        "yields": [
            {
                "name": "Health",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Pineapple",
        "description": "Pineapple originated in northeastern South America and was domesticated by Tupi–Guarani communities. Indigenous peoples spread it through the Caribbean before European contact. Columbus encountered the fruit in 1493 and carried it to Europe, where it became an elite novelty. Early modern horticulturists built heated pineries to grow it in northern climates. Colonial empires diffused pineapple to tropical Africa and Asia, integrating it into plantation systems in the Caribbean and Southeast Asia. Canning and steamship transport in the late 19th and early 20th centuries, notably in Hawaii, created mass markets. The crop figured in imperial botany, plantation labor histories, and industrial food processing. Today multiple cultivars support fresh and processed sectors, continuing a trade that began with indigenous domestication and early transatlantic exchange.",
        "category": "Fruit",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            }
        ],
        "yields": [
            {
                "name": "Health",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Berries",
        "description": "Berries are small, pulpy fruits from diverse plants, central to subsistence in boreal and subarctic zones. Northern peoples, including the Sami and Nenets, foraged bilberries, lingonberries, and cloudberries as seasonal staples. Preservation by drying and jam making supported winter nutrition and trade. Medieval and early modern households across Scandinavia, Russia, and the British Isles relied on berry syrups and cordials for flavor and remedies. Berry harvests supplied urban markets and were taxed or regulated under local customary rights. In the early modern period, cranberries and blueberries entered Atlantic trade and colonial agriculture in North America. Their vitamin content supported long voyages and frontier diets. Berries thus bridged foraging economies, domestic preservation, and commercial horticulture across northern Eurasia and the Atlantic world.",
        "category": "Fruit",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            }
        ],
        "yields": [
            {
                "name": "Health",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Citrus",
        "description": "Citrus comprises aromatic, acidic fruits domesticated and hybridized across South and East Asia, later spread to the Mediterranean. Citron and sour orange were known in classical antiquity. Islamic agronomy expanded lemon, sour orange, and Seville orange cultivation in al-Andalus and Sicily, refining irrigation and grafting. From the 15th century, Iberian voyages carried citrus to the Atlantic islands and the Americas. Naval medicine adopted citrus juice to prevent scurvy during long voyages, formalized in European navies in the late 18th century. Candied peels, perfumery, and medicinal preparations formed lucrative trades. Sweet orange and mandarin orchards multiplied under Renaissance and early modern patronage, with orangeries protecting trees in cooler climates. Modern citrus industries arose in California, Florida, North Africa, and the Levant.",
        "category": "Fruit",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            }
        ],
        "yields": [
            {
                "name": "Health",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Figs",
        "description": "Figs are among the earliest domesticated fruit trees of the Mediterranean and Near East. Neolithic remains from the Levant indicate cultivation by the 10th millennium BCE. Egyptians grew common fig and sycamore fig, using them in food, offerings, and funerary contexts. Greeks and Romans developed extensive orchards, drying figs for military rations, travel, and trade. The biology of fig–wasp pollination shaped regional cultivation, while caprification practices were recorded by classical agronomists. Dried figs moved along Roman and later medieval trade routes as durable provisions. Monasteries and Islamic estates maintained fig cultivation, integrating it into irrigation systems. Early modern expansion carried figs to Iberian colonies and the Americas. The fruit persisted as a staple of Mediterranean diets and a notable commodity in dried form.",
        "category": "Fruit",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            }
        ],
        "yields": [
            {
                "name": "Health",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Tamarind",
        "description": "Tamarind is a tropical African tree producing tart-sweet pods used for cooking, medicine, and craft. It spread early to South Asia, where it became integral to Indian cuisines, chutneys, and curries. Ayurvedic texts record digestive and cooling uses. Historical sources attest to its role as a souring agent in Ethiopian and Egyptian preparations. Across the Indian Ocean, Arab and Portuguese trade dispersed tamarind to Southeast Asia, where it entered regional sauces, candies, and beverages. The fruit pulp aided preservation, while seeds and kernels served as thickeners. Wood and tannins supported carpentry, tanning, and metal polishing. In the 19th century, tamarind entered European condiments, including Worcestershire sauce. Its durable pods and broad utility anchored it in household, market, and maritime networks.",
        "category": "Fruit",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            }
        ],
        "yields": [
            {
                "name": "Health",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Dates",
        "description": "Dates are the fruit of Phoenix dactylifera, central to oasis agriculture in the Middle East and North Africa. Domesticated in Mesopotamia and the Arabian Gulf, the date palm provided food, fiber, and wood. Irrigation and careful offshoot propagation sustained orchards along rivers and desert fringes. Dates were staple foods in ancient Mesopotamia and Egypt, used fresh, dried, or processed into syrup. Caravans and pilgrims carried them across deserts as compact energy. They served in offerings and festival diets across the region. Islamic-era trade expanded cultivation from al-Andalus to the Maghreb and Persia. Iberian colonists introduced palms to the Americas; commercial groves later took root in California’s Coachella Valley. Dates remain a core commodity in trans-Saharan and Gulf-to-Mediterranean commerce.",
        "category": "Fruit",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            }
        ],
        "yields": [
            {
                "name": "Health",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Apples",
        "description": "Apple cultivation arose from Central Asian wild progenitors, chiefly Malus sieversii, and spread west along Eurasian trade routes. Grafting preserved desirable traits, producing stable cultivars in classical and medieval orchards. Apples formed a versatile temperate staple, eaten fresh, stored in cellars, and processed into dried slices, cider, and vinegar. Monastic estates and manorial farms in medieval Europe advanced orchard management and cider production. In early modern Europe, regional cider economies developed in Normandy, Asturias, and southern England. Colonists carried seeds and scions to North America, establishing extensive orchards and cider as a common beverage. The 19th and 20th centuries brought scientific pomology, rootstock standardization, and controlled-atmosphere storage, enabling global trade. Apples remain embedded in rural economies and industrial supply chains.",
        "category": "Fruit",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            }
        ],
        "yields": [
            {
                "name": "Health",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Mango",
        "description": "Mango, a South Asian stone fruit, has deep roots in Indian agriculture and culture. Ancient Sanskrit and Buddhist sources record its cultivation and ritual use. Royal patronage under the Mauryan and Mughal courts fostered orchards and varietal selection. Culinary practices ranged from fresh fruit to pickles, chutneys, dried slices, and amchur. Ayurvedic texts note digestive and tonic properties. Buddhist and later maritime networks carried mango to Southeast Asia, where it integrated into local cuisines. Portuguese traders spread grafting techniques and introduced mango to Africa and Brazil in the 16th century. By the 19th and 20th centuries, named cultivars such as Alphonso, Langra, and Haden moved through colonial and postcolonial exchanges. Today mango links smallholder farms and export markets across Asia, Africa, and the Americas.",
        "category": "Fruit",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            }
        ],
        "yields": [
            {
                "name": "Health",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Banana",
        "description": "Bananas and plantains derive from Musa species domesticated in Island Southeast Asia and New Guinea. Early Austronesian migrations carried them across the Pacific, where they became staples of Polynesian and Melanesian diets. Through Indian Ocean trade, cooking bananas reached East Africa and Madagascar, shaping agrarian regimes and cuisines. Vegetative propagation and rapid maturation suited humid tropics and supported year-round food security. Fermented banana beverages have long histories in Africa and the Pacific. European colonial expansion created plantation systems in the Caribbean and Central America, later consolidated by multinational firms. Disease outbreaks, including Panama disease, transformed varietal choices, leading to the dominance of Cavendish in the 20th century. Bananas remain vital as both subsistence crops and global exports, tying island and coastal cultures to world markets.",
        "category": "Fruit",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            }
        ],
        "yields": [
            {
                "name": "Health",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Cocoa",
        "description": "Cocoa refers to seeds of Theobroma cacao, cultivated by Mesoamerican societies for beverage, currency, and ritual. The Maya prepared spiced cacao drinks and recorded its use in codices and ceramics. Aztec tribute lists show cacao beans as taxable goods and a medium of exchange. After 16th-century contact, chocolate entered Iberian courts and spread to European chocolate houses. Colonial plantations expanded in New Spain, Venezuela, and later Brazil and West Africa, often through coerced labor. Nineteenth-century innovations such as Van Houten’s cocoa press and conching by Lindt produced smoother chocolate and mass markets. Cocoa became a global commodity tied to trade networks and social practices from courtly consumption to industrial confectionery.",
        "category": "Spice",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            }
        ],
        "yields": [
            {
                "name": "Culture",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Chili",
        "description": "Chili peppers comprise domesticated Capsicum species from the Americas, notably C. annuum, C. chinense, and C. baccatum. Archaeological and botanical evidence shows early cultivation in Mesoamerica and the Andes. Indigenous cuisines used chilies to season maize-based dishes, preserve foods, and treat ailments. Following the Columbian Exchange, Portuguese and Spanish routes carried peppers to West Africa, the Middle East, India, and East Asia in the 16th century. They were quickly integrated into regional cookery, from Indian masalas and Sichuan dishes to Korean kimchi and Ethiopian berbere. Their adaptability to diverse climates supported rapid diffusion. Chilies also served in topical remedies and as a deterrent to spoilage. By the early modern period they reshaped global flavor profiles and local agrarian economies.",
        "category": "Spice",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            }
        ],
        "yields": [
            {
                "name": "Culture",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Dill",
        "description": "Dill (Anethum graveolens) is an aromatic annual cultivated for leaves and seeds used in cooking, pickling, and medicine. Classical Greek and Roman sources mention dill in culinary and therapeutic contexts, including digestive and soothing applications. Medieval herbals and monastic gardens maintained its cultivation across Europe. In northern regions it became central to preserving fish and vegetables through pickling, pairing well with salmon, herring, and cucumbers. Scandinavian and Eastern European cuisines developed distinctive uses, such as gravlax seasoning and dill soups. Apothecaries stocked dill water for colic and digestive complaints. With early modern trade and kitchen gardening, dill spread widely, retaining a role in both household preservation and professional kitchens.",
        "category": "Spice",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            }
        ],
        "yields": [
            {
                "name": "Culture",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Oregano",
        "description": "Oregano (Origanum spp., chiefly O. vulgare and O. heracleoticum) is a Mediterranean herb valued for robust flavor and medicinal properties. It grew wild and was cultivated since antiquity in Greece and Italy, where it seasoned grilled meats, fish, and sauces. Classical and later medical traditions used it for digestive support and antiseptic infusions. Rural cultivation persisted through Byzantine and Ottoman periods, with regional varieties selected for potency. In the 19th and 20th centuries, dried oregano entered urban markets and international trade, accompanying Italian diaspora cuisines. Postwar demand in North America, tied to pizza and pasta sauces, broadened its global profile. Today oregano remains a staple of Mediterranean cookery and herbal practice.",
        "category": "Spice",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            }
        ],
        "yields": [
            {
                "name": "Culture",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Saffron",
        "description": "Saffron is the dried stigma of Crocus sativus, harvested by hand and long prized as spice, dye, and perfume. Ancient Persian, Greek, and Roman sources record its use in textiles, incense, and elite cuisine. Medieval and early modern trade moved saffron across Eurasia, with notable cultivation in Iran, Kashmir, and Spain’s La Mancha. Its labor-intensive harvest created high prices and strict quality controls, including guild oversight in some cities. Recipes from Andalusi to Venetian kitchens used saffron for color and flavor in rice, pastries, and broths. It also appeared in pharmacopoeias for mood and circulatory treatments. Despite synthetic dyes, saffron maintained culinary and cultural prestige into the present.",
        "category": "Spice",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            }
        ],
        "yields": [
            {
                "name": "Culture",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Cumin",
        "description": "Cumin (Cuminum cyminum) is a small-seeded umbellifer cultivated since antiquity for spice and medicine. Finds in Egyptian tombs attest to ritual and culinary roles. Greek and Roman writers describe its use at table and as a digestive. During the medieval period it circulated through Mediterranean and Near Eastern markets alongside coriander and caraway. The spice flavored sauces, breads, and preserved meats, and entered medical formularies. Iberian expansion carried cumin to the Americas, where it joined colonial and later regional cuisines. In South Asia and the Middle East it became integral to masalas and pilafs. Cumin’s warm aroma and storability supported its persistence in trade and domestic cookery.",
        "category": "Spice",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            }
        ],
        "yields": [
            {
                "name": "Culture",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Sesame",
        "description": "Sesame (Sesamum indicum) is an oilseed crop cultivated for edible seeds and oil. Ancient Near Eastern texts and residues attest to sesame pressing for cooking oil and lamp fuel. In the Levant it entered sauces and confections, notably tahini and halvah. Ritual offerings and traditional medicines used the seeds and oil in Mesopotamia and the Levant. Cultivation spread across the Indian subcontinent, where sesame joined temple economies and seasonal festivals. Through Islamic and Indian Ocean trade it reached East Africa and further east. Enslaved Africans carried benne (sesame) to the Americas, where it rooted in Lowcountry foodways. Its high oil content and drought tolerance made sesame a reliable crop in semi-arid zones.",
        "category": "Spice",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            }
        ],
        "yields": [
            {
                "name": "Culture",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Garlic",
        "description": "Garlic (Allium sativum) is a bulbous allium domesticated in Eurasia and used for food and medicine since antiquity. Egyptian records and later traditions note rations for laborers and medicinal preparations. Greek and Roman authors discuss its dietary and folk-medicinal roles. In medieval Europe and across Asia, garlic appeared in monastic herbals, humoral therapies, and everyday cookery. It gained importance in East Asian, Middle Eastern, and Mediterranean cuisines, pairing with oils, meats, and legumes. Healers valued its pungency for respiratory and digestive concerns. With early modern exploration and the Columbian Exchange, garlic cultivation expanded globally. It remains a durable household ingredient and a stable component of traditional pharmacopoeias.",
        "category": "Spice",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            }
        ],
        "yields": [
            {
                "name": "Culture",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Pepper",
        "description": "Black pepper is the dried fruit of Piper nigrum, native to India’s Malabar Coast and central to premodern long-distance trade. Classical Rome imported pepper as a luxury seasoning, documented in price lists and recipes. In the medieval period, Venetian and Genoese merchants handled pepper arriving via Indian Ocean and Levantine routes. High demand motivated Portuguese voyages; Vasco da Gama’s 1498 route around Africa established direct access. Pepper became a cornerstone of European spice commerce, used in sauces, preserved meats, and elite banquets. The commodity’s trade shaped port cities, chartered companies, and maritime strategy from the 15th to 17th centuries.",
        "category": "Spice",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            }
        ],
        "yields": [
            {
                "name": "Culture",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Cloves",
        "description": "Cloves are the dried flower buds of Syzygium aromaticum, native to the Moluccas. They were prized in medieval and early modern Eurasia for flavoring, preservation, and medicinal uses, including dental analgesia. Control of clove production and trade drove rivalry among regional sultanates and European powers. The Portuguese reached the Spice Islands in the 16th century; the Dutch VOC later enforced monopolies through fortifications and tree controls on Ternate and neighboring islands. Smuggling and eventual transplantation broke monopolies in the 18th–19th centuries, spreading cultivation to Zanzibar and elsewhere. Cloves entered European confections, Chinese braises, and Middle Eastern mixes, anchoring global spice exchanges.",
        "category": "Spice",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            }
        ],
        "yields": [
            {
                "name": "Culture",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Tobacco",
        "description": "Tobacco is a New World plant cultivated for nicotine-rich leaves processed into smokeable or chewable forms. Indigenous peoples of the Americas used it ritually and medicinally long before European contact. From the 16th century, Spanish and Portuguese traders carried it to Europe and Africa, where demand grew rapidly. In the English colonies, especially Virginia and Maryland, tobacco became a foundational cash crop by the early 17th century, shaping land use, plantation systems, and transatlantic trade. Caribbean islands, notably Cuba and later Jamaica, developed major curing and cigar industries. European states taxed tobacco heavily and often regulated it through monopolies. By the 18th century, snuff, cigars, and pipe tobacco formed a global commodity chain linking American plantations, European markets, and imperial revenues.",
        "category": "Plant",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Yerba Mate",
        "description": "Yerba mate is a caffeinated holly native to subtropical South America, brewed from dried leaves and shared communally with a gourd and metal straw. The Guaraní cultivated and consumed it long before Spanish colonization. In the 17th and 18th centuries, Jesuit missions organized plantations and trade networks along the Paraná and Paraguay rivers, securing a regional monopoly. After the expulsion of the Jesuits, production expanded under colonial and later national authorities in Paraguay, Argentina, and Brazil. By the 19th century, mate was entrenched as a daily beverage in the Río de la Plata and southern Brazil, with commercial centers in Misiones and Rio Grande do Sul. It remains a defining commodity and social drink in Paraguay, Argentina, Uruguay, and southern Brazil.",
        "category": "Plant",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Hops",
        "description": "Hops are the flowers of Humulus lupulus used to bitter, flavor, and preserve beer. They supplanted herbal gruit mixtures across Europe from the late Middle Ages, reshaping brewing practice and trade. In the Holy Roman Empire, hopped beer became standard, codified by regulations such as Bavaria’s 1516 Reinheitsgebot. England shifted from unhopped ale to hopped beer in the 15th–16th centuries, spurring cultivation in Kent. Major hop-growing regions emerged in Hallertau (Bavaria), Bohemia, and later the Pacific Northwest. Hopping stabilized beer for transport, enabling larger-scale commercial brewing and export. By the 19th century, specialized varieties and kilning techniques supported industrial breweries in Germany, Britain, and the United States, influencing global beer styles from Pilsner to India Pale Ale.",
        "category": "Plant",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Grapes",
        "description": "Grapes (Vitis vinifera) were domesticated in the Near East and spread across the Mediterranean with Greek and Roman colonization. They served both as fresh fruit and as the basis for wine. Roman viticulture codified pruning, trellising, and fermentation techniques that transmitted into medieval Europe. Monastic orders, notably the Benedictines and Cistercians, maintained vineyards and refined regional practices, laying foundations for later appellations. From the late Middle Ages, areas such as Burgundy, Bordeaux, and the Rhine developed reputations for quality wines that anchored regional economies. The 19th-century phylloxera crisis devastated European vineyards, prompting grafting onto American rootstocks and a broad reorganization of viticulture. Modern viticulture integrates historic terroirs with scientific enology, sustaining a global wine trade.",
        "category": "Plant",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Incense",
        "description": "Incense comprises aromatic resins and botanicals burned for fragrance and ritual. Frankincense (Boswellia) and myrrh (Commiphora) were the most valued products in antiquity, sourced from southern Arabia and the Horn of Africa. From the first millennium BCE, the Incense Route moved these resins northward through Nabataean Petra to Mediterranean markets and Near Eastern courts. Incense permeated religious and state ceremonies in ancient Egypt and Rome, and later in Christian liturgies and Islamic traditions. Byzantium and medieval Europe imported resins via Red Sea and Indian Ocean trade. Control of production zones and caravan paths conferred political leverage on South Arabian polities. Despite synthetic aromatics, natural incense remains integral in many religious practices and heritage perfumery.",
        "category": "Plant",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Coffee",
        "description": "Coffee is a brewed beverage from roasted seeds of Coffea, historically centered on arabica. Originating in the Ethiopian highlands, it entered Yemen by the medieval period, where Sufi communities used it for wakefulness. From the 15th to 17th centuries, Yemeni ports such as Mocha dominated export. Coffeehouses spread through the Ottoman Empire as venues for sociability and information exchange. European adoption in the 17th century produced coffeehouse cultures in London, Paris, and Amsterdam, linked to finance, print, and political debate. Colonial cultivation moved to Java under the Dutch, then expanded across the Caribbean and Brazil. By the 19th century, Brazil led global supply, while robusta gained ground in Africa and Asia. Modern commodity chains connect producer cooperatives, global brands, and futures markets.",
        "category": "Plant",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Papyrus",
        "description": "Papyrus is a writing material made from the pith of Cyperus papyrus, manufactured in sheets and assembled into scrolls. Developed in ancient Egypt by the third millennium BCE, it supported administrative records, religious texts, and literature. Production centered along the Nile, where the plant thrived, and exports reached the eastern Mediterranean. In the Hellenistic period, papyrus underpinned scholarly activity, including holdings at the Library of Alexandria. Greek and Roman bureaucracies relied on papyrus for contracts and correspondence. From late antiquity, parchment gradually displaced papyrus in Europe, though it continued in parts of the Byzantine and Islamic worlds. The dry Egyptian climate preserved many papyri, providing key evidence for ancient economy, law, and daily life.",
        "category": "Plant",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Hemp",
        "description": "Hemp (Cannabis sativa) is a fiber crop used for cordage, sails, textiles, and paper. Ancient China produced hemp cloth and paper; classical and medieval Eurasia relied on hemp rope and canvas. During the Age of Sail, naval fleets demanded vast quantities of hemp for rigging, cables, and sailcloth. Russia became a major exporter to Western Europe in the 17th–18th centuries, supplying British and Dutch maritime industries. In early modern Europe and North America, hemp fields supported shipyards, fisheries, and agricultural packing. The 19th century saw competition from cotton and later from sisal and manila fiber, while metal wire replaced some cordage. Industrial pulping and twentieth-century regulations reduced cultivation, followed by renewed interest in fiber, paper, and composites.",
        "category": "Plant",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Tea",
        "description": "Tea is a beverage prepared from processed leaves of Camellia sinensis, boiled or infused in water. Originating in China, it entered elite and ritual contexts by the Tang and Song periods, with tribute systems and refined preparation methods. From the 17th century, the Dutch and British East India Companies carried tea to Europe, where demand expanded rapidly. The silver outflow to China and British efforts to balance trade shaped imperial policy, culminating in the Boston Tea Party (1773) and later the Opium Wars. In the 19th century, colonial plantations in Assam, Darjeeling, Ceylon, and Java reorganized supply under European management. By the 20th century, black, green, and oolong teas formed global markets, supported by auction systems and branded blends.",
        "category": "Plant",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Sugar",
        "description": "Sugar is a crystalline sweetener produced mainly from sugarcane and, since the 19th century, sugar beet. Cane cultivation spread from South and Southeast Asia through the Islamic world to the Mediterranean. From the 16th century, the Atlantic plantation complex in Brazil and the Caribbean industrialized sugar making, with mills, boiling houses, and transoceanic shipping. Molasses and rum became integral to Atlantic trade. European demand drove expansion of plantations and the forced labor of enslaved Africans. Technological advances, including vacuum pans and centrifuges, increased yields in the 19th century. Beet sugar developed in Europe during the Napoleonic era and grew after abolition, diversifying supply. By the 20th century, sugar was a mass commodity underpinning confectionery, beverages, and processed foods.",
        "category": "Plant",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Cotton",
        "description": "Cotton is a soft seed fiber cultivated across tropical and subtropical zones. South Asian centers produced fine yarns and printed calicoes that moved through Indian Ocean and overland markets. European demand rose sharply after the 17th century. Plantation cotton from the American South fed Atlantic trade and relied on enslaved labor. The cotton gin and mechanized spinning and weaving transformed output in Britain, linking ports, mills, and colonies. Manchester and Liverpool became hubs for manufacturing and shipment. Tariff and sumptuary regimes, including the English Calico Acts, tried to manage competition with imported cloth. By the 19th century cotton textiles formed a core of global industrial commerce.",
        "category": "Cloth",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Alpaca",
        "description": "Alpaca fiber comes from an Andean camelid raised at high altitudes. It is warm, light, and durable, and it takes dye well. Inca and earlier Andean polities organized herds and workshops, producing garments for elites and for tribute. Colonial authorities taxed communities in wool and redirected exports to coastal markets. Traditional weaving centers continued to make ponchos and mantles for local use and trade. In the 19th century British manufacturers experimented with imported fleeces, creating alpaca cloth for European consumers. Modern herding persists in Peru and Bolivia, supplying regional artisans and international fashion houses. Efforts to maintain breed quality and fiber grading support continuing specialization.",
        "category": "Cloth",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Pasture"
        ]
    },
    {
        "name": "Sheep",
        "description": "Sheep provided wool, meat, and hides to ancient and medieval economies. Roman armies and urban markets drew on pastoral systems across the Mediterranean and Near East. In medieval Europe, English fleeces and Flemish weaving formed an integrated export trade. Guilds regulated cloth finishing, and coastal merchants moved bales through Channel and North Sea ports. Breed improvement, including the spread of Merino genetics, raised yields and fineness. Enclosure and rural restructuring in England favored large flocks aimed at export. In the 18th and 19th centuries colonial ranching expanded in Australasia and the Americas to meet industrial textile demand. Wool remained vital for uniforms and civilian cloth until synthetic fibers gained share.",
        "category": "Cloth",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Pasture"
        ]
    },
    {
        "name": "Mink",
        "description": "Mink is a small mustelid whose dense pelt has long been valued in the fur trade. Early modern hunters in North America and Europe supplied pelts through trading posts and port cities. Indigenous trappers exchanged furs for tools and goods, while European firms consolidated commerce. Mink fur served as trim and lining for coats, capes, and hats in elite wardrobes. In the 20th century, farms in Scandinavia and North America scaled production for fashion markets. Shifting tastes, regulation, and animal welfare campaigns altered demand and trade routes. Today the historical trade is studied for its links to frontier economies and environmental impact.",
        "category": "Cloth",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Camp"
        ]
    },
    {
        "name": "Dyes",
        "description": "Natural dyes come from plants, animals, and minerals used to color textiles. Mediterranean producers extracted Tyrian purple from murex shells for elite garments. European dyers used madder for reds and woad for blues before wider adoption of indigo. Indigo from South and Southeast Asia moved along maritime routes, later joined by Caribbean and American supplies. Iberian empires monopolized cochineal from New Spain, transforming red dye markets. Urban dye houses and guilds managed recipes, vats, and quality control across textile regions. In the mid-19th century synthetic aniline dyes rapidly displaced many natural sources, but historical palettes remain central to conservation and heritage crafts.",
        "category": "Cloth",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Leopard",
        "description": "Leopard skins have been used as prestigious garments and regalia in several regions. In West Africa, rulers and chiefs wore leopard-skin capes and drapes during ceremonies. Ethiopian nobility and clerics used similar skins in religious and state occasions. Early modern collectors and traders moved exotic pelts to European markets for display and fashion trim. The patterned hide carried associations of authority and prowess in courtly settings. During the 20th century, conservation laws and changing ethics curtailed commercial trade. Many communities adopted woven or printed substitutes to maintain ceremonial dress while protecting wildlife.",
        "category": "Cloth",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Camp"
        ]
    },
    {
        "name": "Linen",
        "description": "Linen is a bast fiber spun from flax and woven into durable textiles. Ancient Egypt relied on linen for everyday clothing and burial shrouds, producing fine, bleached fabrics. Greek and Roman households used linen for tunics, sails, and household cloth. Medieval Levantine and European centers supplied yarns and finished goods through Mediterranean and overland routes. Linen’s cool hand and strength suited undergarments, altar cloths, and table linen. With the rise of cotton and mechanized spinning, linen’s market share declined in mass apparel. It retained niches in household textiles, bookbinding, and specialty industrial uses, sustaining flax cultivation in parts of Europe.",
        "category": "Cloth",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Cashmere",
        "description": "Cashmere is the soft down from mountain goats raised across the Himalayas and Central Asia. Kashmir developed refined weaving for shawls prized by Mughal courts and regional elites. Production drew on caravan links that gathered fleeces from Ladakh and the Tibetan Plateau. Patterns and finishes became hallmarks of Kashmiri workshops, inspiring imitations abroad. European consumers in the 18th and 19th centuries drove strong demand, and towns such as Paisley created patterned copies. Industrial spinning later expanded supply from Mongolia and northern China. Despite competition, handwoven Kashmir shawls remain benchmarks of craft, while global cashmere underpins luxury knitwear and winter apparel.",
        "category": "Cloth",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Pasture"
        ]
    },
    {
        "name": "Silk",
        "description": "Silk is a filament fiber from silkworm cocoons, first cultivated in China. Sericulture and weaving formed an imperial industry that supplied courts and merchants. Silk moved along the Silk Road and maritime routes, reaching Rome, Persia, and later Byzantium. In the 6th century, Byzantium obtained silkworm eggs, enabling local production for palace workshops. Medieval and Renaissance centers in Lucca, Venice, and later Lyon specialized in patterned silks. Clerical vestments, diplomatic gifts, and court dress sustained demand under sumptuary regulation. Early modern mechanization and drawlooms advanced design and scale, while Asian sericulture continued to supply raw silk. Silk retained prestige across cultures, even as rayon and synthetics reshaped the global textile sector.",
        "category": "Cloth",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Plantation"
        ]
    },
    {
        "name": "Feathers",
        "description": "Feathers have served as decorative and ceremonial materials in many cultures. In Hawaii, artisans crafted feather cloaks and capes for ali‘i, using complex netting and careful color selection. Māori weavers produced feather cloaks that marked lineage and authority. Polynesian headgear incorporated plumes for ritual occasions and diplomacy. In the 19th and early 20th centuries, the millinery trade drove global demand for egret, ostrich, and bird-of-paradise plumes. Conservation movements and treaties restricted plume hunting and trade, reshaping fashion markets. Museum collections and descendant communities preserve techniques and revive ethical sourcing for ceremonial and artistic work.",
        "category": "Cloth",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Camp"
        ]
    },
    {
        "name": "Whales",
        "description": "Whales have been exploited for oil, meat, and baleen across many oceans. Basque fleets pioneered organized Atlantic whaling by the Middle Ages. Dutch, British, and American crews expanded the hunt in the early modern era. Nineteenth-century Yankee whalers pursued sperm whales for spermaceti used in high-quality candles and lubricants. Baleen supplied stays for corsets and frames for umbrellas. Indigenous Arctic communities maintained subsistence hunts with deep ritual and social significance. Twentieth-century factory ships and explosive harpoons drove many populations to collapse. The International Whaling Commission formed in 1946 to regulate catches. A global moratorium on commercial whaling began in 1986, with limited exemptions for aboriginal subsistence and scientific quotas. Conservation programs and sanctuaries emerged, while historical whaling ports preserved maritime heritage.",
        "category": "Marine",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            },
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Boats"
        ]
    },
    {
        "name": "Sea Lions",
        "description": "Sea lions were harvested along Pacific coasts for meat, skins, and limited oil. Indigenous communities in the Andean region and the North Pacific used them for food, clothing, and tools. European explorers and sealers took sea lions opportunistically in the eighteenth and nineteenth centuries. Commercial pressure in Patagonia and the subantarctic reduced rookeries near accessible haul-outs. Skins entered regional trades but never matched the value of true seal pelts. By the twentieth century, national protections and marine mammal laws in the United States, New Zealand, and South America restricted hunting. Population recoveries were uneven, and conflicts with fisheries grew near river mouths and harbors. Modern management focuses on rookery protection, bycatch reduction, and monitoring of historical breeding sites.",
        "category": "Marine",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            },
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Boats"
        ]
    },
    {
        "name": "Seals",
        "description": "Seals provided meat, oil, and durable hides for Arctic and subarctic societies. Inuit and Siberian peoples relied on seal products for food, lamps, clothing, and tools. Norse Greenlanders and later European settlers used local herds seasonally. The eighteenth and nineteenth centuries saw large-scale commercial hunts in the North Atlantic and Southern Ocean. Harp and hooded seal pelts supplied garment trades, while seal oil fueled lamps and lubricated machinery. Newfoundland and Labrador became major centers of the industry. Overharvesting, ice conditions, and changing markets led to contractions in the twentieth century. Public campaigns spurred regulations and import bans in Europe. Contemporary sealing is managed by quotas and safety rules, with continued cultural and subsistence importance in northern communities and reduced industrial demand.",
        "category": "Marine",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            },
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Boats"
        ]
    },
    {
        "name": "Lobster",
        "description": "Lobster fishing developed along European and North American coasts as a source of protein and trade. In colonial New England, lobsters were abundant and often viewed as food for servants or prisoners. Nineteenth-century canning and rail transport turned lobster into a wider commodity. Urban restaurants and hotels elevated it as a delicacy. Ship crews salted or canned lobster for provisions on long voyages. European markets prized live deliveries from the North Sea and Atlantic. Trap designs, seasonal closures, and size limits emerged as early conservation measures. By the twentieth century, brand identity and regional cuisines, notably in Maine and the Maritime Provinces, defined the fishery’s value. Sustainable practices and limited entry systems now aim to protect spawning stocks and coastal livelihoods.",
        "category": "Marine",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            },
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Boats"
        ]
    },
    {
        "name": "Squid",
        "description": "Squid have long served as food, bait, and regional trade goods. Mediterranean and East Asian cuisines featured fresh, dried, and fried preparations documented since antiquity. Jigging and purse seine techniques expanded catches in the twentieth century, targeting species such as Loligo, Illex, and Dosidicus. Dried and salted squid circulated through coastal markets in Japan, Korea, and Southeast Asia. Fisheries also supplied bait for tunas and other pelagic species in longline fleets. Industrial-scale operations emerged in the South Atlantic and North Pacific with night-lighting and specialized gear. Markets diversified as calamari entered global restaurant menus. Management focuses on short-lived stock dynamics, seasonal closures, and bycatch control. Historical records from ports and market books trace shifting centers of production and trade corridors.",
        "category": "Marine",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            },
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Boats"
        ]
    },
    {
        "name": "Shark",
        "description": "Sharks were taken for meat, fins, liver oil, and skin. East Asian fin markets drove high-value demand, especially for soup in imperial and later urban cuisines. European industries rendered liver oil for lamps, lubricants, and later squalene for pharmaceuticals and wartime applications. Coastal communities in the Mediterranean, West Africa, and the Indian Ocean consumed salted or fresh shark meat. Shagreen from shark skin served as an abrasive and decorative material. Rising industrial fleets in the late twentieth century increased catches and finning. Many populations declined due to slow growth and low fecundity. International responses include finning bans, catch limits, and CITES listings for vulnerable species. Historical fishing logs and market ledgers evidence long regional trades and changing product uses.",
        "category": "Marine",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            },
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Boats"
        ]
    },
    {
        "name": "Eel",
        "description": "Eels entered historical diets and markets through riverine weirs, pond systems, and later aquaculture. Medieval Europe used eel rents and weirs documented in manorial records. The European eel supported fisheries across the North Sea and Baltic regions. London’s jellied eels and Dutch smokehouses popularized preserved forms. In East Asia, Japanese unagi became a refined dish, with managed ponds and seasonal kabayaki sales. Glass eel and elver trades expanded in the twentieth century, linking Atlantic and East Asian markets. Dams, habitat loss, and overfishing later reduced stocks. Hatchery breakthroughs remain limited, so aquaculture depends on wild seed. Restoration efforts focus on fish passage, wetland recovery, and trade controls. Eel culture and cuisine continue to shape regional identities and economies.",
        "category": "Marine",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            },
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Boats"
        ]
    },
    {
        "name": "Caviar",
        "description": "Caviar is salted roe from sturgeons native to the Caspian, Black Sea, and major Eurasian rivers. Russian and Persian fisheries supplied courts, embassies, and luxury markets from the early modern period onward. Nineteenth-century exports expanded through Astrakhan and Baku. Beluga, osetra, and sevruga became standard grades with strict handling and salting methods. European hotels and diplomatic tables prized caviar as a high-status food. Overfishing, river regulation, and pollution diminished wild sturgeon in the twentieth century. International controls and trade labeling followed. Aquaculture developed to meet demand and reduce pressure on wild stocks. Historical ledgers, tariff schedules, and culinary guides document shifting sources, grades, and techniques that defined the trade from imperial monopolies to regulated modern production.",
        "category": "Marine",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            },
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Boats"
        ]
    },
    {
        "name": "Carp",
        "description": "Carp were domesticated for food and pond culture across Eurasia. In China, integrated rice–fish systems and pond polyculture stabilized yields and diversified diets. Song and Ming treatises recorded breeding and feeding practices. Medieval European monasteries managed carp ponds to supply fasting tables and urban markets. Common carp spread across Central Europe by the early modern period. Japan developed ornamental koi strains during the Edo period, elevating carp in garden and estate culture. Nineteenth- and twentieth-century introductions carried carp to North America and Australasia. The fish became both a food resource and an invasive species in some waters. Modern aquaculture uses selective breeding, formulated feeds, and polyculture to maintain production while addressing ecological concerns.",
        "category": "Marine",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            },
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Boats"
        ]
    },
    {
        "name": "Pearls",
        "description": "Natural pearls formed in oysters and mussels were prized in many civilizations. The Persian Gulf and Gulf of Mannar supported extensive fisheries serving Near Eastern and South Asian markets. Roman, Byzantine, and later European elites accumulated pearl jewelry and regalia. Spanish colonial fleets drew pearls from Caribbean banks near Margarita and Cubagua in the sixteenth century. Diving relied on skilled labor facing decompression and predation risks. Merchant networks routed pearls through Gulf ports and Mediterranean fairs. In the early twentieth century, cultured pearl techniques in Japan shifted the market and reduced pressure on wild beds. Natural fisheries persisted at smaller scales under regulation. Archaeological finds and court inventories trace the enduring role of pearls in adornment and high-value trade.",
        "category": "Marine",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            },
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Boats"
        ]
    },
    {
        "name": "Gold",
        "description": "Gold is a dense, corrosion-resistant metal valued for durability and luster. Ancient Egyptians used it for funerary masks, temple fittings, and court jewelry. Lydian and Greek coinage standardized gold as a monetary metal. The Roman aureus and Byzantine solidus circulated across Eurasia. West African fields supplied trans-Saharan trade that enriched Ghana and Mali. Sixteenth-century Spanish conquest drew bullion from Caribbean and Andean realms, altering European finance. Gold rushes in California, Australia, and the Klondike spurred migration and frontier economies. Gold leaf, gilding, and fine chasing shaped courtly art from Europe to Mughal India. The nineteenth- and twentieth-century gold standard tied currencies to bullion reserves. Central banks continue to hold gold as a reserve asset and crisis hedge.",
        "category": "Mineral",
        "requires": [
            {
                "type": "continent",
                "name": "America"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Mine"
        ]
    },
    {
        "name": "Silver",
        "description": "Silver is a ductile, reflective metal widely employed for coinage and fine wares. Classical economies relied on Athenian Laurion and Roman Iberian mines to mint drachmas and denarii. The Spanish discovery of Potosí and Andean lodes in the sixteenth century produced unprecedented output. Silver pesos, the “piece of eight,” became a global medium of exchange. Manila galleons moved American silver to Asia, where Chinese tax demands in silver drove sustained flows. The European Price Revolution reflected bullion influx and monetary expansion. Mints shifted standards between bimetallism and gold ratios in the nineteenth century. Silversmithing framed social display from Islamic courts to European guilds. Photography, electrical contacts, and medical alloys added modern uses, though coinage declined with fiat currency.",
        "category": "Mineral",
        "requires": [
            {
                "type": "continent",
                "name": "Andea"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Mine"
        ]
    },
    {
        "name": "Amber",
        "description": "Amber is fossilized tree resin prized for warm color, polish, and ease of carving. Neolithic and Bronze Age Europe produced beads and pendants found in graves and hoards. The Baltic coast supplied the major source, feeding the Amber Road into the Mediterranean. Mycenaean, Etruscan, and Roman elites collected and traded worked pieces. Roman authors attributed protective and medicinal virtues to amber. Medieval workshops in the Baltic cities fashioned rosaries and reliquaries. Early modern centers in Gdańsk and Königsberg created luxury cabinets and liturgical objects. The eighteenth-century Amber Room exemplified princely patronage. Scientific interest grew with electrical properties noted by classical writers and later refined in early physics. Trade persisted into modern tourism and artisan industries along the Baltic littoral.",
        "category": "Mineral",
        "requires": [
            {
                "type": "continent",
                "name": "Taiga"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Mine"
        ]
    },
    {
        "name": "Emerald",
        "description": "Emerald is the green gem variety of beryl colored by trace chromium or vanadium. Ancient Egyptian sources at Wadi Sikait and Wadi el-Hudi supplied Hellenistic and Roman markets. Writers linked the stone to court fashion in Ptolemaic and Roman settings. After 1530, Spanish control of the Muzo and Chivor mines in the Colombian Andes shifted global supply. Seville, Lisbon, and Goa funneled stones into Iberian, Mughal, and Safavid workshops. Mughal jewelers mounted large cabochons in turban ornaments, daggers, and reliquaries. Renaissance and Baroque Europe favored carved intaglios and elaborate gold settings. Nineteenth-century gemology improved cutting and grading. Modern demand relies on Colombian, Zambian, and Brazilian fields, with oiling and resin treatments standard in the trade.",
        "category": "Mineral",
        "requires": [
            {
                "type": "continent",
                "name": "Europe"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Mine"
        ]
    },
    {
        "name": "Marble",
        "description": "Marble is a metamorphic limestone valued for fine grain and polish, enabling durable sculpture and architecture. Quarries at Paros and Mount Pentelikon supplied Classical Greece for temples and statues. Rome exploited Carrara, known as Luna marble, for imperial projects and portraiture. Medieval builders reused antique blocks while maintaining local quarrying. Renaissance artists, including Michelangelo, carved major works from Carrara, such as David and the Pietà. The Ottoman and Mughal courts employed white marble for palatial and funerary architecture, notably the Taj Mahal using Makrana stone. European neoclassicism and American civic architecture adopted marble for facades and interiors. Modern quarrying uses wire saws and diamond tools, extending applications to cladding, flooring, and restoration.",
        "category": "Mineral",
        "requires": [
            {
                "type": "continent",
                "name": "Mediterra"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Mine"
        ]
    },
    {
        "name": "Diamonds",
        "description": "Diamond is crystalline carbon with exceptional hardness and refractive properties. Early mining in India’s Golconda fields supplied the ancient and medieval luxury trade. Islamic and European courts prized uncut and table-cut stones. Cutting advances in the Low Countries during the fifteenth and sixteenth centuries improved brilliance. Brazilian alluvial deposits overtook Indian output in the eighteenth century. South African kimberlite pipes at Kimberley and beyond transformed supply and mining technology in the late nineteenth century. Cartelized marketing shaped prices and branding in the twentieth century. Industrial diamonds and synthetic abrasives enabled precision cutting and drilling. Scientific work on high pressure and high temperature produced synthetic stones, later joined by chemical vapor deposition for gem and industrial use.",
        "category": "Mineral",
        "requires": [
            {
                "type": "continent",
                "name": "Africa"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Mine"
        ]
    },
    {
        "name": "Lapis Lazuli",
        "description": "Lapis lazuli is a blue metamorphic rock composed chiefly of lazurite with accessory minerals. The historic source lay in Badakhshan in present-day Afghanistan. Mesopotamian and Egyptian artisans carved beads, amulets, and inlays, including elements in elite burials and royal regalia. Cylinder seals and Egyptian funerary masks used contrasting gold and blue. Greco-Roman traders moved the stone via Near Eastern routes. In medieval and Renaissance Europe, lapis was ground to produce ultramarine, the costliest blue pigment for panel painting and manuscript illumination. Venetian and Flemish workshops reserved it for high-status commissions. Trade traveled along Silk Road and Levantine channels. Synthetic ultramarine in the nineteenth century reduced pigment costs, but gem use of lapis continued in jewelry and hardstone carving.",
        "category": "Mineral",
        "requires": [
            {
                "type": "continent",
                "name": "Levantica"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Mine"
        ]
    },
    {
        "name": "Turquoise",
        "description": "Turquoise is a blue to green copper-aluminum phosphate valued for its opaque color and fine polish. Ancient Egyptian mines in Sinai and Persian deposits near Nishapur supplied early jewels and inlays. The material circulated through Anatolian and Mediterranean trade into medieval Europe, giving the stone its French name. In Iran and Central Asia, craftsmen set turquoise in weapon hilts, mosque fittings, and court jewelry. Pre-Columbian Mesoamerica produced mosaics and ceremonial objects for Aztec and Mixtec elites. In the American Southwest, Puebloan, Navajo, and Zuni artisans integrated turquoise with silverwork and ceremonial regalia. Qing workshops combined turquoise with jade and gold for court ornaments. Stabilization and reconstitution techniques expanded modern use as high-grade sources declined.",
        "category": "Mineral",
        "requires": [
            {
                "type": "continent",
                "name": "Siberia"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Mine"
        ]
    },
    {
        "name": "Jade",
        "description": "Jade encompasses two tough ornamental stones, nephrite and jadeite. Neolithic cultures in China shaped nephrite into polished axes, bi discs, and cong tubes used in ritual settings. The material acquired enduring prestige in Chinese court culture, culminating in Qing virtuoso carvings. In Mesoamerica, jadeite from Guatemala’s Motagua Valley furnished Olmec and Maya figurines, earspools, and regalia linked to royal display. Polynesian and Māori artisans fashioned nephrite, known as pounamu, into adzes and heirloom ornaments. European Neolithic societies distributed alpine nephrite axes over long distances. The nineteenth century brought significant jadeite trade from Burma to China. Modern markets distinguish sources and treatments, with imperial green jadeite commanding the highest prices.",
        "category": "Mineral",
        "requires": [
            {
                "type": "continent",
                "name": "Asia"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Mine"
        ]
    },
    {
        "name": "Quartz",
        "description": "Quartz is a common silicate mineral occurring in many varieties, including colorless rock crystal and colored chalcedonies. Prehistoric communities flaked and ground quartz for tools and projectile points. Rock crystal vessels and amulets appear in Greco-Roman and medieval contexts. High-purity silica sand became a key input for glassmaking in Roman, Venetian, and Bohemian industries. Carvers shaped crystal reliquaries and lens-like ornaments for churches and courts. Scientific study identified piezoelectric properties in the late nineteenth century, enabling resonators and precision timing in the twentieth century. Quartz sands support foundry molds and ceramics. Gem varieties such as amethyst and carnelian served jewelry markets across Asia and Europe, with extensive workshops in India and the Islamic world.",
        "category": "Mineral",
        "requires": [
            {
                "type": "continent",
                "name": "Oceania"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 1
            }
        ],
        "improvementCategories": [
            "Mine"
        ]
    }
]