[
    {
        "name": "Dirt Road",
        "description": "Dirt roads are unpaved tracks formed by repeated travel and simple grading. They emerged in the Bronze Age alongside the earliest wheels and draft animals. Surfaces used compacted earth with occasional gravel, brush, or straw for reinforcement. Drainage depended on ruts, shallow ditches, and a crowned profile. Width matched ox carts and wagons. Sumerian trade routes between Uruk and nearby cities carried textiles, grain, and stone. Indus Valley ox-cart paths linked towns and fields. Minoan wagon tracks on Crete cut through limestone and soil. Such routes enabled migration, seasonal herding, and regional markets. They were cheap to extend but vulnerable to mud, dust, and erosion. Many medieval and early modern roads retained dirt surfaces. Numerous modern highways follow these ancient alignments.",
        "requires": [
            {
                "type": "domain",
                "name": "Land"
            },
            {
                "type": "technology",
                "name": "Wheel"
            }
        ],
        "yields": [
            {
                "name": "Trade Slot",
                "value": 2
            },
            {
                "name": "Move Cost",
                "type": "set",
                "value": 1
            }
        ]
    },
    {
        "name": "Cobbled Road",
        "description": "Cobbled roads are stone-paved surfaces designed to carry carts, riders, and foot traffic with improved durability. In the classical world they supported military movement, trade, and urban sanitation. Roman engineers laid polygonal basalt or limestone on compacted rubble with a cambered surface for drainage. Curbstones, side ditches, and milestones aided maintenance and navigation. The Appian Way, begun in 312 BCE, linked Rome to Capua and southern Italy. The Via Egnatia crossed the Balkans and tied Adriatic ports to Byzantium. Stone streets at Pompeii preserve wheel ruts and stepping stones. Similar paving later appeared in medieval towns and early modern capitals. Cobbles reduced rutting and winter mud, though they produced vibration and noise. Their legacy survives in historic centers and preserved road segments.",
        "requires": [
            {
                "type": "domain",
                "name": "Land"
            },
            {
                "type": "technology",
                "name": "Construction"
            }
        ],
        "yields": [
            {
                "name": "Trade Slot",
                "value": 3
            },
            {
                "name": "Move Cost",
                "type": "set",
                "value": 0.5
            }
        ]
    },
    {
        "name": "Canal",
        "description": "Canals are artificial waterways cut to move bulk cargo and passengers where rivers do not run or are unreliable. They flourished during the industrial era when mines and mills demanded cheap transport. Engineers used locks, pound levels, towpaths, and aqueducts to manage gradients and crossings. The Bridgewater Canal of 1761 linked coal pits to Manchester and triggered a British canal boom. The Erie Canal opened in 1825, connecting the Great Lakes to the Hudson and slashing freight costs to New York. The Suez Canal of 1869 created a sea passage between the Mediterranean and Red Sea and reshaped global routes. Financing came from investors and states. Railroads reduced many inland canals, yet strategic ship canals and modern barge networks remain vital.",
        "requires": [
            {
                "type": "domain",
                "name": "Land"
            },
            {
                "type": "technology",
                "name": "Industrialization"
            }
        ],
        "yields": [
            {
                "name": "Trade Slot",
                "value": 5
            },
            {
                "name": "Move Cost",
                "type": "set",
                "value": 1
            }
        ],
        "specials": [
            "Ships can enter"
        ]
    },
    {
        "name": "Railroad",
        "description": "Railroads are steel-track systems that guide flanged-wheel vehicles for efficient land transport. Standardized gauge, ballasted sleepers, and switchwork form the permanent way. Traffic runs by timetables, signaling, and centralized control. Steam dominated in the nineteenth century, then diesel and electric traction advanced performance. By 1916 the Trans-Siberian Railway created a continuous link across Eurasia and reshaped imperial logistics. From 1964 the Tokaido Shinkansen demonstrated reliable high-speed passenger service. European mainline electrification programs improved acceleration, capacity, and energy efficiency. Railways carried ore, grain, mail, and troops at scale. They concentrated industry and enabled commuting. Containerization after mid century integrated rail with ports and highways. Despite competition from road and air, rail remains a backbone of dense corridors.",
        "requires": [
            {
                "type": "domain",
                "name": "Land"
            },
            {
                "type": "technology",
                "name": "Railroad"
            }
        ],
        "yields": [
            {
                "name": "Trade Slot",
                "value": 5
            },
            {
                "name": "Move Cost",
                "type": "set",
                "value": 0.33
            }
        ]
    },
    {
        "name": "Motorway",
        "description": "Motorways are controlled-access divided highways designed for sustained high-speed motor travel. They use grade separation, medians, limited entrances, and safety barriers to maintain flow and reduce conflicts. Pavements follow strict design speeds, lane widths, and sight distances. Service areas and intelligent traffic systems support operations. Large programs expanded networks in the early twenty-first century. China extended the National Trunk Highway System, including the G30 corridor across the northwest. India completed the Golden Quadrilateral in 2012, linking Delhi, Mumbai, Chennai, and Kolkata. The European Union advanced TEN-T motorway upgrades to integrate member states and freight routes. Motorways foster regional integration and just-in-time logistics. They also raise issues of congestion, emissions, land acquisition, and toll finance.",
        "requires": [
            {
                "type": "domain",
                "name": "Land"
            },
            {
                "type": "technology",
                "name": "Oil Refining"
            }
        ],
        "yields": [
            {
                "name": "Trade Slot",
                "value": 6
            },
            {
                "name": "Move Cost",
                "type": "set",
                "value": 0.25
            }
        ]
    }
]