[
    {
        "name": "Disease Projectile",
        "category": "Biological",
        "requires": [
            {
                "type": "technology",
                "name": "Castles"
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 160
            },
            {
                "name": "Damage",
                "value": 20,
                "type": "percent",
                "for": [
                    {
                        "type": "special",
                        "name": "All in tile"
                    }
                ],
                "vs": [
                    {
                        "type": "concept",
                        "name": "Citizen"
                    },
                    {
                        "type": "concept",
                        "name": "Unit"
                    }
                ]
            }
        ],
        "specials": [
            "Stockpiled"
        ],
        "actions": [
            "Bombard"
        ],
        "description": "Disease projectiles were medieval siege munitions that used corpses, offal, or contaminated materials to degrade defenders’ health and morale. Sources describe besiegers loading trebuchets with carcasses or waste and hurling them over walls. The best known episode occurred at Caffa in 1346, when attacking forces reportedly threw plague-infected bodies into the Genoese-held city during the Black Death. Earlier and later sieges also employed animal carcasses to foul water and spread putrefaction. The tactic relied on fear and unsanitary conditions rather than controlled epidemiology, and its direct role in transmitting specific diseases remains debated. With the rise of early modern military hygiene and emerging international norms, such practices declined. Twentieth-century treaties, including the 1925 Geneva Protocol and later the Biological Weapons Convention, codified prohibitions on biological methods of warfare."
    },
    {
        "name": "Gas Projectile",
        "category": "Biological",
        "requires": [
            {
                "type": "technology",
                "name": "Chemistry"
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 400
            },
            {
                "name": "Damage",
                "value": 33,
                "type": "percent",
                "for": [
                    {
                        "type": "special",
                        "name": "All in tile"
                    }
                ],
                "vs": [
                    {
                        "type": "concept",
                        "name": "Citizen"
                    },
                    {
                        "type": "concept",
                        "name": "Unit"
                    }
                ]
            }
        ],
        "specials": [
            "Stockpiled"
        ],
        "actions": [
            "Bombard"
        ],
        "description": "Gas projectiles are artillery shells or mortars designed to disseminate toxic chemical agents on detonation. During the First World War, after initial cloud releases, belligerents adopted shells to deliver chlorine, phosgene, and mustard agents with greater precision and persistence. Major offensives from 1915 to 1918 saw extensive shelling with gas munitions on the Western and Eastern Fronts, prompting rapid development of masks, filters, and protective drills. Shell-based delivery enabled mixed barrages that combined high explosive and chemical effects against trenches and artillery positions. Postwar condemnation shaped the 1925 Geneva Protocol, which banned chemical warfare. States nevertheless retained stockpiles for decades, though battlefield use dwindled under legal and strategic constraints. By the late twentieth century, international regimes sought verified destruction of chemical munitions under the Chemical Weapons Convention."
    },
    {
        "name": "Virus Bomb",
        "category": "Biological",
        "requires": [
            {
                "type": "technology",
                "name": "Genetics"
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 1000
            },
            {
                "name": "Damage",
                "value": 33,
                "type": "percent",
                "for": [
                    {
                        "type": "special",
                        "name": "All in tile"
                    }
                ],
                "vs": [
                    {
                        "type": "concept",
                        "name": "Citizen"
                    },
                    {
                        "type": "concept",
                        "name": "Unit"
                    }
                ]
            },
            {
                "name": "Hit Radius",
                "value": 1
            }
        ],
        "specials": [
            "Stockpiled"
        ],
        "actions": [
            "Bombard"
        ],
        "description": "Virus bombs are a speculative class of warheads designed to disperse engineered viruses as aerosols over wide areas. The concept appears in late twentieth- and twenty-first-century fiction and policy debates about emerging biotechnology. Proposed mechanisms envision tailored pathogens, genetic payloads, or delivery systems optimized for environmental stability and transmission, often invoking CRISPR-era modification. No state has acknowledged such weapons, and practical barriers remain high, including agent survivability, control of spread, and unpredictable epidemiology. International law prohibits development and possession under the Biological Weapons Convention, reinforced by biosafety standards and export controls. Public discourse treats the idea as a cautionary scenario about dual-use research and biodefense. Notable cultural treatments include novels and games that examine strategic and ethical consequences rather than technical feasibility."
    },
    {
        "name": "Atom Bomb",
        "category": "Nuclear",
        "requires": [
            {
                "type": "technology",
                "name": "Fission"
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 520
            },
            {
                "name": "Damage",
                "value": 33,
                "type": "percent",
                "for": [
                    {
                        "type": "special",
                        "name": "All in tile"
                    }
                ],
                "vs": [
                    {
                        "type": "concept",
                        "name": "Building"
                    },
                    {
                        "type": "concept",
                        "name": "Citizen"
                    },
                    {
                        "type": "concept",
                        "name": "Improvement"
                    },
                    {
                        "type": "concept",
                        "name": "Unit"
                    }
                ]
            },
            {
                "name": "Hit Radius",
                "value": 1
            }
        ],
        "specials": [
            "Stockpiled"
        ],
        "actions": [
            "Bombard"
        ],
        "description": "An atom bomb is a fission weapon that releases energy by rapidly splitting heavy nuclei, producing blast, heat, and ionizing radiation. The United States built the first devices during the Manhattan Project, culminating in the Trinity test in July 1945. Days later, atomic bombs destroyed Hiroshima and Nagasaki, prompting Japan’s surrender and ending the Second World War in the Pacific. Early designs used gun-type and implosion assemblies with uranium-235 or plutonium-239. Postwar programs in the Soviet Union, United Kingdom, France, and China expanded nuclear arsenals and delivery systems. The technology reshaped strategy through deterrence doctrines and civil defense planning. Arms control efforts, including the Partial Test Ban Treaty and the Nuclear Non-Proliferation Treaty, sought to limit testing, spread, and deployment while maintaining safeguards and verification."
    },
    {
        "name": "Hydrogen Bomb",
        "category": "Nuclear",
        "requires": [
            {
                "type": "technology",
                "name": "Thermonuclear Device"
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 720
            },
            {
                "name": "Damage",
                "value": 50,
                "type": "percent",
                "for": [
                    {
                        "type": "special",
                        "name": "All in tile"
                    }
                ],
                "vs": [
                    {
                        "type": "concept",
                        "name": "Building"
                    },
                    {
                        "type": "concept",
                        "name": "Citizen"
                    },
                    {
                        "type": "concept",
                        "name": "Improvement"
                    },
                    {
                        "type": "concept",
                        "name": "Unit"
                    }
                ]
            },
            {
                "name": "Hit Radius",
                "value": 2
            }
        ],
        "specials": [
            "Stockpiled"
        ],
        "actions": [
            "Bombard"
        ],
        "description": "A hydrogen bomb is a thermonuclear weapon that uses a fission primary to drive fusion in a secondary stage, yielding far greater energy than pure fission devices. The United States tested the first thermonuclear design in 1952, followed by the Soviet Union in 1953. Subsequent advances produced lighter, deliverable warheads and very high-yield tests, such as the Soviet Tsar Bomba in 1961. In the twenty-first century, several nuclear states have maintained and modernized thermonuclear arsenals, focusing on safety, reliability, and miniaturization for varied delivery systems. North Korea announced thermonuclear tests in 2016 and 2017, intensifying proliferation concerns and sanctions. Contemporary policy centers on deterrence postures, test moratoria, and stockpile stewardship programs, alongside efforts to prevent further spread under the Nuclear Non-Proliferation Treaty."
    },
    {
        "name": "Planet Buster",
        "category": "Nuclear",
        "requires": [
            {
                "type": "technology",
                "name": "Nuclear Fusion"
            }
        ],
        "yields": [
            {
                "name": "Production Cost",
                "value": 1500
            },
            {
                "name": "Damage",
                "value": 50,
                "type": "percent",
                "for": [
                    {
                        "type": "special",
                        "name": "All in tile"
                    }
                ],
                "vs": [
                    {
                        "type": "concept",
                        "name": "Building"
                    },
                    {
                        "type": "concept",
                        "name": "Citizen"
                    },
                    {
                        "type": "concept",
                        "name": "Improvement"
                    },
                    {
                        "type": "concept",
                        "name": "Unit"
                    }
                ]
            },
            {
                "name": "Hit Radius",
                "value": 3
            }
        ],
        "specials": [
            "Stockpiled"
        ],
        "actions": [
            "Bombard"
        ],
        "description": "A planet buster is a hypothetical doomsday device capable of inflicting planet-scale devastation through staged thermonuclear fusion with multi-gigaton yields. The idea belongs to science fiction and speculative military thought rather than practicable engineering. Writers and designers have posited chained fusion stages, antimatter triggers, or asteroid-delivery hybrids to bridge the gap between known weapons and extinction-level effects. No technology approaches such performance; even the largest historical test, the 1961 Tsar Bomba, remained many orders of magnitude below global destruction. Discussions often compare required energies to major impact events, such as the Chicxulub asteroid. The concept serves as a narrative tool for exploring ethics, deterrence, and catastrophe in literature, film, and games, while underscoring the limits and dangers of nuclear escalation."
    }
]