[
    {
        "name": "Snow",
        "description": "Snow is frozen precipitation that accumulates across temperate and polar regions, shaping seasonal economies, transport, and warfare. Indigenous Arctic peoples exploited snow’s insulation in igloos and other winter shelters. Siberian reindeer herders tailored migration and fodder strategies to crusting and thaw cycles. In the Alps, reliable snow cover fostered modern ski resorts and tourism. Military campaigns have hinged on snowfall and cold, including urban fighting and supply failures during the Battle of Stalingrad. Spring melt drives water storage and irrigation downstream; the Colorado River headwaters depend on snowpack, linking mountain climates to agriculture and cities far away.",
        "requires": [
            {
                "type": "domain",
                "name": "Land"
            },
            {
                "type": "climate",
                "name": "Frozen"
            }
        ],
        "yields": [
            {
                "name": "Damage",
                "type": "percent",
                "value": 25
            },
            {
                "name": "Move Cost",
                "value": 1
            }
        ]
    },
    {
        "name": "Tundra",
        "description": "The tundra is a cold, treeless biome defined by permafrost, low vegetation, and short summers. Human activity adapted to its constraints through mobile pastoralism and seasonal hunting. On Siberia’s expanses, Nenets and related cultures manage large reindeer herds along traditional routes. Alaska’s North Slope introduced a modern extractive phase, with Prudhoe Bay oil fields and pipeline infrastructure built on frozen ground. Conservation areas such as the Arctic National Wildlife Refuge protect migratory caribou and bird habitats. Thawing permafrost now destabilizes settlements, releases methane, and alters hydrology across northern Canada, reshaping land use, engineering standards, and ecological baselines.",
        "requires": [
            {
                "type": "domain",
                "name": "Land"
            },
            {
                "type": "climate",
                "name": "Cold"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ]
    },
    {
        "name": "Grass",
        "description": "Grasslands cover steppes, savannas, and prairies, supporting pastoralism and cereal agriculture. The Eurasian steppes enabled swift mounted warfare and long-distance migrations, exemplified by Mongol armies and tribute networks. In Africa’s savannas, Maasai and other peoples developed transhumant systems aligned with rainfall and pasture cycles. North America’s Great Plains shifted from bison ecology to wheat, corn, and cattle ranching under railroads and homesteading. The Argentine Pampas became a global exporter of beef and grain, tied to refrigerated shipping. Many societies used controlled burns to renew forage and control woody encroachment, maintaining habitat mosaics that sustained both wildlife and herds.",
        "requires": [
            {
                "type": "domain",
                "name": "Land"
            },
            {
                "type": "any",
                "items": [
                    {
                        "type": "climate",
                        "name": "Temperate"
                    },
                    {
                        "type": "climate",
                        "name": "Equatorial"
                    }
                ]
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1.5
            }
        ]
    },
    {
        "name": "Plains",
        "description": "Plains are broad, level lands formed by rivers and wind, often with deep, fertile soils. Early urban civilization coalesced on the Mesopotamian plains, where irrigation supported cities and writing. The North China Plain sustained intensive cereal cultivation and dense state structures. In North America, settlement of the Great Plains followed rail expansion, land surveys, and mechanized farming. The Argentine Pampas evolved into a major grain and beef region integrated into world markets. Along the Nile, predictable floodplains underpinned ancient Egyptian agriculture and administration. Plains frequently serve as corridors for trade and war, but also face dust storms and drought.",
        "requires": [
            {
                "type": "domain",
                "name": "Land"
            },
            {
                "type": "climate",
                "name": "Warm"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ]
    },
    {
        "name": "Desert",
        "description": "Deserts are arid landscapes defined by scarce precipitation, wide temperature ranges, and sparse vegetation. Human survival centers on oases, wells, and caravan routes. The Sahara supported trans-Saharan commerce in gold, salt, and enslaved people, aided by camel caravans. On the Arabian Peninsula, Bedouin nomadism balanced herding with oasis trade. The Silk Road skirted the Taklamakan and Gobi, using fortified waystations and seasonal passages. In North America, the Mojave and Sonoran deserts prompted irrigation projects and adapted ranching. Australia’s Outback sustained Indigenous knowledge systems for water and fire. Modern states extract minerals and energy while confronting fragile desert ecologies.",
        "requires": [
            {
                "type": "domain",
                "name": "Land"
            },
            {
                "type": "climate",
                "name": "Hot"
            }
        ],
        "yields": [
            {
                "name": "Damage",
                "type": "percent",
                "value": 25
            },
            {
                "name": "Move Cost",
                "value": 1
            }
        ]
    },
    {
        "name": "Lake",
        "description": "Lakes are enclosed freshwater basins that concentrate resources, transport, and ritual life. Shores provide fish protein, reeds, and arable deltas, while ice or calm waters allow seasonal travel. The Great Lakes formed a continental shipping corridor linking inland North America to the Atlantic via canals and locks, and they supported large fisheries. Lake Titicaca served Andean communities as a sacred landscape and a hub for canoe transport and interregional exchange. Lake Baikal preserved unique biodiversity and a vast share of Earth’s liquid freshwater. Lake systems have often anchored fortified towns, monasteries, and later hydroelectric and tourism economies.",
        "requires": [
            {
                "type": "domain",
                "name": "Water"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ]
    },
    {
        "name": "Coast",
        "description": "Coasts mark the meeting of land and sea, concentrating ports, fisheries, and defenses. Maritime peoples used these margins to build far-flung networks. Phoenician cities established trading colonies along the Mediterranean littoral. Polynesian navigators settled island coasts across the Pacific using stars, swells, and outrigger canoes. In modern warfare, coasts become invasion fronts; the Normandy shoreline in 1944 enabled Allied amphibious landings. Coastal zones also host shipbuilding, saltworks, and tidal mills, but face storms and erosion. Over time, harbors, lighthouses, and customs houses structured governance and commerce along these densely populated and contested edges.",
        "requires": [
            {
                "type": "domain",
                "name": "Water"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1
            }
        ]
    },
    {
        "name": "Sea",
        "description": "Seas are marginal or enclosed saltwater bodies that foster dense maritime exchange. The Aegean Sea linked Greek city-states through short-haul trade, colonization, and naval warfare in the classical era. The Baltic hosted Viking voyages and later the Hanseatic League, which tied port towns by convoyed trade and law. In the Caribbean, early modern empires contended for sugar islands, enslaved labor, and shipping lanes, producing syncretic cultures and piracy. Seas often host seasonal fisheries and coastal cabotage, and they serve as staging grounds for blue-water ventures into the wider ocean.",
        "requires": [
            {
                "type": "domain",
                "name": "Water"
            }
        ]
    },
    {
        "name": "Ocean",
        "description": "Oceans are vast interconnected waters that regulate climate and sustain global navigation. Prevailing winds and currents offered predictable routes for sailing empires. Across the Atlantic, the Age of Exploration linked Europe, Africa, and the Americas, establishing plantation economies and the transatlantic slave trade. The Pacific preserved long traditions of Polynesian wayfinding and later became a major theater of World War II. The Indian Ocean bound East Africa, Arabia, India, and Southeast Asia through monsoon-timed commerce, diasporas, and religious exchange. Modern cables, container shipping, and fisheries deepen dependence on ocean corridors while raising stewardship and security challenges.",
        "requires": [
            {
                "type": "domain",
                "name": "Water"
            }
        ]
    }
]