[
    {
        "name": "Hallstatt Salt Mines",
        "category": "Production",
        "requires": [
            {
                "type": "technology",
                "name": "Pit Mining"
            },
            {
                "type": "elevation",
                "name": "Hill"
            }
        ],
        "yields": [
            {
                "name": "Production",
                "value": 1,
                "for": [
                    {
                        "category": "improvement",
                        "name": "Mine"
                    },
                    {
                        "category": "improvement",
                        "name": "Quarry"
                    }
                ]
            }
        ],
        "description": "The Hallstatt Salt Mines in the Austrian Alps formed one of Europe’s earliest industrial zones. Intensive extraction began in the Bronze Age and continued into the Iron Age, creating the material base for the Hallstatt culture. Miners exploited rich halite seams using wooden tools and advanced drainage. Salt’s preservative power has left exceptional finds, including textiles, rope, and ladders, which document techniques and labor organization. Output moved along Alpine passes and Danube corridors, linking communities from the Balkans to the Atlantic. Nearby Dürrnberg at Hallein shows large Iron Age operations tied to the same network. Celtic groups used the resource to finance metalwork and long-distance trade. The mines’ continuity and scale make them a key case for early mining technology, subsistence support, and elite exchange in temperate Europe."
    },
    {
        "name": "Petra",
        "category": "Production",
        "requires": [
            {
                "type": "technology",
                "name": "Iron Working"
            },
            {
                "type": "terrain",
                "name": "Desert"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1,
                "for": [
                    {
                        "type": "terrain",
                        "name": "Desert"
                    }
                ]
            },
            {
                "name": "Production",
                "value": 1,
                "for": [
                    {
                        "type": "terrain",
                        "name": "Desert"
                    }
                ]
            }
        ],
        "description": "The city of Petra, hewn from sandstone gorges in southern Jordan, was the Nabataean capital and a major caravan junction. From the third century BCE to the first century CE it managed tolls, storage, and security for incense and aromatics moving from Arabia to the Mediterranean. Monumental rock-cut architecture, notably Al-Khazneh and Ad Deir, displayed civic investment and craft skill. An engineered water system of channels, cisterns, and dams sustained urban life in an arid basin. Rome annexed the kingdom in 106 CE, forming the province of Arabia and redirecting flows through integrated roads. Earthquakes and shifting maritime routes weakened the site thereafter. European travelers publicized the ruins in 1812. Petra endures as evidence for Nabataean statecraft, caravan logistics, and hydraulic adaptation in a desert environment."
    },
    {
        "name": "Chichen Itza",
        "category": "Production",
        "requires": [
            {
                "type": "technology",
                "name": "Engineering"
            },
            {
                "type": "feature",
                "name": "Jungle"
            }
        ],
        "yields": [
            {
                "name": "Production",
                "value": 4,
                "for": [
                    {
                        "type": "feature",
                        "name": "Jungle"
                    }
                ]
            }
        ],
        "description": "Chichén Itzá was a dominant Maya city in northern Yucatán during the Terminal Classic and Early Postclassic, c. 800–1200 CE. Its urban core combined ritual spaces, markets, and palatial compounds with stone cisterns and causeways. The pyramid known as El Castillo (Temple of Kukulcán) shows precise astronomical planning, with equinox light-and-shadow effects. The complex Great Ball Court hosted ceremonies tied to diplomacy and political theater. The Cenote Sagrado received offerings, including human sacrifice, linked to rain cults and alliance-making with coastal ports. Architectural elements show interaction with central Mexican styles. The observatory called El Caracol indicates sustained sky-watching for calendrics and navigation. Chichén Itzá organized regional trade in salt, cotton, and obsidian, projecting power well beyond the Puuc hills and the north coast."
    },
    {
        "name": "Ruhr Valley",
        "category": "Production",
        "requires": [
            {
                "type": "technology",
                "name": "Steel Milling"
            },
            {
                "type": "concept",
                "name": "Flat Land"
            }
        ],
        "yields": [
            {
                "name": "Production",
                "value": 5,
                "for": [
                    {
                        "category": "improvement",
                        "name": "Mine"
                    },
                    {
                        "category": "improvement",
                        "name": "Quarry"
                    }
                ]
            }
        ],
        "description": "The Ruhr Valley (Ruhrgebiet) evolved into Germany’s principal industrial region during the nineteenth and twentieth centuries. Abundant bituminous coal underpinned dense mining districts connected by railways and canals to the Rhine. Large integrated steelworks, notably Krupp in Essen, adopted Bessemer and open-hearth processes to supply rails, armaments, and machinery. Industrial towns such as Dortmund, Bochum, and Duisburg expanded with migrant labor and technical schools. The region became a strategic center in World War I and faced occupation during the Ruhr crisis of 1923. Allied bombing in World War II targeted coking plants, bridges, and factories. Postwar reconstruction and the European Coal and Steel Community anchored recovery and cross-border regulation. From the 1960s, pit closures forced restructuring toward chemicals, logistics, and services. Heritage sites like Zollverein colliery document the scale of the coal-steel complex and its environmental legacies."
    },
    {
        "name": "Everett Factory",
        "category": "Production",
        "requires": [
            {
                "type": "technology",
                "name": "Aerodynamics"
            },
            {
                "type": "concept",
                "name": "Flat Land"
            }
        ],
        "yields": [
            {
                "name": "Production",
                "value": 2,
                "for": [
                    {
                        "type": "concept",
                        "name": "Building"
                    }
                ]
            }
        ],
        "description": "The Everett Factory at Paine Field, Washington, is the world’s largest building by volume. Boeing constructed it in the late 1960s for the 747 program and later expanded it for wide-body assembly. Multiple bays host tooling and final assembly for the 747, 767, 777, and 787 Dreamliner at different phases. The plant links to global supply chains that deliver major fuselage and wing sections by air and sea, including via Dreamlifter aircraft. On-site paint, systems installation, and testing precede rollouts to flight lines. The facility integrates digital production control, large gantry cranes, and extensive logistics tunnels. Its scale encapsulates the industrial requirements of long-range aviation and the coordination needed to build high-performance airframes at commercial volumes."
    },
    {
        "name": "Gigafactory",
        "category": "Production",
        "requires": [
            {
                "type": "technology",
                "name": "Robotics"
            },
            {
                "type": "concept",
                "name": "Flat Land"
            }
        ],
        "yields": [
            {
                "name": "Production",
                "value": 1
            }
        ],
        "description": "A gigafactory is a large, vertically integrated plant for mass production of lithium-ion cells, battery packs, and electric vehicle components. Lines fabricate electrodes, assemble cells at gigawatt-hour scales, and integrate power electronics and drivetrains. Facilities often add recycling, cathode production, and grid-scale energy storage assembly. The concept gained prominence with Tesla’s Nevada site and expanded with plants in Shanghai, Berlin-Brandenburg, and Austin. Other manufacturers and consortia adopted similar campuses to secure supply for EV fleets and stationary storage. Automation, dry-electrode methods, and quality analytics reduce cost per kilowatt-hour while improving throughput. Gigafactories tie regional energy policy, mineral sourcing, and transmission planning to manufacturing, reshaping industrial geography in the 2000s and 2010s."
    },
    {
        "name": "Old City of Damascus",
        "category": "Gold",
        "requires": [
            {
                "type": "technology",
                "name": "Commerce"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 6
            }
        ],
        "description": "The Old City of Damascus occupies an oasis on the Barada River and preserves an urban fabric spanning three millennia. Aram-Damascus rulers formed an early polity that traded across Syria and the Levant until Neo-Assyrian conquest in the eighth century BCE. Under the Achaemenids and Seleucids, roads linked the city to imperial networks and caravan routes. Roman and Byzantine periods fixed gates, streets, and markets that underpin the later plan. Damascus became the Umayyad capital in 661, and the Great Mosque arose on a former temple site, anchoring quarters of artisans and merchants. Caravans from Mesopotamia and Arabia made it a staging point on Silk Road branches and pilgrimage roads to Mecca. Mamluk and Ottoman administrations added khans and covered souqs, including Khan As’ad Pasha. Craft guilds, metalwork, and textiles sustained prosperity into the modern era. The walled city reflects layered governance, commerce, and religious institutions in a continuous urban settlement."
    },
    {
        "name": "Tomb of Mausolus",
        "category": "Gold",
        "requires": [
            {
                "type": "technology",
                "name": "Drama"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 250,
                "for": [
                    {
                        "type": "concept",
                        "name": "Era"
                    }
                ]
            }
        ],
        "description": "The Tomb of Mausolus at Halicarnassus, built ca. 353–350 BCE, was the dynastic monument of the Carian ruler Mausolus and his successor Artemisia II. Ancient sources credit architects Satyros and Pythius and sculptors including Scopas, Bryaxis, Timotheus, and Leochares. Rising on a high podium with a colonnaded peristyle and pyramidal roof, it reached an estimated height of about 45 meters. The structure influenced Hellenistic and Roman funerary design and lent its patron’s name to the generic term mausoleum. Earthquakes damaged the building in late antiquity and the Middle Ages; the Knights Hospitaller reused stone for Bodrum Castle in the fifteenth century. Surviving reliefs and fragments inform reconstructions of its form and decorative program."
    },
    {
        "name": "Bazaar of Istanbul",
        "category": "Gold",
        "requires": [
            {
                "type": "technology",
                "name": "Civil Service"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 3,
                "for": [
                    {
                        "type": "concept",
                        "name": "Trade Route"
                    }
                ]
            }
        ],
        "description": "The Grand Bazaar of Istanbul (Kapalıçarşı) is a vast market complex created after the Ottoman conquest in 1453 and enlarged through the sixteenth century. Its core bedestens housed high-value goods and secure storage, while surrounding streets specialized by craft under guild regulation. Hans and caravanserais provided lodging and wholesale spaces for merchants from Anatolia, the Balkans, and the Mediterranean. Money changers, jewelers, and goldsmiths anchored the city’s coin exchange and luxury trade. Repeated fires and earthquakes led to rebuilding with vaulted, covered passages. The bazaar linked maritime trade at the Golden Horn with overland routes into the empire’s interior, sustaining Istanbul’s role as a financial and commercial center well into the modern era."
    },
    {
        "name": "Uffizi",
        "category": "Gold",
        "requires": [
            {
                "type": "technology",
                "name": "Banking"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 5,
                "for": [
                    {
                        "category": "building",
                        "name": "Culture"
                    }
                ]
            }
        ],
        "description": "The Uffizi in Florence began in 1560 as administrative offices for Cosimo I de’ Medici, designed by Giorgio Vasari along the Arno. The elevated Vasari Corridor, completed in 1565, connected the complex to Palazzo Vecchio and Palazzo Pitti. Medici collections of antiquities, paintings, and drawings were arranged in the upper galleries by the late sixteenth century. The space evolved into a public museum in the eighteenth century and became a model for curated national schools of art. Today the Uffizi houses works by Botticelli, Leonardo, Michelangelo, and many others, documenting Renaissance patronage and workshop practice. The building’s linear plan and riverfront loggias frame one of Europe’s earliest purpose-adapted gallery environments."
    },
    {
        "name": "Empire State Building",
        "category": "Gold",
        "requires": [
            {
                "type": "technology",
                "name": "Art Deco"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 6,
                "for": [
                    {
                        "category": "building",
                        "name": "Production"
                    }
                ]
            }
        ],
        "description": "Completed in 1931, the Empire State Building epitomized New York’s Art Deco skyline during the Great Depression. Designed by Shreve, Lamb & Harmon, it rose 102 stories in a rapid, tightly scheduled build that employed thousands. It won the early skyscraper height race and served as a marker of recovery-era ambition. The building’s observation decks drew steady tourism revenue, while the mooring mast became a broadcast antenna for radio and television. Office leasing ebbed in the 1930s but stabilized with mid-century corporate tenants. The tower gained landmark status and underwent major retrofits for safety and energy efficiency. It remains a mixed-use commercial property known for nighttime illumination marking civic events and holidays, and for enduring use as a communications hub and visitor destination."
    },
    {
        "name": "TSMC",
        "category": "Gold",
        "requires": [
            {
                "type": "technology",
                "name": "Semiconductors"
            },
            {
                "type": "concept",
                "name": "Flat Land"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 3,
                "for": [
                    {
                        "category": "building",
                        "name": "Science"
                    }
                ]
            }
        ],
        "description": "Taiwan Semiconductor Manufacturing Company, founded in 1987 by Morris Chang, established the pure-play foundry model that separated chip design from fabrication. By investing in leading process nodes and yield control, TSMC became the primary manufacturer for advanced logic, producing 7 nm, 5 nm, and 3 nm chips with extreme ultraviolet lithography. Clients include Apple, AMD, Nvidia, and many fabless firms. The company built large fabs at Hsinchu and Tainan, expanded advanced packaging such as CoWoS, and pursued overseas sites in Arizona and Japan to bolster supply security. Its scale and process reliability reshaped global electronics, from smartphones to data centers. TSMC’s dominance in contract manufacturing made it a strategic actor in geopolitics, standard setting, and supply-chain resilience, anchoring the modern semiconductor ecosystem."
    },
    {
        "name": "Stonehenge",
        "category": "Science",
        "requires": [
            {
                "type": "technology",
                "name": "Calendar"
            },
            {
                "type": "concept",
                "name": "Flat Land"
            }
        ],
        "yields": [
            {
                "name": "Science",
                "value": 6
            }
        ],
        "description": "Stonehenge is a prehistoric stone circle on Salisbury Plain constructed in several phases from the late Neolithic into the Early Bronze Age. Its sarsen trilithons and bluestone circles align with solar events, most notably the summer solstice sunrise and winter solstice sunset. Bluestones likely came from the Preseli Hills and were rearranged during later Beaker-period activity. The monument formed part of a ritual landscape that included the Avenue processional route and nearby timber circles at Durrington Walls. Archaeology reveals cremation burials, animal feasting, and long-distance connections. Interpretation centers on observatory functions, ritual gatherings, and elite commemoration within a changing social order of the third millennium BCE."
    },
    {
        "name": "Library of Alexandria",
        "category": "Science",
        "requires": [
            {
                "type": "technology",
                "name": "Alphabet"
            }
        ],
        "yields": [
            {
                "name": "Science",
                "value": 2,
                "for": [
                    {
                        "type": "concept",
                        "name": "Trade Route"
                    }
                ]
            }
        ],
        "description": "The Library and Mouseion of Alexandria arose under the early Ptolemies in the third century BCE as a royal research complex. It pursued universal collection by copying scrolls from visiting ships and commissioning translations, notably of Greek, Egyptian, and Near Eastern works. Scholars such as Zenodotus and Callimachus created catalogs and critical editions; Euclid’s Elements circulated here; and Eratosthenes measured Earth’s circumference and mapped the oikoumene. The library functioned with stipends, lecture halls, and laboratories supported by the Hellenistic court. Its collections suffered through fires, neglect, and political upheaval over centuries. Though the institution declined, its methods in philology, bibliography, and scientific inquiry shaped later libraries and learned academies."
    },
    {
        "name": "House of Wisdom",
        "category": "Science",
        "requires": [
            {
                "type": "technology",
                "name": "Optics"
            }
        ],
        "yields": [
            {
                "name": "Science",
                "value": 4,
                "for": [
                    {
                        "type": "concept",
                        "name": "Trade Route"
                    }
                ]
            }
        ],
        "description": "Baghdad’s House of Wisdom (Bayt al-Hikma) flourished under the Abbasids, especially during the reign of al-Ma’mun in the ninth century. It combined a translation bureau, library, and research workshops that rendered Greek, Syriac, and Persian texts into Arabic. Hunayn ibn Ishaq led medical translations; mathematicians such as al-Khwarizmi formalized algebra and numerals; and astronomers improved tables and organized observations. Paper manufacture supported book culture and dissemination. The institution also trained scholars and hosted debates across theology, law, and natural philosophy. Mongol conquest in 1258 devastated Baghdad, but the translation movement’s corpus spread to Cairo, Andalusia, and later into Latin Europe, sustaining classical learning and original Islamic science."
    },
    {
        "name": "Oxford University",
        "category": "Science",
        "requires": [
            {
                "type": "technology",
                "name": "Education"
            }
        ],
        "specials": [
            "Choose Free Technology"
        ],
        "description": "Oxford University emerged by the late twelfth century, catalyzed by the 1167 prohibition on English students attending the University of Paris. Colleges developed as endowed residential communities that structured teaching, discipline, and patronage. Medieval Oxford specialized in scholastic theology, law, and arts. From the seventeenth century it became a center of experimental science: Robert Boyle and Robert Hooke worked with air pumps and microscopes; the Ashmolean Museum opened in 1683 as a teaching collection and laboratory site. Oxford later expanded laboratories, publishing, and professional schools, contributing to chemistry, physics, medicine, and the humanities. The university’s collegiate governance, libraries, and museums sustained continuous scholarship, training generations of researchers linked to national and imperial administrations, learned societies, and Nobel-era science."
    },
    {
        "name": "Bell Labs",
        "category": "Science",
        "requires": [
            {
                "type": "technology",
                "name": "Atomic Theory"
            }
        ],
        "specials": [
            "Choose Free Technology"
        ],
        "description": "Bell Telephone Laboratories, founded in 1925 by AT&T and Western Electric, became the archetype of large industrial research. At Murray Hill and other sites it integrated physics, materials, mathematics, and systems engineering with manufacturing. In 1947, Bardeen, Brattain, and Shockley created the transistor, transforming electronics. Claude Shannon’s 1948 paper founded information theory. Teams advanced microwave relay, satellite communications, and the laser. Bell Labs produced the solar cell, the charge-coupled device, and Unix and the C language, linking theory to deployable systems. Researchers earned multiple Nobel Prizes. After the breakup of AT&T, the labs evolved through Lucent and later Nokia. Its model of long-horizon, mission-oriented research influenced corporate and national laboratories worldwide."
    },
    {
        "name": "CERN",
        "category": "Science",
        "requires": [
            {
                "type": "technology",
                "name": "Microchips"
            }
        ],
        "specials": [
            "Choose Free Technology"
        ],
        "description": "Founded in 1954, CERN unified European high-energy physics around shared accelerators and open collaboration. Its facilities progressed from the Proton Synchrotron and Super Proton Synchrotron to the Large Hadron Collider, the world’s highest-energy machine. Detectors such as ATLAS and CMS recorded proton-proton collisions that confirmed the Higgs boson in 2012. Earlier experiments at the SPS discovered the W and Z bosons in 1983, validating electroweak theory. CERN also incubated the World Wide Web through Tim Berners-Lee’s work in 1989–91, facilitating global scientific data exchange. The laboratory trains thousands of physicists and engineers, develops superconducting magnets and distributed computing, and operates as a diplomatic venue for sustained international technical cooperation."
    },
    {
        "name": "Göbekli Tepe",
        "category": "Growth",
        "requires": [
            {
                "type": "technology",
                "name": "Tradition"
            },
            {
                "type": "elevation",
                "name": "Hill"
            }
        ],
        "yields": [
            {
                "name": "Citizen Slot",
                "value": 2,
                "for": [
                    {
                        "type": "concept",
                        "name": "Building"
                    }
                ]
            }
        ],
        "description": "Göbekli Tepe in southeastern Anatolia dates to the tenth–ninth millennia BCE and preserves monumental ritual architecture before widespread agriculture. Circular and oval enclosures contain T-shaped limestone pillars carved with foxes, snakes, birds, and abstract signs. Construction and backfilling occurred in multiple phases, suggesting successive ceremonial episodes. Faunal remains show communal feasting on hunted game, while obsidian indicates long-distance exchange. The site implies organized labor, craft specialization, and ritual practices among hunter-gatherers of the Pre-Pottery Neolithic. Its discovery altered models of Neolithic social complexity, showing that large sanctuaries and regional networks emerged early in the transition toward settled life."
    },
    {
        "name": "Granary of Harappa",
        "category": "Growth",
        "requires": [
            {
                "type": "technology",
                "name": "Currency"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 2,
                "for": [
                    {
                        "category": "improvement",
                        "name": "Farm"
                    }
                ]
            }
        ],
        "description": "The so-called Granary at Harappa in the Indus Valley Civilization consists of brick platforms with ventilation channels near the citadel mound, dated to the third millennium BCE. Its scale suggests centralized storage and handling of agricultural surplus that supported urban populations and craft specialists. Standardized bricks and modular bays reflect Indus planning principles visible across the city. The complex sat by major thoroughfares and likely interfaced with carts and riverine transport. Scholars debate its exact function, but its design suits bulk storage and grain processing. Such facilities underpinned stable provisioning, taxation in kind, and trade across the Punjab and Sindh plains until urban decline after 1900 BCE."
    },
    {
        "name": "Lofotr Longhouse",
        "category": "Growth",
        "requires": [
            {
                "type": "technology",
                "name": "Crop Rotation"
            },
            {
                "type": "terrain",
                "name": "Tundra"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 4,
                "for": [
                    {
                        "category": "improvement",
                        "name": "Camp"
                    },
                    {
                        "category": "improvement",
                        "name": "Pasture"
                    }
                ]
            }
        ],
        "description": "The Lofotr longhouse at Borg on Vestvågøy reconstructs a chieftain’s hall from the Viking Age. Timber frames, turf insulation, and a central hearth created a durable dwelling adapted to Arctic winds and long winters. The hall combined residence, storage, and craft spaces for a farming and herding economy that relied on barley, hay, dairy, and preserved fish. Seasonal pasturing and boat access linked the farm to cod fisheries and exchange routes across the North Atlantic and the Baltic. Feasting, oath-taking, and legal assemblies reinforced authority within the building’s great room. Comparable longhouses anchored Norse farmsteads in Norway, Iceland, and the North Atlantic colonies, supporting expansion into marginal environments through mixed agriculture, husbandry, and trade."
    },
    {
        "name": "Machu Picchu",
        "category": "Growth",
        "requires": [
            {
                "type": "technology",
                "name": "Cold Steel"
            },
            {
                "type": "concept",
                "name": "Mountains"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 5,
                "for": [
                    {
                        "type": "concept",
                        "name": "Mountains"
                    }
                ]
            }
        ],
        "description": "Machu Picchu is a 15th-century Inca citadel attributed to Pachacuti. Built on a ridge above the Urubamba, it uses terraces, drainage, and canals to stabilize slopes and irrigate fields. Finely jointed ashlar defines ritual precincts such as the Sun Temple and Intihuatana. Residential sectors, storehouses, and stairways integrate with the Inca road network that links the site to Cusco. The complex likely served as a royal estate and ceremonial center, with controlled access and agricultural support areas. Abandoned in the 16th century, it remained locally known until Hiram Bingham publicized it in 1911. Its preservation and study have clarified imperial labor organization, high-altitude engineering, and pilgrimage in the Late Horizon Andes."
    },
    {
        "name": "Union Stockyards",
        "category": "Growth",
        "requires": [
            {
                "type": "technology",
                "name": "Railroad"
            },
            {
                "type": "terrain",
                "name": "Plains"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 6,
                "for": [
                    {
                        "category": "improvement",
                        "name": "Camp"
                    },
                    {
                        "category": "improvement",
                        "name": "Pasture"
                    }
                ]
            }
        ],
        "description": "Opened in 1865, the Chicago Union Stock Yards centralized Midwestern livestock markets by tying rail lines to vast pens, slaughterhouses, and rendering plants. Packing firms such as Armour and Swift adopted chilled railcars and the disassembly-line, lowering costs and standardizing cuts for expanding urban consumers. The complex drew immigrant labor and spawned allied industries, including soap, fertilizer, and hide processing. Upton Sinclair’s The Jungle (1906) exposed conditions that helped prompt federal meat inspection and food safety laws. Peak throughput in the early 20th century made Chicago the hub of the U.S. meat trade. Trucking, suburban plants, and changing regulation drove decline; the yards closed in 1971, leaving a template for integrated logistics in agri-food systems."
    },
    {
        "name": "Central de Abastos",
        "category": "Growth",
        "requires": [
            {
                "type": "technology",
                "name": "Online Economy"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 2
            }
        ],
        "description": "Mexico City’s Central de Abastos is a vast wholesale market opened in 1982 to consolidate regional food flows for a metropolis. Warehouses, cold rooms, and intermodal docks channel produce, grains, meat, and seafood from farms to retailers and street vendors. In the 2000s and 2010s, operators adopted barcode tracking, online auctions, and route-optimization platforms to manage volumes and reduce spoilage. Finance, brokerage, and sanitation services are embedded on-site, creating an ecosystem that stabilizes prices and supply during shocks. Comparable hubs, such as Rungis in Paris, share this model of centralized distribution. The market’s digitized logistics and marketplace services illustrate how mega-cities sustain daily provisioning at scale while integrating small producers into formal supply chains."
    },
    {
        "name": "Parthenon",
        "category": "Culture",
        "requires": [
            {
                "type": "technology",
                "name": "Democracy"
            },
            {
                "type": "elevation",
                "name": "Hill"
            }
        ],
        "yields": [
            {
                "name": "Culture",
                "value": 9
            }
        ],
        "description": "Constructed 447–432 BCE on the Athenian Acropolis, the Parthenon is a Doric temple with Ionic elements dedicated to Athena Parthenos. Architects Iktinos and Kallikrates employed subtle refinements—entasis, inclined columns, and a curved stylobate—to correct optical effects. Phidias directed the sculptural program, including the chryselephantine cult statue, metopes, and the frieze depicting the Panathenaic procession. The building served as a treasury for the Delian League and as a stage for civic rituals. It later functioned as a church and mosque. In 1687 an explosion during a Venetian bombardment damaged the structure; in the 19th century the Elgin Marbles were removed to Britain. Conservation and study continue to inform understanding of classical architecture and Athenian statecraft."
    },
    {
        "name": "Shakespeare's Theater",
        "category": "Culture",
        "requires": [
            {
                "type": "technology",
                "name": "Theater"
            }
        ],
        "yields": [
            {
                "name": "Culture",
                "value": 25,
                "type": "percent",
                "for": [
                    {
                        "type": "special",
                        "name": "All cities"
                    }
                ]
            }
        ],
        "description": "Shakespeare’s theater refers chiefly to the Globe, the open-air playhouse erected in 1599 by the Lord Chamberlain’s Men on London’s Bankside. Its polygonal, timber-framed structure featured a thrust stage, tiring house, and galleries accommodating diverse audiences, from groundlings to gentry. The repertory company model enabled rapid rotation of plays by Shakespeare and contemporaries such as Marlowe and Jonson. Performances relied on daylight, minimal scenery, and rich language, supported by music and stage effects. The Globe burned in 1613 during Henry VIII, was rebuilt in 1614, and closed by ordinance in 1642. Texts circulated in quartos and the 1623 First Folio. A modern reconstruction opened in 1997, restoring performance practice and public engagement."
    },
    {
        "name": "Louvre",
        "category": "Culture",
        "requires": [
            {
                "type": "technology",
                "name": "Art History"
            }
        ],
        "yields": [
            {
                "name": "Culture",
                "value": 100,
                "type": "percent"
            }
        ],
        "description": "The Louvre began as a 12th-century fortress under Philip II and evolved into a royal palace through Renaissance and Baroque expansions by architects including Lescot and Lemercier. After 1682 the court’s move to Versailles freed the complex for galleries and academies. In 1793, during the French Revolution, it opened as a public museum, advancing the idea of state stewardship of art. Collections grew through royal holdings, Napoleonic seizures and restitutions, archaeology, and modern acquisitions, spanning antiquities to Renaissance masters. The 1989 glass Pyramid by I. M. Pei reoriented circulation for mass visitation. The Louvre’s scale, cataloging, and conservation laboratories set benchmarks that shaped museum practice worldwide."
    },
    {
        "name": "Hollywood",
        "category": "Culture",
        "requires": [
            {
                "type": "technology",
                "name": "Radio"
            }
        ],
        "yields": [
            {
                "name": "Culture",
                "value": 5,
                "for": [
                    {
                        "type": "special",
                        "name": "All cities"
                    }
                ]
            }
        ],
        "description": "Hollywood developed in the 1910s as American film producers moved to Southern California for reliable light, varied locations, and distance from patent litigation. By the 1920s the studio system integrated production, distribution, and exhibition, exporting films worldwide. The transition to sound after 1927 reshaped labor and genres, while the Hays Code governed content. Stars, guilds, and publicity forged a powerful culture industry. Radio and later television networks extended talent and formats. The 1948 Paramount decision weakened vertical integration, but overseas markets and Cold War soft power sustained influence. New Hollywood in the 1970s and the blockbuster era in the 1980s renewed profitability. Today the region anchors global filmmaking, visual effects, and streaming production, while the Academy Awards formalize its prestige."
    },
    {
        "name": "Sydney Opera House",
        "category": "Culture",
        "requires": [
            {
                "type": "technology",
                "name": "Transistors"
            }
        ],
        "yields": [
            {
                "name": "Culture",
                "value": 20
            }
        ],
        "description": "Designed by Jørn Utzon with engineering by Ove Arup, the Sydney Opera House was built 1959–1973 on Bennelong Point. Its ribbed concrete shells and precast tile cladding housed multiple venues, including the Concert Hall and Opera Theatre, arranged around a podium. The project advanced computational methods for shell geometry and acoustic design, despite political controversy and Utzon’s resignation. Opened in 1973, it became a central platform for opera, symphonic music, and festivals, and a broadcast stage during the 2000 Olympic cultural program. Subsequent renovations improved acoustics, access, and building services. Listed as a UNESCO World Heritage site in 2007, it remains a landmark of late modern architecture and performing arts infrastructure."
    },
    {
        "name": "Ggantija",
        "category": "Faith",
        "requires": [
            {
                "type": "technology",
                "name": "Copper Working"
            }
        ],
        "yields": [
            {
                "name": "Faith",
                "value": 6
            }
        ],
        "description": "Ggantija is a twin megalithic temple complex on Gozo, Malta, dated to c. 3600–3200 BCE. Dry-stone walls of massive coralline limestone orthostats enclose apsidal chambers with altars and hearths, organized along a central axis. The structures likely hosted communal rites tied to seasonal cycles and ancestral veneration. Excavations in the 19th and 20th centuries documented ritual deposits and distinctive ceramics of the Maltese Temple culture. The site predates Stonehenge and the Egyptian pyramids and illustrates advanced planning, quarrying, and cooperative labor in Neolithic island societies. Stabilization and presentation have made Ggantija a key reference for early Mediterranean monumentality and ritual architecture."
    },
    {
        "name": "Pantheon",
        "category": "Faith",
        "requires": [
            {
                "type": "technology",
                "name": "Construction"
            }
        ],
        "yields": [
            {
                "name": "Faith",
                "value": 9
            }
        ],
        "description": "The Pantheon in Rome was rebuilt under Hadrian between 118 and 128 CE, replacing an earlier Augustan temple. It combines a deep Corinthian portico with a vast rotunda in Roman concrete. The coffered dome spans about 43 meters and remains the largest unreinforced concrete dome of antiquity. An oculus of nearly 9 meters admits light and air, creating a controlled interior climate. Dedicated to all the gods, it later became the church of Santa Maria ad Martyres in 609, ensuring continuous use and preservation. The building hosted imperial rituals and, in the modern era, burials of figures such as Raphael and Italian monarchs. Its proportions and engineering influenced Renaissance and neoclassical architecture, informing designs from Brunelleschi’s investigations to Jefferson’s Rotunda."
    },
    {
        "name": "Notre Dame",
        "category": "Faith",
        "requires": [
            {
                "type": "technology",
                "name": "Buttress"
            }
        ],
        "gains": [
            {
                "type": "concept",
                "name": "Dogma",
                "value": 2
            }
        ],
        "description": "Notre-Dame de Paris, begun in 1163 and largely completed by the mid-14th century, anchors the Île de la Cité. It advanced Gothic engineering through rib vaults, flying buttresses, and large rose windows, allowing soaring naves and extensive glazing. The cathedral served medieval liturgy, royal ceremonies, and civic gatherings. It hosted the coronation of Napoleon in 1804 and state Te Deums. Revolutionary desecration in the 1790s led to loss of statuary and treasure. Eugène Viollet-le-Duc directed a major restoration in the 19th century, refining the spire and sculpture program. A 2019 fire damaged the roof and spire; stabilization and reconstruction followed. Notre-Dame remains a central monument of Gothic architecture and urban identity, binding sacred function to national history."
    },
    {
        "name": "Taj Mahal",
        "category": "Faith",
        "requires": [
            {
                "type": "technology",
                "name": "Architecture"
            }
        ],
        "yields": [
            {
                "name": "Faith",
                "value": 2,
                "for": [
                    {
                        "type": "concept",
                        "name": "Building"
                    }
                ]
            }
        ],
        "description": "The Taj Mahal, built by Mughal emperor Shah Jahan from 1632 to about 1653, is a monumental mausoleum for Empress Mumtaz Mahal at Agra. It fuses Persian, Timurid, and Indian traditions into a symmetrical complex organized by a charbagh garden. The white marble tomb bears pietra dura inlays, calligraphy, and finely carved reliefs. A bulbous dome, four minarets, and a platform overlooking the Yamuna River define the silhouette. Auxiliary buildings, including a mosque and guest house, complete the ensemble. The site hosted courtly ceremonial visits and later drew devotional pilgrimage. Its precise geometry and controlled ornament became a model for imperial funerary design across the subcontinent. Conservation under colonial and postcolonial regimes secured its fabric and global stature."
    },
    {
        "name": "Cristo Redentor",
        "category": "Faith",
        "requires": [
            {
                "type": "technology",
                "name": "Mass Media"
            },
            {
                "type": "terrain",
                "name": "Coast"
            }
        ],
        "yields": [
            {
                "name": "Faith",
                "value": 1
            }
        ],
        "description": "Cristo Redentor crowns Mount Corcovado above Rio de Janeiro. Completed in 1931, the 30-meter Art Deco statue stands on an 8-meter pedestal with a 28-meter arm span. Engineer Heitor da Silva Costa oversaw the project; sculptor Paul Landowski and collaborators shaped the figure. Reinforced concrete and soapstone cladding provided durability in a marine climate. The monument arose from a 1920s initiative to mark Brazil’s Christian heritage in a modern capital. It quickly became a major pilgrimage and tourism site, hosting religious services and national celebrations. Periodic restorations addressed lightning damage and weathering, with significant campaigns in 2010 and the 2020s. Cristo Redentor functions as a navigational landmark, a public gathering point, and a global image of Rio’s skyline."
    },
    {
        "name": "Sagrada Familia",
        "category": "Faith",
        "requires": [
            {
                "type": "technology",
                "name": "Vertical Flight"
            }
        ],
        "yields": [
            {
                "name": "Faith",
                "value": 2
            }
        ],
        "description": "The Basílica de la Sagrada Família in Barcelona began in 1882 and became Antoni Gaudí’s life work from 1883 until 1926. It synthesizes Gothic verticality with catenary geometries, branching columns, and facades dense with biblical narrative. The Nativity façade and parts of the crypt and apse are Gaudí-era fabric. Later architects completed the Passion façade and interior. In the 21st century, computer modeling, CNC milling, and prefabricated stone accelerated construction, translating Gaudí’s models into buildable forms. Pope Benedict XVI consecrated the basilica in 2010. Ongoing works aim to complete the main towers, integrating advanced engineering with conservation of historic elements. The site hosts mass, cultural events, and heavy tourism, linking modern construction practice to a long devotional program."
    },
    {
        "name": "Hanging Gardens",
        "category": "Health",
        "requires": [
            {
                "type": "technology",
                "name": "Mathematics"
            },
            {
                "type": "concept",
                "name": "Fresh Water"
            }
        ],
        "yields": [
            {
                "name": "Health",
                "value": 9
            }
        ],
        "description": "The Hanging Gardens are a famed ancient Near Eastern wonder described as terraced greenery irrigated above city level. Classical sources such as Berossus and Diodorus place them in Babylon, possibly under Nebuchadnezzar II, while modern scholarship has proposed a location at Nineveh under Sennacherib. The scheme combined stone or mudbrick terraces, waterproofing, and mechanical water-lifting, perhaps chain pumps, to sustain trees and medicinal plants. Such gardens improved shade, air quality, and urban comfort for elites and attendants. Although their precise site remains unverified archaeologically, the concept reflects advanced hydraulic management in arid climates. The legend influenced later royal gardens and informed modern reconstructions of Mesopotamian engineering, framing ancient landscaping as both display and public-health amenity."
    },
    {
        "name": "Angkor Wat",
        "category": "Health",
        "requires": [
            {
                "type": "technology",
                "name": "Divine Right"
            },
            {
                "type": "feature",
                "name": "Jungle"
            }
        ],
        "yields": [
            {
                "name": "Health",
                "value": 4,
                "for": [
                    {
                        "type": "special",
                        "name": "All cities"
                    }
                ]
            }
        ],
        "description": "Angkor Wat was built in the early 12th century under Suryavarman II as a Vishnu temple and royal mausoleum. Its axial plan, five-towered central temple, and extensive bas-reliefs embody Khmer statecraft and cosmology. A surrounding moat and causeways interface with Angkor’s broader hydraulic network of barays and canals, which moderated floods, supported agriculture, and enhanced urban health. From the 14th century, the complex transitioned to Buddhist monastic use. European accounts in the 19th century and French conservation initiatives reintroduced Angkor to global scholarship. Modern restoration stabilizes sandstone, relieves structural loads, and manages water. Angkor Wat today is a key case in tropical monument conservation and the study of ancient urban resilience built on engineered water systems."
    },
    {
        "name": "Embankment",
        "category": "Health",
        "requires": [
            {
                "type": "technology",
                "name": "Medicine"
            },
            {
                "type": "concept",
                "name": "Major River"
            }
        ],
        "yields": [
            {
                "name": "Health",
                "value": 3,
                "for": [
                    {
                        "type": "concept",
                        "name": "Building"
                    }
                ]
            }
        ],
        "description": "An embankment is a reinforced riverbank or waterfront constructed to control flooding, stabilize channels, and improve sanitation. Typical works combine retaining walls, revetments, pile foundations, and drainage to protect streets and quays. In the 18th century, St. Petersburg installed granite-faced embankments along the Neva to secure a low-lying delta capital. Paris extended stone quays on the Seine to rationalize traffic and reduce bank erosion. Such projects curbed waterborne disease by separating sewage from open banks and enabling controlled outfalls. They also improved navigation and urban circulation. Later periods added utilities, rail, and promenades atop embankments, but the Enlightenment era established their civic and hygienic role in European river cities."
    },
    {
        "name": "Prora",
        "category": "Health",
        "requires": [
            {
                "type": "technology",
                "name": "Antibiotics"
            },
            {
                "type": "terrain",
                "name": "Coast"
            }
        ],
        "yields": [
            {
                "name": "Health",
                "value": 2,
                "for": [
                    {
                        "type": "special",
                        "name": "All cities"
                    }
                ]
            }
        ],
        "description": "Prora is a monumental seaside resort on Rügen initiated by the Nazi “Kraft durch Freude” program. Designed by Clemens Klotz after a 1936 competition, its linear blocks provided up to 20,000 beds facing the Baltic. The complex promoted regimented leisure to strengthen worker health and morale. Construction halted with the Second World War. In the German Democratic Republic, parts served as military barracks and training facilities. After reunification, the site underwent adaptive reuse, including hostels, residences, and a museum. The concrete frame and repetitive bays exemplify interwar mass tourism planning. Prora’s history tracks shifts from authoritarian social policy to postindustrial redevelopment, while preserving a rare, large-scale artifact of planned health-oriented recreation."
    },
    {
        "name": "Human Genome Project",
        "category": "Health",
        "requires": [
            {
                "type": "technology",
                "name": "Genetics"
            }
        ],
        "yields": [
            {
                "name": "Health",
                "value": 4,
                "for": [
                    {
                        "category": "building",
                        "name": "Health",
                        "special": "All cities"
                    }
                ]
            }
        ],
        "description": "The Human Genome Project (1990–2003) was an international initiative to map and sequence the human genome. The U.S. NIH and DOE coordinated efforts with the Sanger Centre and partners in Europe and Asia. Large-insert BAC libraries, automated Sanger sequencing, and hierarchical assembly produced a draft in 2001 and a high-quality reference in 2003. The Bermuda Principles mandated rapid public data release, accelerating tool development and comparative genomics. The project funded an ELSI program to study ethical, legal, and social effects. Its reference maps enabled genome-wide association studies, copy-number analyses, and clinical gene panels. Later consortia refined gaps and haplotypes, culminating in near-complete assemblies in the 2020s. The HGP transformed biomedicine by standardizing genomic resources for research and precision medicine."
    },
    {
        "name": "Newgrange",
        "category": "Happiness",
        "requires": [
            {
                "type": "technology",
                "name": "Wheel"
            },
            {
                "type": "concept",
                "name": "Flat Land"
            }
        ],
        "yields": [
            {
                "name": "Happiness",
                "value": 2,
                "for": [
                    {
                        "type": "special",
                        "name": "All cities"
                    }
                ]
            }
        ],
        "description": "Newgrange is a Neolithic passage tomb within the Bru na Boinne complex in County Meath, Ireland, constructed c. 3200 BCE. A large earthen mound encases a corbelled stone chamber reached by a narrow passage. A roofbox admits the rising sun at the winter solstice, projecting light to the chamber floor and marking a calendrical event. Kerbstones and orthostats bear megalithic art, indicating ritual investment and skilled labor. Excavations by M. J. O'Kelly (1962-1975) clarified building phases and solstice alignment. The monument likely combined elite interment, ancestor rites, and seasonal observances tied to agriculture. Nearby mounds at Knowth and Dowth form an integrated ritual landscape along the Boyne. Since the 20th century, controlled access and research have preserved the site, while annual solstice observations continue under oversight."
    },
    {
        "name": "Colosseum",
        "category": "Happiness",
        "requires": [
            {
                "type": "technology",
                "name": "Sports"
            }
        ],
        "yields": [
            {
                "name": "Happiness",
                "value": 9
            }
        ],
        "description": "The Colosseum, or Flavian Amphitheatre, was erected in Rome under Vespasian and Titus, c. 72-80 CE, with additions by Domitian. It is an elliptical concrete-and-stone arena with tiered seating, complex vomitoria, and service corridors. The arena floor covered the hypogeum, a substructure of cages, lifts, and scenery devices for animal hunts, executions, and gladiatorial combats staged before tens of thousands. Early spectacles occasionally simulated naval battles, though water management remains debated. The venue functioned within imperial gift politics and urban spectacle through the third century. Earthquakes, quarrying, and medieval reuse altered the structure; later papal efforts stabilized key arches. Antiquarian interest and excavation from the 18th century documented inscriptions and mechanics. Today it stands as a principal survival of Roman entertainment architecture and a reference for amphitheatre design."
    },
    {
        "name": "Porcelain Tower",
        "category": "Happiness",
        "requires": [
            {
                "type": "technology",
                "name": "Chivalry"
            }
        ],
        "yields": [
            {
                "name": "Happiness",
                "value": 4,
                "for": [
                    {
                        "type": "special",
                        "name": "All cities"
                    }
                ]
            }
        ],
        "description": "The Porcelain Tower of Nanjing, a pagoda of the Bao'en Temple complex, was constructed in the early 15th century during the Ming dynasty, traditionally linked to the Yongle and Xuande reigns. Its octagonal, multi-storied form employed glazed white porcelain bricks set with colored inlays that caught daylight and lantern light. The tower served Buddhist devotion and monastic activity while also guiding river traffic along the Yangtze corridor as a conspicuous landmark. European travelers of the 17th-18th centuries celebrated its height and finish in travel accounts. The Taiping Rebellion led to its destruction in the 1850s, leaving foundations and fragments. In the 21st century, a modern reconstruction program reestablished parts of the temple precinct, recalling the pagoda's profile. The monument remains a key case of Ming architectural craft and religious patronage."
    },
    {
        "name": "Luxembourg Garden",
        "category": "Happiness",
        "requires": [
            {
                "type": "technology",
                "name": "Opera"
            },
            {
                "type": "concept",
                "name": "Fresh Water"
            }
        ],
        "yields": [
            {
                "name": "Happiness",
                "value": 2,
                "for": [
                    {
                        "type": "concept",
                        "name": "Building"
                    }
                ]
            }
        ],
        "description": "The Luxembourg Garden (Jardin du Luxembourg) developed from 1612 around the Luxembourg Palace in Paris at the initiative of Marie de Medici. Early layouts combined Italianate terraces with French parterres and tree-lined walks suited to courtly display and promenade. The Medici Fountain, later extended, anchored the garden's axial composition. Over the 18th and 19th centuries, the grounds were reconfigured as the city expanded, introducing lawns, allees, sculpture programs, and facilities for public leisure. Administration by the French Senate maintained horticultural collections and nurseries that supplied Parisian plantings. The garden offered a model for urban amenity and civic strolling culture, informing later park design in Europe. It remains a central open space on the Left Bank, linking the palace, museum functions, and neighborhood life through regulated public access."
    },
    {
        "name": "Neuschwanstein",
        "category": "Happiness",
        "requires": [
            {
                "type": "technology",
                "name": "Chemistry"
            },
            {
                "type": "elevation",
                "name": "Hill"
            }
        ],
        "yields": [
            {
                "name": "Happiness",
                "value": 4,
                "for": [
                    {
                        "type": "elevation",
                        "name": "Hill"
                    },
                    {
                        "type": "concept",
                        "name": "Mountains"
                    }
                ]
            }
        ],
        "description": "Neuschwanstein Castle was commissioned by King Ludwig II of Bavaria in 1869 as a romantic revival residence above Hohenschwangau. The design, by Christian Jank, Eduard Riedel, and later Georg von Dollmann, fused Romanesque motifs with modern materials, including steel and advanced services. Interiors drew on medieval German epics and Richard Wagner's operas, creating staged rooms such as the Singers' Hall and Throne Hall. Construction continued into the 1880s and remained incomplete at Ludwig's death in 1886. During the Second World War, the building stored art seized in occupied Europe, later recovered by Allied Monuments officers. Opened early to visitors, it became a major site of postwar tourism and heritage management in Bavaria. Its profile informed 20th-century castle imagery and conservation debates on historicist architecture."
    },
    {
        "name": "Burj Khalifa",
        "category": "Happiness",
        "requires": [
            {
                "type": "technology",
                "name": "Composites"
            }
        ],
        "yields": [
            {
                "name": "Happiness",
                "value": 4,
                "for": [
                    {
                        "type": "concept",
                        "name": "Trade Route"
                    }
                ]
            }
        ],
        "description": "Burj Khalifa, completed in 2010, is a supertall skyscraper in Dubai designed by Skidmore, Owings & Merrill with Adrian Smith as chief architect. The tower reaches 828 meters using a buttressed-core system organized around a Y-shaped plan. High-strength concrete, setback tiers, and tuned wind engineering enabled unprecedented height in a desert climate. The program combines hotel, residential, office, and observatory functions and anchors the Downtown Dubai development by Emaar Properties. Construction spanned 2004-2010 with global contracting and materials supply chains. Public events, including New Year light shows, established the building as a focal point for tourism and media. The project consolidated records for height and habitable floors and influenced later supertall planning in the Gulf and Asia through mixed-use clustering and podium districts."
    },
    {
        "name": "Pyramid of Djoser",
        "category": "Order",
        "requires": [
            {
                "type": "technology",
                "name": "Trade"
            },
            {
                "type": "feature",
                "name": "Flood Plain"
            }
        ],
        "yields": [
            {
                "name": "Order",
                "value": 2,
                "for": [
                    {
                        "type": "special",
                        "name": "All cities"
                    }
                ]
            }
        ],
        "description": "The Pyramid of Djoser at Saqqara, built c. 2667-2648 BCE for the Third Dynasty king, is the earliest large-scale stone pyramid in Egypt. Designed by the vizier Imhotep, it evolved from a mastaba into a six-step structure within a vast walled complex. Courts, dummy chapels, colonnaded corridors, and the Heb-Sed court structured royal ritual and posthumous cult. Fine limestone masonry and corbelled substructures protected the burial and storerooms. The complex centralized funerary administration under a specialized priesthood and signaled state capacity for organized labor, quarrying, and transport. Excavations and restorations since the 20th century have stabilized the collapse-prone burial chamber and clarified construction sequences. The monument set precedent for Old Kingdom pyramids at Meidum and Giza by establishing techniques of casing, orientation, and enclosure planning."
    },
    {
        "name": "Pyramids of Giza",
        "category": "Order",
        "requires": [
            {
                "type": "technology",
                "name": "Government"
            },
            {
                "type": "feature",
                "name": "Flood Plain"
            }
        ],
        "yields": [
            {
                "name": "Order",
                "value": 3,
                "for": [
                    {
                        "type": "special",
                        "name": "All cities"
                    }
                ]
            }
        ],
        "description": "The Giza pyramid complex comprises the Fourth Dynasty pyramids of Khufu, Khafre, and Menkaure, c. 2600-2500 BCE, with associated queens' pyramids, mastabas, causeways, and mortuary and valley temples. The Great Pyramid of Khufu, originally cased in fine Tura limestone, stood over 146 meters and remained the tallest human-made structure for millennia. Precise cardinal orientation, leveling, and modular stonework reflect advanced survey and management. A workers' settlement and provisioning facilities at Heit el-Ghurab show organized labor during Nile inundation seasons. The Great Sphinx and Khafre's complex frame the plateau's ritual approach. Quarry marks, boat pits, and papyri from Wadi al-Jarf inform logistics, transport, and provisioning. Medieval stripping and modern excavations transformed the site, which remains central to studies of Old Kingdom state power and funerary practice."
    },
    {
        "name": "Forbidden Palace",
        "category": "Order",
        "requires": [
            {
                "type": "technology",
                "name": "Township"
            },
            {
                "type": "concept",
                "name": "Flat Land"
            }
        ],
        "yields": [
            {
                "name": "Order",
                "value": 4,
                "for": [
                    {
                        "type": "special",
                        "name": "All cities"
                    }
                ]
            }
        ],
        "description": "The Forbidden Palace, commonly known as the Forbidden City, was constructed in Beijing between 1406 and 1420 for the Ming Yongle emperor. The palace-city enclosed the imperial household, central bureaucracy, archives, and ritual halls within moated walls and axial gates. The Hall of Supreme Harmony, Middle Harmony, and Preserving Harmony formed the ceremonial core for enthronements, New Year rites, and state receptions. Qing rulers maintained and adapted the complex until 1912, with periodic reconstructions after fires. Architectural typology emphasized timber framing, bracket sets, yellow-glazed tiles, and hierarchical courtyards aligned to cosmological planning. After the fall of the monarchy, the Palace Museum (est. 1925) curated collections and opened precincts to visitors. Twentieth-century conservation, including UNESCO designation, stabilized fabric and documentation, securing an unparalleled record of East Asian court architecture."
    },
    {
        "name": "Old Bailey",
        "category": "Order",
        "requires": [
            {
                "type": "technology",
                "name": "Bureaucracy"
            }
        ],
        "yields": [
            {
                "name": "Order",
                "value": 2,
                "for": [
                    {
                        "type": "concept",
                        "name": "Building"
                    }
                ]
            }
        ],
        "description": "The Old Bailey, formally the Central Criminal Court of England and Wales, developed beside Newgate Prison in the City of London. Rebuilt after the 1666 Great Fire, the courthouse hosted public jury trials that produced the published Old Bailey Proceedings (Sessions Papers) from 1674 to 1913, a key source on crime, policing, and legal practice. Architectural renewal in 1902-1907 by E. W. Mountford created the current domed building with improved courtrooms and custody arrangements. Proceedings there reflected evolving standards of evidence, defense counsel rights, and the transition from public corporal punishment to incarceration. Air raids in 1941 caused damage, followed by postwar repairs. Today the court hears serious criminal cases for Greater London, continuing a legal function that shaped modern adversarial procedure and urban judicial administration."
    },
    {
        "name": "Eiffel Tower",
        "category": "Order",
        "requires": [
            {
                "type": "technology",
                "name": "Electricity"
            }
        ],
        "yields": [
            {
                "name": "Order",
                "value": 3,
                "for": [
                    {
                        "type": "concept",
                        "name": "Building"
                    }
                ]
            }
        ],
        "description": "Built for the 1889 Exposition Universelle in Paris, the Eiffel Tower showcased the capabilities of wrought-iron lattice construction. Designed by the firm of Gustave Eiffel, with key work by Maurice Koechlin, Émile Nouguier, and architect Stephen Sauvestre, it rose to 300 meters using prefabricated iron pieces and hot-riveted joints. The structure faced criticism during planning but proved stable under wind through its open truss profile. It soon served scientific uses, including meteorology, aerodynamics, and pioneering radio transmissions that aided military and civil communication. Scheduled for dismantling after twenty years, it was retained for its utility and public appeal. During the First World War it hosted communications equipment; later it supported television broadcasting. The tower became a permanent fixture of Parisian infrastructure and a major draw for visitors."
    },
    {
        "name": "Great Firewall",
        "category": "Order",
        "requires": [
            {
                "type": "technology",
                "name": "Internet"
            }
        ],
        "yields": [
            {
                "name": "Order",
                "value": 4,
                "for": [
                    {
                        "category": "building",
                        "name": "Culture"
                    }
                ]
            }
        ],
        "description": "The Great Firewall is a nationwide system for controlling cross-border internet traffic in China, developed from the late 1990s as part of the Golden Shield Project. It integrates domain name poisoning, IP and URL blocking, keyword filtering, Server Name Indication filtering, deep packet inspection, and active probing. The system restricts access to services such as Google, Facebook, Twitter, and many foreign news sites, while allowing domestic platforms to operate under regulatory oversight. Controls intensify during politically sensitive periods, with rapid updates to blocklists and real-time filtering. Routing policies and peering arrangements support traffic management at scale. The project is coordinated across state agencies and network operators. It has shaped China’s information environment, market structure, and cybersecurity posture, and prompted the growth of circumvention tools and an extensive domestic content ecosystem."
    },
    {
        "name": "Oracle",
        "category": "Influence",
        "requires": [
            {
                "type": "technology",
                "name": "Organized Religion"
            },
            {
                "type": "elevation",
                "name": "Hill"
            }
        ],
        "yields": [
            {
                "name": "Influence",
                "value": 9
            }
        ],
        "description": "In the classical world an oracle was a sanctioned site where divination guided public and private decisions. The best known center was Delphi, where the Pythia delivered verse or prose responses interpreted by priests. Other Greek and Italic sanctuaries, such as Dodona and Cumae, offered similar services. City-states and rulers consulted before colonization, warfare, and legislation, exchanging offerings for ritual access. Responses were often terse and conditional, reflecting a long tradition of ambiguous phrasing. Famous cases include Croesus and the question of war with Persia. Oracles maintained archives, attracted pilgrims, and anchored regional economies. Their influence waned with changing religious and political structures in late antiquity."
    },
    {
        "name": "Alhambra",
        "category": "Influence",
        "requires": [
            {
                "type": "technology",
                "name": "Steel Smithing"
            },
            {
                "type": "elevation",
                "name": "Hill"
            }
        ],
        "yields": [
            {
                "name": "Influence",
                "value": 1
            }
        ],
        "description": "The Alhambra is a fortified palace complex of the Nasrid dynasty at Granada, developed mainly in the 13th to 15th centuries. It combines courtly residences, administrative spaces, and gardens with advanced hydraulic engineering. Key areas include the Comares Palace and the Palace of the Lions, noted for intricately carved stucco, muqarnas vaulting, epigraphic decoration, and controlled water flows in courts and channels. The complex functioned as a seat of rule, with chambers for council, audience, and ceremonial display. In 1492 the surrender of Granada transferred the site to the Catholic Monarchs, initiating adaptations such as the Renaissance palace of Charles V. From the 19th century, scholarly attention and restoration campaigns stabilized structures and surface decoration. Today the Alhambra illustrates late medieval Islamic governance, art, and landscape design in Iberia."
    },
    {
        "name": "Statue of Liberty",
        "category": "Influence",
        "requires": [
            {
                "type": "technology",
                "name": "Sanitation"
            },
            {
                "type": "terrain",
                "name": "Coast"
            }
        ],
        "yields": [
            {
                "name": "Influence",
                "value": 4,
                "for": [
                    {
                        "type": "concept",
                        "name": "Trade Route"
                    }
                ]
            }
        ],
        "description": "Conceived as a Franco-American project, the Statue of Liberty was designed by Frédéric-Auguste Bartholdi with structural engineering by Gustave Eiffel. Fabricated in France from hammered copper sheets over an iron armature, it was assembled on Bedloe’s Island (now Liberty Island) and dedicated in 1886. The pedestal, designed by Richard Morris Hunt, was funded by public subscription in the United States. The statue functioned as a lighthouse until 1902 and later underwent major restoration for its centennial in 1986. Positioned at the entrance to New York Harbor, it greeted transatlantic shipping and arrivals at nearby Ellis Island. The associated poem “The New Colossus” by Emma Lazarus, added to the pedestal in 1903, framed its public meaning. The monument is a landmark of industrial-era fabrication and transatlantic civic ideals."
    },
    {
        "name": "United Nations",
        "category": "Influence",
        "requires": [
            {
                "type": "technology",
                "name": "Plastics"
            }
        ],
        "yields": [
            {
                "name": "Influence",
                "value": 25,
                "type": "percent",
                "for": [
                    {
                        "type": "special",
                        "name": "All cities"
                    }
                ]
            }
        ],
        "description": "Founded in 1945 at the San Francisco Conference, the United Nations established a charter-based framework for collective security, diplomacy, and development. Its principal organs include the General Assembly, Security Council, ECOSOC, ICJ, and Secretariat, headquartered in New York. Early missions addressed crises in Suez, the Congo, and Cyprus, refining peacekeeping doctrine and logistics. The UN facilitated decolonization, promoted human rights through the 1948 Universal Declaration, and coordinated health and relief via WHO, UNICEF, and related agencies. Membership expanded with postwar state formation, making it a central forum for global negotiation."
    },
    {
        "name": "International Space Station",
        "category": "Influence",
        "requires": [
            {
                "type": "technology",
                "name": "Space Flight"
            }
        ],
        "yields": [
            {
                "name": "Influence",
                "value": 4,
                "for": [
                    {
                        "category": "building",
                        "name": "Production"
                    }
                ]
            }
        ],
        "description": "The International Space Station is a permanent orbital laboratory assembled from 1998 by a partnership of NASA, Roscosmos, ESA, JAXA, and CSA. It orbits at roughly 400 km, supporting continuous habitation since 2000. Major modules include Zarya, Zvezda, Unity, Destiny, Columbus, and Kibo, linked by trusses carrying power, thermal control, and guidance systems. Crews conduct research in microgravity across biology, medicine, materials, and fluid physics, while testing life-support, robotics, and long-duration mission operations. Logistics have relied on Progress and Soyuz, and later on commercial vehicles such as Dragon and Cygnus. The station has served as a platform for international cooperation, standardized docking interfaces, and technology maturation for future exploration. Planning now focuses on transition to commercial low Earth orbit stations and controlled deorbit."
    },
    {
        "name": "Terracotta Army",
        "category": "Mil Land",
        "requires": [
            {
                "type": "technology",
                "name": "Military Training"
            }
        ],
        "yields": [
            {
                "name": "Strength",
                "value": 1,
                "for": [
                    {
                        "type": "domain",
                        "name": "Land"
                    }
                ]
            }
        ],
        "description": "Discovered in 1974 near Xi’an, the Terracotta Army consists of thousands of life-sized ceramic figures buried to guard the tomb of Qin Shi Huang (r. 221–210 BCE). The figures, arranged in battle formations across multiple pits, include infantry, archers, cavalry, and charioteers. Production used modular molds for heads, hands, and armor components, with hand-finishing to individualize faces and hairstyles. Original surfaces carried lacquer and mineral pigments. Weapons, many bronze, were standardized and likely issued from centralized workshops, mirroring Qin military organization. The complex illustrates early imperial funerary doctrine, mass production techniques, and state mobilization. Ongoing excavation and conservation continue to refine understanding of kiln placement, pigment stabilization, and the logistics of third-century BCE workshop systems."
    },
    {
        "name": "Kremlin",
        "category": "Mil Land",
        "requires": [
            {
                "type": "technology",
                "name": "Military Discipline"
            }
        ],
        "yields": [
            {
                "name": "Strength",
                "value": 1,
                "for": [
                    {
                        "category": "equipment",
                        "name": "Firearm"
                    }
                ]
            }
        ],
        "description": "The Moscow Kremlin is a fortified citadel whose origins trace to a wooden enclosure of the 12th century. Between 1485 and 1495 it was rebuilt in brick under Ivan III by Italian architects, creating the present walls and towers. Within the enclosure stand the cathedrals of the Dormition, Annunciation, and Archangel, the Ivan the Great Bell Tower, and later palatial ensembles. The Kremlin served as the seat of Muscovite princes, tsars, and, after 1918, Soviet and Russian governments. It functioned as a defensive redoubt against Tatar raids and during the Time of Troubles, including the 1612 liberation from Polish forces. Ceremonies of coronation, diplomacy, and church governance took place here. Subsequent projects, such as the Grand Kremlin Palace and Armory, consolidated its political and ceremonial roles."
    },
    {
        "name": "Brandenburg Gate",
        "category": "Mil Land",
        "requires": [
            {
                "type": "technology",
                "name": "Military Tradition"
            }
        ],
        "yields": [
            {
                "name": "Attack",
                "value": 1,
                "for": [
                    {
                        "type": "concept",
                        "name": "Unit"
                    }
                ]
            }
        ],
        "description": "Constructed from 1788 to 1791 by Carl Gotthard Langhans, the Brandenburg Gate formed the western entrance to Berlin along Unter den Linden. Its Doric colonnades and passageways were topped by a quadriga sculpted by Johann Gottfried Schadow. After Napoleon removed the quadriga in 1806, it was returned in 1814 following Prussian victories. The gate served as a setting for royal processions, military parades, and public proclamations. In the 20th century it stood at the edge of the Nazi ceremonial axis, then in the Cold War no-man’s land between East and West Berlin. The fall of the Berlin Wall in 1989 restored access, making the site a focal point for reunified civic events. Conservation has stabilized sandstone surfaces and sculptural elements."
    },
    {
        "name": "Tankograd",
        "category": "Mil Land",
        "requires": [
            {
                "type": "technology",
                "name": "Tracked Treads"
            }
        ],
        "yields": [
            {
                "name": "Production",
                "value": 50,
                "type": "percent",
                "for": [
                    {
                        "type": "platform",
                        "name": "Tracked"
                    },
                    {
                        "type": "platform",
                        "name": "Truck"
                    }
                ]
            }
        ],
        "description": "Tankograd was the Soviet wartime industrial complex concentrated around Chelyabinsk and the Urals during 1941–45. After mass evacuations from the western USSR, the Chelyabinsk Kirov Plant and Uralvagonzavod integrated steelworks, foundries, and design bureaus into continuous lines. The sites produced T‑34 medium tanks, KV and IS heavy tanks, self‑propelled guns, engines, and spares at scale. Rail links fed coal and ore while dispatching finished vehicles directly to Fronts. Standardization, interchangeable parts, and dispersed workshops reduced bottlenecks and accelerated repair turnaround. The complex trained crews and mechanics and fielded mobile depots. Output underpinned Soviet deep battle mechanization from Stalingrad to Berlin. Tankograd became a model of emergency industrial mobilization, combining centralized planning with flexible shop‑floor adaptation under severe wartime constraints."
    },
    {
        "name": "Pentagon",
        "category": "Mil Land",
        "requires": [
            {
                "type": "technology",
                "name": "Hollow Charge"
            }
        ],
        "yields": [
            {
                "name": "Strength",
                "value": 1,
                "for": [
                    {
                        "type": "concept",
                        "name": "Unit"
                    }
                ]
            }
        ],
        "description": "The Pentagon, completed in 1943 in Arlington, Virginia, centralized the U.S. War Department and later the Department of Defense. Its five-ring, five-corridor plan enabled efficient movement among vast offices overseeing strategy, procurement, and logistics. From World War II through the Cold War, the building coordinated global force posture, nuclear planning, and alliance management. After 2001 it directed operations in Afghanistan and Iraq and broader counterterrorism campaigns. Joint staffs, combatant command liaisons, and acquisition agencies share the complex, integrating planning with budgeting and technology development. Redundancy in utilities, secure communications, and a dedicated heliport support continuity of operations. The Pentagon remains the principal headquarters for U.S. military command and administration."
    },
    {
        "name": "Port of Carthage",
        "category": "Mil Water",
        "requires": [
            {
                "type": "technology",
                "name": "Ship Engineering"
            },
            {
                "type": "terrain",
                "name": "Coast"
            }
        ],
        "yields": [
            {
                "name": "Production",
                "value": 2,
                "for": [
                    {
                        "type": "domain",
                        "name": "Water"
                    }
                ]
            },
            {
                "name": "Trade Slot",
                "value": 5
            }
        ],
        "description": "The Port of Carthage featured a dual-harbor complex known as the cothon, with an outer commercial basin and a circular inner naval harbor. Covered slipways, magazines, and a central admiralty island allowed rapid construction, outfitting, and deployment. Polybius noted capacity for hundreds of quinqueremes, giving Carthage the ability to surge fleets during the Punic Wars. The naval harbor’s concealed entrances enhanced security and surprise. Efficient dockyard routines supported refits, provisioning, and crew rotation for Mediterranean campaigns, including the Hannibalic War’s maritime logistics. The Romans destroyed the port in 146 BCE, yet its layout influenced later military harbors. Archaeology and ancient texts together reveal a purpose‑built system optimized for warship throughput and commercial interchange."
    },
    {
        "name": "Venetian Arsenal",
        "category": "Mil Water",
        "requires": [
            {
                "type": "technology",
                "name": "Clinker Hulls"
            },
            {
                "type": "terrain",
                "name": "Coast"
            }
        ],
        "yields": [
            {
                "name": "Production",
                "value": 4,
                "for": [
                    {
                        "type": "domain",
                        "name": "Water"
                    }
                ]
            }
        ],
        "description": "The Venetian Arsenal was the Republic of Venice’s state shipyard and armory, developed from the twelfth century and massively expanded after 1300. It integrated ropewalks, timber yards, foundries, and dock basins under public management. Standardized components and staged assembly produced galleys with unusual speed; visiting dignitaries observed near assembly‑line methods by the sixteenth century. Arsenalotti, a specialized workforce, enabled rapid mobilization for conflicts such as the Fourth Crusade and the War of Chioggia. The complex later supported gun foundry work and the fitting out of galleasses and sailing ships. Close linkage between magistracies and the yard ensured tight control of costs, stores, and strategic readiness. The Arsenal anchored Venetian maritime power over centuries."
    },
    {
        "name": "Tyneside Shipyards",
        "category": "Mil Water",
        "requires": [
            {
                "type": "technology",
                "name": "Steam Engine"
            },
            {
                "type": "terrain",
                "name": "Coast"
            }
        ],
        "yields": [
            {
                "name": "Production",
                "value": 6,
                "for": [
                    {
                        "type": "domain",
                        "name": "Water"
                    }
                ]
            }
        ],
        "description": "The Tyneside shipyards along the River Tyne formed one of Britain’s premier industrial corridors from the mid‑nineteenth century. Firms such as Armstrong Whitworth at Elswick, Swan Hunter at Wallsend, Palmer’s at Jarrow, and Hawthorn Leslie at Hebburn advanced iron and steel hull construction, marine engines, and armaments integration. The yards produced cruisers and pre‑dreadnoughts for the Royal Navy and for export, as well as passenger liners, colliers, and tankers. Elswick cruisers armed with quick‑firing guns shaped global naval markets before 1914. During both world wars, Tyneside delivered escorts, minelayers, and merchant tonnage at scale. The region also launched notable liners, including RMS Mauretania. Post‑1945, competition and restructuring reduced capacity, yet Tyneside’s engineering traditions influenced later offshore and repair work."
    },
    {
        "name": "Blohm & Voss",
        "category": "Mil Water",
        "requires": [
            {
                "type": "technology",
                "name": "Artillery"
            },
            {
                "type": "terrain",
                "name": "Coast"
            }
        ],
        "yields": [
            {
                "name": "Production",
                "value": 8,
                "for": [
                    {
                        "type": "domain",
                        "name": "Water"
                    }
                ]
            }
        ],
        "description": "Blohm & Voss, founded in Hamburg in 1877, became a major German shipyard and later an aircraft producer. Before 1914 it built steel merchantmen and naval vessels. In the 1930s–40s it constructed capital ships, including the battleship Bismarck, and series of Type IX U‑boats, while its aircraft division produced BV 138 and BV 222 flying boats for maritime reconnaissance and transport. The yard employed modular methods and large slipways but suffered heavy bombing. Postwar reconstruction shifted output to tankers, container ships, and later naval projects, including work on modular MEKO‑type frigates within ThyssenKrupp Marine Systems. Blohm & Voss exemplifies long‑run adaptation of a shipbuilding enterprise across imperial, Nazi, and Federal German eras."
    },
    {
        "name": "Hyundai Heavy Industries",
        "category": "Mil Water",
        "requires": [
            {
                "type": "technology",
                "name": "Global Army"
            },
            {
                "type": "terrain",
                "name": "Coast"
            }
        ],
        "yields": [
            {
                "name": "Production",
                "value": 10,
                "for": [
                    {
                        "type": "domain",
                        "name": "Water"
                    }
                ]
            }
        ],
        "description": "Hyundai Heavy Industries, established at Ulsan in 1972, created the world’s largest contiguous shipyard through vast drydocks, Goliath cranes, and integrated steel fabrication. The complex builds ultra‑large container ships, VLCC tankers, LNG carriers, and offshore platforms such as rigs and FPSOs. It also delivers naval programs, including KDX‑III Aegis destroyers that modernized the Republic of Korea Navy’s air‑defense and command capabilities. Vertical integration spans engines, propellers, and electronics, enabling schedule control and cost competitiveness. From the late twentieth century it anchored South Korea’s export‑led growth and global shipbuilding leadership. The yard’s scale and modular block construction established benchmarks adopted across Asia."
    },
    {
        "name": "Colossus",
        "category": "Trade",
        "requires": [
            {
                "type": "technology",
                "name": "Bronze Casting"
            },
            {
                "type": "terrain",
                "name": "Coast"
            }
        ],
        "yields": [
            {
                "name": "Trade Range",
                "value": 50,
                "type": "percent"
            }
        ],
        "description": "The Colossus of Rhodes was a Hellenistic bronze statue of Helios erected after the siege of 305–304 BCE. Built by Chares of Lindos and completed c. 280 BCE, it stood roughly 33 meters high near the harbor, funded by the sale of captured siege equipment. The structure used an iron framework with bronze plates and stone infill. Ancient accounts praised its technical daring and coastal prominence, which drew travelers and merchants to the island. An earthquake in 226 BCE toppled the figure; its remains lay on the ground for centuries before being sold as scrap in late antiquity. The Colossus entered later lists of the Seven Wonders and marked Rhodes’ naval and commercial ascendancy."
    },
    {
        "name": "Mosque of Djenne",
        "category": "Trade",
        "requires": [
            {
                "type": "technology",
                "name": "Trade Caravans"
            },
            {
                "type": "terrain",
                "name": "Desert"
            }
        ],
        "yields": [
            {
                "name": "Trade Range",
                "value": 100,
                "type": "percent"
            }
        ],
        "description": "The Great Mosque of Djenné in Mali is the largest adobe mosque and a focal point of Sahelian urban life. The current structure, completed in 1907 on an earlier medieval site, uses sun‑dried mud bricks, palm‑wood toron, and earthen plaster. It anchors a weekly market serving the Niger Inland Delta and long functioned alongside scholar houses and manuscript libraries. During the medieval trans‑Saharan trade, caravans linked Djenné and Timbuktu with North Africa, exchanging gold, salt, and textiles. Annual communal replastering maintains the walls before the rainy season, preserving construction techniques and social organization. The mosque’s scale and civic role attest to the region’s Islamic learning and merchant networks."
    },
    {
        "name": "Grand Canal",
        "category": "Trade",
        "requires": [
            {
                "type": "technology",
                "name": "Industrialization"
            },
            {
                "type": "concept",
                "name": "Major River"
            }
        ],
        "yields": [
            {
                "name": "Trade Slot",
                "value": 3,
                "for": [
                    {
                        "type": "special",
                        "name": "All cities with River"
                    }
                ]
            }
        ],
        "description": "The Grand Canal of China is a continuous inland waterway linking the Yangzi basin with northern capitals. Initiated in early sections before the Qin, it was unified and expanded under the Sui in the 7th century and repeatedly restored by the Yuan, Ming, and Qing. Pound locks, dredging, and embankments enabled bulk movement of grain tribute to Beijing and sustained administrative integration. At its height the canal extended more than 1,700 kilometers, supporting urban growth at Suzhou, Hangzhou, and along the North China Plain. Its techniques and logistics informed later canalization elsewhere; in industrial Britain, canal networks achieved similar cost reductions for coal and goods. The Grand Canal remains an active transport and irrigation system."
    },
    {
        "name": "Tempelhof Airport",
        "category": "Trade",
        "requires": [
            {
                "type": "technology",
                "name": "Flight"
            }
        ],
        "yields": [
            {
                "name": "Trade Range",
                "value": 25,
                "type": "percent"
            }
        ],
        "description": "Tempelhof Airport in Berlin evolved from a prewar airfield into one of Europe’s earliest major airports. The monumental terminal, built in the 1930s, formed a sweeping arc that integrated hangars, passenger facilities, and logistical space. During the Berlin Blockade of 1948–1949, Tempelhof became a strategic lifeline. Allied C-47 and C-54 aircraft delivered coal, food, and medicine in continuous rotations. The airlift demonstrated large-scale air logistics under political pressure. In the interwar and postwar periods, Tempelhof handled European routes and training flights. It later hosted charter and short-haul services as other Berlin airports expanded. Operations ceased in 2008, after which the airfield became a public space. The site remains a reference point for aviation infrastructure, emergency air supply operations, and urban planning tied to air commerce."
    },
    {
        "name": "Bailey Yard",
        "category": "Trade",
        "requires": [
            {
                "type": "technology",
                "name": "Globalization"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 2,
                "for": [
                    {
                        "type": "special",
                        "name": "All cities with Railroad"
                    }
                ]
            }
        ],
        "description": "Bailey Yard at North Platte, Nebraska, is the world’s largest railroad classification yard. Operated by Union Pacific, it stretches for miles and includes extensive receiving, hump, and departure facilities. Opened in the mid-20th century and later expanded, the yard sorts thousands of cars daily for transcontinental routes. Two hump yards feed automated retarders and switches that block cars by destination. Diesel shops, fueling stations, and inspection tracks keep locomotives and rolling stock in service. Intermodal traffic and mixed freight move through with tight dwell-time controls. The yard’s scale supports nationwide logistics consolidation and just-in-time delivery. Its role mirrors the shift from carload to unit train and intermodal dominance in the United States. Bailey Yard remains a case study in railroad process engineering and network efficiency."
    },
    {
        "name": "Pharos of Alexandria",
        "category": "Water",
        "requires": [
            {
                "type": "technology",
                "name": "Celestial Navigation"
            },
            {
                "type": "terrain",
                "name": "Coast"
            }
        ],
        "yields": [
            {
                "name": "Moves",
                "value": 1,
                "for": [
                    {
                        "type": "domain",
                        "name": "Water"
                    }
                ]
            }
        ],
        "description": "The Pharos of Alexandria was a monumental lighthouse on the island of Pharos, built under Ptolemy II in the 3rd century BCE. Designed by Sostratus of Cnidus, it rose in tiered stages to an estimated height exceeding 100 meters. A beacon fire and polished metal apparatus projected light to sea, aiding navigation into the busy harbors of Alexandria. The structure combined masonry mass with refined architectural detailing. Ancient travelers, pilots, and traders relied on the Pharos during Hellenistic and Roman periods. Earthquakes in the medieval era damaged and ultimately toppled it. Stones later served in coastal fortifications. As a navigation aid and engineering feat, the lighthouse set a durable model for coastal beacons. It anchored maritime safety and trade at one of antiquity’s principal ports."
    },
    {
        "name": "Moai Statues",
        "category": "Water",
        "requires": [
            {
                "type": "technology",
                "name": "Compass"
            },
            {
                "type": "terrain",
                "name": "Coast"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 1,
                "for": [
                    {
                        "type": "terrain",
                        "name": "Sea"
                    }
                ]
            },
            {
                "name": "Gold",
                "value": 1,
                "for": [
                    {
                        "type": "terrain",
                        "name": "Sea"
                    }
                ]
            }
        ],
        "description": "The moai are monolithic statues erected on Rapa Nui (Easter Island) between roughly 1200 and 1600 CE. Carved from volcanic tuff at Rano Raraku and other quarries, they depict stylized human figures with elongated heads. Many were raised on stone platforms called ahu and oriented inland toward settlements. Construction and transport methods remain debated, with rolling, sledging, and upright “walking” theories supported by experimental archaeology. The moai formed part of a ritual landscape linked to ancestor veneration and coastal wayfinding in a seafaring society. European contact in the 18th century coincided with social stresses and statue toppling. Modern restorations, including Ahu Tongariki, re-erected several groups. The statues endure as evidence of Polynesian engineering, organized labor, and insular resource management aligned to oceanic lifeways."
    },
    {
        "name": "West India Docks",
        "category": "Water",
        "requires": [
            {
                "type": "technology",
                "name": "Royal Charter"
            },
            {
                "type": "terrain",
                "name": "Coast"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 3,
                "for": [
                    {
                        "category": "improvement",
                        "name": "Boats",
                        "special": "All cities"
                    }
                ]
            }
        ],
        "description": "Opened in 1802 on the Isle of Dogs, the West India Docks created a secure, enclosed system for ships trading with the Caribbean. The complex granted the West India Dock Company a time-limited monopoly on West Indies imports. Sugar, rum, coffee, and dye woods entered bonded warehouses under strict customs control. Purpose-built basins, hydraulic cranes, and transit sheds reduced pilferage and turnaround time. The docks functioned within the Navigation Acts framework and London’s expanding mercantile finance. Railway links and lighterage connected the docks to inland markets. Damage in the Blitz and later containerization eroded their commercial role. Operations consolidated and then declined in the late 20th century. The area’s redevelopment into Canary Wharf reshaped the site, while dock basins and structures preserve its maritime-industrial heritage."
    },
    {
        "name": "Panama Canal",
        "category": "Water",
        "requires": [
            {
                "type": "technology",
                "name": "Hydrodynamics"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 2,
                "for": [
                    {
                        "type": "concept",
                        "name": "Trade Route"
                    }
                ]
            }
        ],
        "description": "The Panama Canal, opened in 1914, links the Atlantic and Pacific Oceans through a lock-and-lake system across the Isthmus of Panama. The United States completed the project after a failed French effort, using dams and locks at Gatun, Pedro Miguel, and Miraflores. The canal shortened global routes and supported a two-ocean navy posture. It enabled liner schedules and bulk trades that bypassed Cape Horn. The Torrijos–Carter Treaties transferred canal control to Panama in 1999. A third set of locks, inaugurated in 2016, admitted New Panamax vessels and expanded capacity. The waterway remains sensitive to rainfall and watershed management. Its operation continues to shape shipping economics, naval planning, and port development patterns across the Americas, Europe, and Asia."
    },
    {
        "name": "Port of Shanghai",
        "category": "Water",
        "requires": [
            {
                "type": "technology",
                "name": "Globalization"
            },
            {
                "type": "terrain",
                "name": "Coast"
            }
        ],
        "yields": [
            {
                "name": "Gold",
                "value": 5,
                "for": [
                    {
                        "category": "improvement",
                        "name": "Boats",
                        "special": "All cities"
                    }
                ]
            }
        ],
        "description": "The Port of Shanghai became the world’s busiest container port in the 2010s through integrated deep-water, river, and coastal facilities. Yangshan Deep-Water Port, opened in 2005 and linked by the Donghai Bridge, enabled year-round access for ultra-large container ships. Waigaoqiao and other terminals handle feeder and riverine flows connecting the Yangtze basin’s manufacturing corridors. Automated yards, high-capacity cranes, and advanced terminal operating systems manage high TEU throughput. Customs and bonded logistics zones support re-export and value-added services. Rail and barge networks reduce hinterland bottlenecks. Continuous dredging and berth expansions accommodate larger vessel classes. The port anchors global liner rotations across the Pacific and Indian Oceans. Its scale illustrates China’s containerization growth and integrated maritime-logistics planning."
    },
    {
        "name": "Walls of Constantinople",
        "category": "Defense",
        "requires": [
            {
                "type": "technology",
                "name": "Iron Casting"
            }
        ],
        "yields": [
            {
                "name": "Defense",
                "value": 7,
                "for": [
                    {
                        "category": "building",
                        "name": "Defense"
                    }
                ]
            }
        ],
        "description": "The Walls of Constantinople, including the 5th-century Theodosian Walls, formed a layered defense system protecting the Byzantine capital. A moat, outer wall, and massive inner curtain with towers created depth in defense. Repairs after earthquakes and sieges maintained readiness. The fortifications withstood major assaults, such as the Avar-Persian siege of 626 and the Arab siege of 717–718. The city fell in 1204 when the Fourth Crusade breached the sea defenses with naval support. In 1453, Ottoman artillery and sapping opened decisive breaches on the landward front. Despite these defeats, the walls shaped siegecraft, artillery deployment, and urban defense planning for a millennium. Surviving sections, gates, and inscriptions document continuous military adaptation and imperial investment in frontier security."
    },
    {
        "name": "Great Wall",
        "category": "Defense",
        "requires": [
            {
                "type": "technology",
                "name": "Feudalism"
            }
        ],
        "gains": [
            {
                "type": "improvement",
                "name": "Bastion",
                "value": 12
            }
        ],
        "description": "The Great Wall comprises networks of ramparts, beacon towers, and garrisons along northern China’s frontier. While earlier walls existed, the most substantial works date to the Ming dynasty, from the 14th to 16th centuries. Brick-faced walls, crenellations, and signal stations improved endurance and communication. The system aimed to control crossings, deter Mongol and Jurchen raids, and regulate trade and smuggling. Garrisons and supply depots supported patrols across rugged terrain. Strategic passes, such as Shanhai Pass and Juyong Pass, became fortified choke points. Maintenance and military relevance fluctuated with court priorities and frontier dynamics. Later centuries saw neglect and reuse of materials. Today, restored segments and ruins demonstrate layered construction methods and the logistical demands of long-distance border defense."
    },
    {
        "name": "Suomenlinna",
        "category": "Defense",
        "requires": [
            {
                "type": "technology",
                "name": "Dynamite"
            },
            {
                "type": "terrain",
                "name": "Coast"
            }
        ],
        "yields": [
            {
                "name": "Range",
                "value": 1,
                "for": [
                    {
                        "type": "concept",
                        "name": "City"
                    }
                ]
            },
            {
                "name": "Attack",
                "value": 2,
                "for": [
                    {
                        "type": "concept",
                        "name": "City"
                    }
                ]
            }
        ],
        "description": "Suomenlinna is a sea fortress on islands off Helsinki, begun by Sweden in 1748 as Sveaborg to protect the Gulf of Finland approaches. It employed bastioned traces, dry docks, and coastal batteries suited to archipelago warfare. The fortress capitulated to Russia in 1808 and served as a Baltic garrison and naval base during imperial rule. Anglo-French forces bombarded it in the Crimean War, prompting modernization of artillery and works. After Finnish independence, Suomenlinna housed coastal defense units and workshops. Its casemates, barracks, and dockyards illustrate transitions from smoothbore guns to rifled artillery and later coastal pieces. The site now preserves layered fortification phases and urban-military landscapes. It remains central to understanding Nordic coastal defense and Helsinki’s maritime history."
    },
    {
        "name": "Maginot Line",
        "category": "Defense",
        "requires": [
            {
                "type": "technology",
                "name": "Civil Defense"
            }
        ],
        "gains": [
            {
                "type": "improvement",
                "name": "Trenches",
                "value": 12
            }
        ],
        "description": "The Maginot Line was an interwar French fortification system guarding the German border from Luxembourg to Switzerland. Built from 1929 to 1938 under André Maginot’s program, it combined deep underground ouvrages, armored turrets, anti-tank obstacles, and integrated communications. Major complexes such as Ouvrage Hackenberg and Ouvrage Schoenenbourg housed artillery, power plants, and garrisons linked by rail tunnels. The network aimed to deter invasion and channel attacks into Belgium while economizing manpower. In 1940 the German army bypassed the heaviest sectors via the Ardennes and the Low Countries, exploiting gaps in mobile defense and doctrine rather than the forts themselves. Many ouvrages resisted localized assaults but were isolated after breakthroughs. The system influenced later Cold War fortifications and remains a case study in fixed defense versus maneuver warfare."
    },
    {
        "name": "Circus Maximus",
        "category": "Other",
        "requires": [
            {
                "type": "technology",
                "name": "Riding"
            }
        ],
        "yields": [
            {
                "name": "Strength",
                "value": 1,
                "for": [
                    {
                        "category": "platform",
                        "name": "Mounted"
                    }
                ]
            }
        ],
        "description": "The Circus Maximus was Rome’s principal chariot racing stadium, situated in the valley between the Palatine and Aventine hills. Originating in the regal and Republican periods, it achieved monumental scale under Julius Caesar and subsequent emperors, reaching lengths over 600 meters and seating for well over 100,000 spectators. The arena hosted chariot races, gladiatorial displays, animal hunts, and the Ludi Romani festivals that tied civic religion to mass entertainment. Imperial triumphal processions and public ceremonies also used the space. The central spina carried obelisks and turning posts, while elaborate starting gates regulated race heats. Fires and floods prompted repeated reconstructions in stone and concrete. The venue functioned through late antiquity, declining as public funds and urban ritual waned. Today its outline remains a central archaeological park."
    },
    {
        "name": "Hoover Dam",
        "category": "Other",
        "requires": [
            {
                "type": "technology",
                "name": "Hydrodynamics"
            }
        ],
        "yields": [
            {
                "name": "Food",
                "value": 3,
                "for": [
                    {
                        "type": "terrain",
                        "name": "Desert"
                    }
                ]
            }
        ],
        "gains": [
            {
                "type": "resource",
                "name": "Electricity",
                "value": 8
            }
        ],
        "description": "Hoover Dam is a concrete arch-gravity dam on the Colorado River at Black Canyon, completed in 1936 by the U.S. Bureau of Reclamation. Built during the New Deal, it provided large-scale hydroelectricity, water storage, and flood control for the American Southwest. The impounded Lake Mead became a key reservoir supporting irrigation and urban growth in Nevada, Arizona, and California. Construction required diversion tunnels, highline cableways, and interlocking concrete blocks cooled by embedded pipe. The powerhouse delivered power to regional grids, underwriting industrial development in Los Angeles and beyond. The project formalized river compacts and set precedents in federal water management. Hoover Dam remains an engineering landmark and a central node in the Lower Colorado system."
    },
    {
        "name": "Three Gorges Dam",
        "category": "Other",
        "requires": [
            {
                "type": "technology",
                "name": "Renewable Energy"
            }
        ],
        "gains": [
            {
                "type": "resource",
                "name": "Electricity",
                "value": 1
            }
        ],
        "description": "The Three Gorges Dam spans the Yangtze River at Sandouping in Hubei, completed in stages from 2003 to 2012. It is the world’s largest hydroelectric installation by installed capacity, integrating a gravity dam, spillways, and dual navigation systems. Its generators supply gigawatt-scale power to central and eastern China, stabilizing regional grids and supporting industrial demand. The reservoir enhances flood control for the middle and lower Yangtze and improves navigation through ship locks and a ship lift that moves vessels past the dam. Construction involved massive resettlement and sediment management programs, with continuing debates over ecology and heritage loss. The project follows earlier Republican-era proposals and marks the culmination of long-term planning in Chinese water engineering."
    },
    {
        "name": "Lockheed Skunk Works",
        "category": "Other",
        "requires": [
            {
                "type": "technology",
                "name": "Fly-by-wire"
            }
        ],
        "description": "The Lockheed Skunk Works, officially known as the Advanced Development Programs of Lockheed Martin, is a division dedicated to pioneering aerospace innovation and secretive military projects. Founded in 1943 under the leadership of Clarence Kelly Johnson, it earned its reputation by rapidly developing the P-80 Shooting Star, the first operational U.S. jet fighter. Skunk Works became central to Cold War aviation, producing groundbreaking designs such as the U-2 spy plane, SR-71 Blackbird, and F-117 Nighthawk, each advancing stealth, reconnaissance, or high-speed flight. Its culture emphasizes streamlined engineering teams, rapid prototyping, and strict secrecy, allowing it to deliver complex projects under demanding timelines. Now based in Palmdale, California, the division continues to design advanced aircraft and next-generation systems. Skunk Works remains synonymous with technological breakthroughs in aerospace, balancing innovation with the classified requirements of defense and intelligence operations."
    },
    {
        "name": "Temple of Artemis",
        "category": "Other",
        "requires": [
            {
                "type": "technology",
                "name": "Archery"
            }
        ],
        "yields": [
            {
                "name": "Strength",
                "value": 1,
                "for": [
                    {
                        "category": "equipment",
                        "name": "Ranged"
                    }
                ]
            }
        ],
        "description": "The Temple of Artemis at Ephesus was a grand Ionian sanctuary dedicated to Artemis, rebuilt repeatedly from the Archaic period through the 4th century BCE. The best-known version, attributed to architects Chersiphron and later to Dinocrates-era rebuilds, used marble columns over 18 meters high set on a marshy foundation stabilized with charcoal and fleeces. It served as a major pilgrimage center and treasury for the city, hosting processions and sacrifices tied to civic identity. Ancient writers included it among the Seven Wonders. The structure suffered from arson by Herostratus in 356 BCE and later destruction in late antiquity. Archaeology at Selçuk has recovered column drums, sculpted bases, and votive material, illustrating the scale and influence of Ionian temple design."
    },
    {
        "name": "Olympiad Field",
        "category": "Other",
        "requires": [
            {
                "type": "technology",
                "name": "Sports"
            }
        ],
        "yields": [
            {
                "name": "Influence",
                "value": 6
            }
        ],
        "description": " \"The Olympiad Field was the athletic complex at Olympia in the western Peloponnese, used for the Olympic Games of ancient Greece. It occupied a flat area beside the Alpheios River, bordered by the sanctuary of Zeus and associated temples and treasuries. The site included a stadium for footraces, a hippodrome for chariot and horse competitions, training areas, baths, and housing for officials and athletes. Games were held at four-year intervals beginning in the eighth century BCE, featuring events such as running, wrestling, boxing, and the pentathlon. Victors were recorded and honored with olive wreaths. The site developed through the Archaic and Classical periods with successive reconstructions of the stadium and surrounding structures. Activity continued into the Roman era until the late fourth century CE, when the games ceased under imperial decree. The Olympiad Field preserves the layout and material remains of the earliest organized athletic venue in Greece."
    },
    {
        "name": "Orban's Foundry",
        "category": "Other",
        "requires": [
            {
                "type": "technology",
                "name": "Gunpowder"
            }
        ],
        "yields": [
            {
                "name": "Strength",
                "value": 1,
                "for": [
                    {
                        "category": "equipment",
                        "name": "Siege"
                    }
                ]
            }
        ],
        "description": "Orban’s foundry refers to the workshop and expertise of the cannon founder Orban, active in the mid-15th century in service to the Ottoman court. In 1453 he supervised the casting of giant bombards, including the Great Turkish Bombard, for Sultan Mehmed II’s siege of Constantinople. These wrought and cast bronze pieces fired enormous stone balls capable of breaching medieval ashlar walls, a capability proven against the Theodosian defenses after sustained bombardment. The enterprise required advanced metallurgy, large furnaces, precise mold making, and coordinated logistics for transport and emplacements. Firing rates were low and reliability variable, but psychological and structural effects were decisive. Orban had earlier sought patronage in Christian courts, indicating the cross-border market for gunnery expertise. His work marked a transition from traditional siege engines to gunpowder artillery dominance in Mediterranean warfare and influenced subsequent Ottoman and European siege practices."
    },
    {
        "name": "Schneider Cup",
        "category": "Other",
        "requires": [
            {
                "type": "technology",
                "name": "Rocketry"
            }
        ],
        "yields": [
            {
                "name": "Strength",
                "value": 2,
                "for": [
                    {
                        "type": "domain",
                        "name": "Air"
                    }
                ]
            }
        ],
        "description": "The Schneider Cup was an international seaplane racing series founded in 1913 by Jacques Schneider to spur advances in maritime aviation. Nations fielded high-speed floatplanes that pushed aerodynamics, lightweight structures, and high-output piston engines. British, Italian, and American teams dominated different eras. The Supermarine S.6B’s 1931 victory set records and informed R. J. Mitchell’s design approach for the Spitfire. Macchi M.39 and M.C.72 programs advanced surface radiators and powerplant development in Italy. The contest ended after Britain’s 1931 retention of the trophy. Its legacy persisted in speed record pursuits and military fighter design of the 1930s."
    }
]
